{
  "id": 100332,
  "url": "https://dodgeball.livejournal.com/100332.html",
  "title": "You Got SERVED",
  "date": "",
  "body_text": "MEGILL & C. ADAMS in C30 Rematch:\nOnly at the Thanksgiving '08 Special!\nSeems like every \"Turkey Day\" weekend has come to produce the best all-around action and excitement for the\nEastCoastDodgeball\nfan. 2008's main attraction was no different as it pitted two of the sport's biggest icons in one explosive contest: Legend\nChris Adams\nversus Legend\nKevin Megill\nin this Thanksgiving blockbuster!\nWith competitors the caliber of the respected pack leaders, it was almost certain more than sweet corn, mashed potatoes, and buttered biscuits would be served on this holiday weekend. The turkey wasn't the only thing stuffed either - just ask the slew of Kevin Fitzpatrick victims! The intense Adams-ally impressed spectators and fans alike with numerous grabs and bodyshots throughout this \"holiday horror\".\nBut on the other side, leading his pack to victory, was one \"Madman\" Megill who too dominated many of his opposing forces. Following the fourth round, the southpaw effectively regrouped and re-energized his firing squad. The evenly-fought encounter had drastically altered to a one-sided killing spree.\nFlash Results by Game\nMegill: 1, 2, 5, 6, 7, 8\nAdams: 3, 4\nMentally draining, physically taxing, with casualties!\nECD\napplauds the efforts of all those involved in the Thanksgiving '08 Special!\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Kevin Megill defeated Chris Adams, 6 - 2, in a\nDODGEBALL C30\nrematch. Megill won the first match between the two as well.\nCaptains Statistics\n: Megill 7-1-1 / Adams 6-7-0.\nMegill\nbecame only the fourth competitor in history to reach 7 total victories along with Juan Londono (7), John Tronolone (7), and Kevin Adams (9).\nC. Adams\njoins Ryan Letsche for the second most number of total losses with 7. John Tronolone is the current record holder with 8.\nMoments & Stars\n: Kevin Megill's nutshot on Juan Londono in Game 1; Lauren Stopa's phenomenal fumble-catch in Game 4\nAttendance\n: 24, comprised of 18 men and 6 women. The was the first turnout above 20 since DODGEBALL 161.\nFamiliar Faces\nincluded superstars briefly returning home from college: Bethany Schonberg, Kevin Adams, Kelsey Clayton, and Sara DeCuir. The duo of Pierce and Stopa as well as Pam D'Luhy also paid a visit after a month-long stretch of inactivity.\nWhat's With These Lights!?\nDue to the confusing tennis lights issue, DODGEBALL 166 started at 6:30pm, rather early for a standard event. It was first thought the bright lights would only illuminate the hallowed battlegrounds until 9pm. But as luck would have, play resumed past that mark and the sacred spotlights magically yet mysteriously shut off by 10pm. It will be very interesting to see how this situation unfolds in the coming weeks.\n________________________________________\n_________________\nSecond Half of Season 17 Continues!\nDODGEBALL 167: December 6, 2008\nThis is number 10. Feared factions\nWALL\nand\nALL\ncollide one last time before year's end.\nDODGEBALL 168: December 13, 2008\nThe\nSecret Selection\nis back and YOU get to decide on this lucky 13th of December! Participants have the opportunity of selecting from four possible options:\nEnduraDodgeball\n,\nBoxBall Dodgeball\n, Chris Adams's unnamed \"SuperMario\" Dodgeball, or a\nClassic two-team war\n.\nDODGEBALL 169: December 20, 2008\nECD's\n3rd Annual Holiday Spectacular will deliver when two of the game's finest compete in one-on-one action. Blocking magician\nJustin Wolf\nmeets powerhouse\nKevin Fitzpatrick\nin a first-time meeting!\nDODGEBALL 170: December 27, 2008\nThe close-out event of the year and what a show it is going to be. In the feverishly-awaited main attraction, rookie-of-the-year contender\nMichelle Mullins\nfiercely battles catching monster\nMichael \"Sputz\" Krott\n- it's \"David v. Goliath\" and it can only happen at the Season 17 Finale!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball166A.jpg\" vspace=\"2\"><big><big><b>MEGILL &amp; C. ADAMS in C30 Rematch:</b></big><br/><i>Only at the Thanksgiving '08 Special!</i></big><br/><br/>Seems like every \"Turkey Day\" weekend has come to produce the best all-around action and excitement for the <i>EastCoastDodgeball</i> fan. 2008's main attraction was no different as it pitted two of the sport's biggest icons in one explosive contest: Legend <b>Chris Adams</b> versus Legend <b>Kevin Megill</b> in this Thanksgiving blockbuster!<br/><br/>With competitors the caliber of the respected pack leaders, it was almost certain more than sweet corn, mashed potatoes, and buttered biscuits would be served on this holiday weekend. The turkey wasn't the only thing stuffed either - just ask the slew of Kevin Fitzpatrick victims! The intense Adams-ally impressed spectators and fans alike with numerous grabs and bodyshots throughout this \"holiday horror\".<br/><br/>But on the other side, leading his pack to victory, was one \"Madman\" Megill who too dominated many of his opposing forces. Following the fourth round, the southpaw effectively regrouped and re-energized his firing squad. The evenly-fought encounter had drastically altered to a one-sided killing spree.<br/><br/><u>Flash Results by Game</u><br/>Megill: 1, 2, 5, 6, 7, 8 <br/>Adams: 3, 4<br/><br/>Mentally draining, physically taxing, with casualties! <i>ECD</i> applauds the efforts of all those involved in the Thanksgiving '08 Special!<br/><br/><b>The Rules</b>: Classic two-team match-up.<br/><b>The Match</b>: Kevin Megill defeated Chris Adams, 6 - 2, in a <a href=\"http://dodgeball.livejournal.com/2008/03/16/\" target=\"_blank\">DODGEBALL C30</a> rematch. Megill won the first match between the two as well.<br/><b>Captains Statistics</b>: Megill 7-1-1 / Adams 6-7-0.<br/><u>Megill</u> became only the fourth competitor in history to reach 7 total victories along with Juan Londono (7), John Tronolone (7), and Kevin Adams (9).<br/><u>C. Adams</u> joins Ryan Letsche for the second most number of total losses with 7. John Tronolone is the current record holder with 8.<br/><b>Moments &amp; Stars</b>: Kevin Megill's nutshot on Juan Londono in Game 1; Lauren Stopa's phenomenal fumble-catch in Game 4<br/><b>Attendance</b>: 24, comprised of 18 men and 6 women. The was the first turnout above 20 since DODGEBALL 161.<br/><b>Familiar Faces</b> included superstars briefly returning home from college: Bethany Schonberg, Kevin Adams, Kelsey Clayton, and Sara DeCuir. The duo of Pierce and Stopa as well as Pam D'Luhy also paid a visit after a month-long stretch of inactivity.<br/><br/><b>What's With These Lights!?</b><br/>Due to the confusing tennis lights issue, DODGEBALL 166 started at 6:30pm, rather early for a standard event. It was first thought the bright lights would only illuminate the hallowed battlegrounds until 9pm. But as luck would have, play resumed past that mark and the sacred spotlights magically yet mysteriously shut off by 10pm. It will be very interesting to see how this situation unfolds in the coming weeks.<br/><br/><center><big>________________________________________<wbr/>_________________<br/><br/><b>Second Half of Season 17 Continues!</b></big></center><br/><i>DODGEBALL 167: December 6, 2008</i><br/>This is number 10. Feared factions <b>WALL</b> and <b>ALL</b> collide one last time before year's end.<br/><br/><i><big>DODGEBALL 168: December 13, 2008</big></i><br/>The <b>Secret Selection</b> is back and YOU get to decide on this lucky 13th of December! Participants have the opportunity of selecting from four possible options: <i>EnduraDodgeball</i>, <i>BoxBall Dodgeball</i>, Chris Adams's unnamed \"SuperMario\" Dodgeball, or a <i>Classic two-team war</i>. <br/><br/><big><i>DODGEBALL 169: December 20, 2008</i></big><br/><i>ECD's</i> 3rd Annual Holiday Spectacular will deliver when two of the game's finest compete in one-on-one action. Blocking magician <b>Justin Wolf</b> meets powerhouse <b>Kevin Fitzpatrick</b> in a first-time meeting!<br/><br/><big><i>DODGEBALL 170: December 27, 2008</i></big><br/>The close-out event of the year and what a show it is going to be. In the feverishly-awaited main attraction, rookie-of-the-year contender <b>Michelle Mullins</b> fiercely battles catching monster <b>Michael \"Sputz\" Krott</b> - it's \"David v. Goliath\" and it can only happen at the Season 17 Finale! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball166A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}