{
  "id": 101180,
  "url": "https://dodgeball.livejournal.com/101180.html",
  "title": "In GOD'S Hands",
  "date": "",
  "body_text": "GOLDRUSH 2008!\nA lot can happen in a year, hence the return of\nEastCoastDodgeball's\nprestigious\nGold Awards\n! Categories both new and old, as well as the deserving nominees will all be announced live at C70! A must attend even for this reason!\n\"DAVID v. GOLIATH\" Main Event!\nIt's the unearthly showdown between two of the game's superpowers. On one side, an individual who has yearned for this opportunity to prove that she can knock down the giants of the game with ease. On the other, perhaps the most intimidating monster of them all. In\nECD's\nyear-end spectacular, \"Legend Killer\"\nMICHELLE MULLINS\nepically collides with the catching mammoth\nMICHAEL \"SPUTZ\" KROTT\nin the long-awaited \"David v. Goliath\" one-on-one confrontation.\nFor Mullins, this is her first big go-around in the season finale spotlight. The female fury won first overall choice at ONE SIXTY-NINE and it should be very interesting to see how things will unfold. \"Sputz\" on the hand no stranger to the limelight, himself a season finale headliner. Although this contest ends his singles-career drought, the catching machine will have the edge heading in to DODGEBALL C70.\nOnline Exclusive: BREAKING NEWS!\nAs if a match of this magnitude really needed any more ... Both army chiefs have mutually agreed to a special stipulation where indeed one's fate lays in God's hands. For the very first time in ten event history,\nECD\npresents Mullins v. Krott in an unprecedented\nGodMode Rules\nencounter! What will the dodgeball world become after C70 is over?! Find out live 12/27!\nExtra, Extra, Extra!\nKick-ass Soundtrack? Got it. Glowing decorations? You bet! A celebratory afterparty? Of course!\nThere is no reason for your absence at the premier event to cap off a memorable 2008. The Wall High School battlegrounds are the place to be come this\nSaturday, December 27\n. The fierce action will get underway beginning at\n6pm\n.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><big><big>GOLDRUSH 2008!</big></big><br/>A lot can happen in a year, hence the return of <i>EastCoastDodgeball's</i> prestigious <i>Gold Awards</i>! Categories both new and old, as well as the deserving nominees will all be announced live at C70! A must attend even for this reason!<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball170A.jpg\" vspace=\"3\"><big><big>\"DAVID v. GOLIATH\" Main Event!</big></big><br/>It's the unearthly showdown between two of the game's superpowers. On one side, an individual who has yearned for this opportunity to prove that she can knock down the giants of the game with ease. On the other, perhaps the most intimidating monster of them all. In <i>ECD's</i> year-end spectacular, \"Legend Killer\" <b>MICHELLE MULLINS</b> epically collides with the catching mammoth <b>MICHAEL \"SPUTZ\" KROTT</b> in the long-awaited \"David v. Goliath\" one-on-one confrontation.<br/><br/>For Mullins, this is her first big go-around in the season finale spotlight. The female fury won first overall choice at ONE SIXTY-NINE and it should be very interesting to see how things will unfold. \"Sputz\" on the hand no stranger to the limelight, himself a season finale headliner. Although this contest ends his singles-career drought, the catching machine will have the edge heading in to DODGEBALL C70.<br/><br/><i><u><b>Online Exclusive: BREAKING NEWS!</b></u></i><br/>As if a match of this magnitude really needed any more ... Both army chiefs have mutually agreed to a special stipulation where indeed one's fate lays in God's hands. For the very first time in ten event history, <i>ECD</i> presents Mullins v. Krott in an unprecedented <i>GodMode Rules</i> encounter! What will the dodgeball world become after C70 is over?! Find out live 12/27!<br/><br/><big><big>Extra, Extra, Extra!</big></big><br/>Kick-ass Soundtrack? Got it. Glowing decorations? You bet! A celebratory afterparty? Of course!<br/><br/><br/><br/><big>There is no reason for your absence at the premier event to cap off a memorable 2008. The Wall High School battlegrounds are the place to be come this <u>Saturday, December 27</u>. The fierce action will get underway beginning at <u>6pm</u>.</big></img></big> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball170A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}