{
  "id": 101474,
  "url": "https://dodgeball.livejournal.com/101474.html",
  "title": "This Isn't GOODBYE .. It's SEE YOU LATER",
  "date": "",
  "body_text": "It was promised that at 2009's kick-off event, DODGEBALL 171, a certain announcement would send shockwaves across the\nEastCoastDodgeball\ncommunity.\n\"The Writer's\" right-hand man John Tronolone laid the rumors to rest, publicly announcing his retirement from both active competition and behind-the-scenes collaboration. Those who heard the news stood in awe, perhaps questioning the possible reasons for such an action. According to Tronolone, it was a \"long, long time coming\" and a decision he had been battling for the last several months.\nThe length of Tronolone's - and \"The Writer's\" - hiatus is currently unknown, although both have vowed that it is only \"temporary\".\n________________________________________\n________________________\nECD's\nelitest couldn't have been more rarin' to go for this year-end spectacle. What a way to go out then with this ...\n\"Eamon\"\nfor your mortal sworn enemies was the absolute key to oppositional extermination. And the Fitzpatricks' youngest comodity tore through veterans\nKevin Adams\nand\nJohn Tronolone\nwithout much difficulty.\nSeason 17\nThe initial tennis light troubles, WALL-ALL battles NINE and TEN, Thanksgiving's massive\nMegill v. C. Adams II\n, and Tronolone retaining his captaincy against a\nCREAMated\nLetsche were some key highlights over this ten week program.\nAverage attendance was 19.6 with 40% of the events reaching exactly 18. Throughout the ten weeks,\nECD\nwelcomed 5 new stars.\nJustin Wolf, Jon Yochum, Michael \"Sputz\" Krott, John Tronolone, and Kevin Fitzpatrick participated in every Season 17 event spanning from DODGEBALL 161 on October 25 to the December 27 Finale, DODGEBALL C70.\nDODGEBALL C70\nPurple and white table clothes were draped along in the inside fence while white streamers were carefully rolled around each of the four tennis poles.\nThe music playlist was created by the first lady of dodgeball Diana DiBuccio. \"Superstar\" by Lupe Fiasco kicked off the multi-hour compilation with hits particularly from HipHop/R&B genre.\nFirst pick for \"David\" Mullins:\nJohn Tronolone\nFirst pick for \"Goliath\" Krott:\nKevin Fitzpatrick\nOnline Exclusive!\nThe special\nGodMode Rules\nstipulation was agreed upon and then added less than a week before C70 itself.\nDODGEBALL C70 was featured\n26 total participants\n, which is the highest attendance since the Season 16 Finale in mid-October.\nThe official theme song was \"Superstar\" by Lupe Fiasco feat. Matthew Santos.\nDODGEBALL C70 was the fourth consecutive ten event held on the back courts of Wall High School, and the tenth overall. It was also the third finale to take place in the month of December following an unforgettable\nDODGEBALL 20:\nThe ClimaXX\nin 2005 and the revolutionary Chris Adams-Kevin Fitzpatrick clash at\nDODGEBALL 70\nin 2006.\nThe \"Biblical Battle\" between Michelle Mullins and Michael \"Sputz\" Krott was not only the first intergender singles match-up in season finale history, but also the first to include a match stipulation. Every preceeding ten event was contested under classic two-team rules.\nMichelle Mullins\nheadlined her first season finale. Her record is 0-2-1.\nMichael Krott\nheadlined his second season finale, the first DODGEBALL CX. This was his second\nGodMode Rules\ncontest and shockingly, his very first singles conest. His record is 1-1-0.</center>",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big>It was promised that at 2009's kick-off event, DODGEBALL 171, a certain announcement would send shockwaves across the <i>EastCoastDodgeball</i> community. <br/><br/>\"The Writer's\" right-hand man John Tronolone laid the rumors to rest, publicly announcing his retirement from both active competition and behind-the-scenes collaboration. Those who heard the news stood in awe, perhaps questioning the possible reasons for such an action. According to Tronolone, it was a \"long, long time coming\" and a decision he had been battling for the last several months.<br/><br/>The length of Tronolone's - and \"The Writer's\" - hiatus is currently unknown, although both have vowed that it is only \"temporary\".</big><br/><br/><center>________________________________________<wbr/>________________________</center><br/><i>ECD's</i> elitest couldn't have been more rarin' to go for this year-end spectacle. What a way to go out then with this ...<br/><br/><b>\"Eamon\"</b> for your mortal sworn enemies was the absolute key to oppositional extermination. And the Fitzpatricks' youngest comodity tore through veterans <b>Kevin Adams</b> and <b>John Tronolone</b> without much difficulty.<br/><br/><big><u>Season 17</u></big><br/><li>The initial tennis light troubles, WALL-ALL battles NINE and TEN, Thanksgiving's massive <i>Megill v. C. Adams II</i>, and Tronolone retaining his captaincy against a <i>CREAMated</i> Letsche were some key highlights over this ten week program.<br/><li>Average attendance was 19.6 with 40% of the events reaching exactly 18. Throughout the ten weeks, <i>ECD</i> welcomed 5 new stars.<br/><li>Justin Wolf, Jon Yochum, Michael \"Sputz\" Krott, John Tronolone, and Kevin Fitzpatrick participated in every Season 17 event spanning from DODGEBALL 161 on October 25 to the December 27 Finale, DODGEBALL C70.<br/><br/><big><u>DODGEBALL C70</u></big><br/><li>Purple and white table clothes were draped along in the inside fence while white streamers were carefully rolled around each of the four tennis poles.<br/><li>The music playlist was created by the first lady of dodgeball Diana DiBuccio. \"Superstar\" by Lupe Fiasco kicked off the multi-hour compilation with hits particularly from HipHop/R&amp;B genre.<br/><li>First pick for \"David\" Mullins: <i>John Tronolone</i><br/><li>First pick for \"Goliath\" Krott: <i>Kevin Fitzpatrick</i><br/><br/><big><i>Online Exclusive!</i></big><br/>The special <i>GodMode Rules</i> stipulation was agreed upon and then added less than a week before C70 itself.<br/><br/><br/>DODGEBALL C70 was featured <u>26 total participants</u>, which is the highest attendance since the Season 16 Finale in mid-October.<br/><br/>The official theme song was \"Superstar\" by Lupe Fiasco feat. Matthew Santos.<br/><br/>DODGEBALL C70 was the fourth consecutive ten event held on the back courts of Wall High School, and the tenth overall. It was also the third finale to take place in the month of December following an unforgettable <a href=\"http://dodgeball.livejournal.com/2006/01/01/\" target=\"_blank\">DODGEBALL 20: <i>The ClimaXX</i></a> in 2005 and the revolutionary Chris Adams-Kevin Fitzpatrick clash at <a href=\"http://dodgeball.livejournal.com/2007/01/02/\" target=\"_blank\">DODGEBALL 70</a> in 2006.<br/><br/>The \"Biblical Battle\" between Michelle Mullins and Michael \"Sputz\" Krott was not only the first intergender singles match-up in season finale history, but also the first to include a match stipulation. Every preceeding ten event was contested under classic two-team rules.<br/><li><b>Michelle Mullins</b> headlined her first season finale. Her record is 0-2-1.<br/><li><b>Michael Krott</b> headlined his second season finale, the first DODGEBALL CX. This was his second <i>GodMode Rules</i> contest and shockingly, his very first singles conest. His record is 1-1-0.&lt;/center&gt; </li></li></li></li></li></li></li></li></li></div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}