{
  "id": 101949,
  "url": "https://dodgeball.livejournal.com/101949.html",
  "title": "The Game I'll ALWAYS Love .. Four YEARS Later",
  "date": "",
  "body_text": "It started out as just a vision, a mere dream that I looked to turn real. I vividly remember sitting at the popular FINS restaurant in Bradley as a matter of fact with the Winston gals making a list of those whom I thought would help get the boat afloat. And with the man and woman power - as well as a playable location and one sunny summer day - some odd months later, the ball began to roll.\nSeptember 3, 2005\n. Labor Day [Weekend] had new meaning by the time this multi-hour ball-bash ceased. I was fueled with adrenaline and little did I .. did any of us know or expect the staggering heights the soon-to-be named\nEastCoastDodgeball\nwould've reached.\nIf you've kept up with your dodgeball history through the years, then you should know \"the rest is history.\" It's hard to believe that four years later, I sit behind this computer attempting to post an entry on the website I practically lived within. Hopefully, I've retained most of my writing skills (ha!).\nSo what's my purpose for the ramble this time? As the dedicated events organizer and promoter\nand\na diehard competitor for 171 consecutive weeks, how could I not devote this time to\nreflect\non a feat collectively reached.\n.......................\nI absolutely cherished my time as the so-called \"leader\" or \"king\" of the dodgeball community and wanted everyone to feel just as important to the game and group. No matter the age, weight, gender, race, or even number of appearances, everyone had a place on the hallowed battlegrounds. With that said, I detail some of the most important aspects that kept the \"boat afloat\" during my lengthy reign.\nIt's All In The Game!\nOf course dodgeball came with winners and losers. Sure situations boiled over and gums flapped. Rationally speaking though, I feel most of you understood that that's just the nature of the sport. What's a game without some rivalry, right! I made sure this was a priority and I think it's safe to assume most of you agree, otherwise you would've never come back for more.\nDon't Hit Me, I'm In The Arts!\nPromotion, promotion, promotion. There's no denying this was crucial to the life of\nECD\n. If it meant staying up 'til the wee-hours of the morning to perfect a poster or edit an entry, then so be it. Word of mouth was an integral part of advertising, but I wanted players, especially the newbies, to\nbelieve\nin what they were seeing. I wanted my pictures, ideas, and visions to speak more than a 1,000 words.\nMore Than One Paint Brush!\nAs the decision-making, match-signing \"Writer\", I needed to keep things as fresh and innovative as possible, even if it meant sacrificing my own well-being and reputation. One of my proudest achievements - and a match I actually lost - was the first-ever\nCREAMation Rules\ncontest pitting myself and Lenny Herrera against his \"BFF\" Kevin Adams and mine, Valerie Winston.\nNot only did I want to send everyone home happy before my departure to\nWrestleMania 23\nthe following weekend, but also prove that I wasn't afraid to try new things and test out new concepts. I personally feel the\nCREAMation\nbouts created more memories - and riled up nerves - than most standard encounters. The sky was the limit for such trials and errors ..\nBoxBall Dodgeball\n, the\nDodgeball Draft\n,\nWALL vs. ALL\n,\nGodMode Rules\n,\nRiskBall\n, just to name a few. \"PondScum Invasion\" anyone? Talk about a victory.\nBreaking Out The New Guns!\nI don't think anything was more thrilling behind-the-scenes [for myself personally] than taking a hungry, new lion and shoving them them into their most crucial battle. It was all about earning those stripes and receiving the recognition that you had \"made it.\" The season finales, and in some instances the mid-season showdowns, carved new names on the superstar rock and nothing could ever erase such accomplishment. The Londono-Wolf and Letsche-Cornero wars of 2008 are prime examples, as is the Teitelbaum-Yochum confrontation from the special\nFamily Reunion\nin May '09. These six individuals, among countless others, had climbed the ladder of success and were ready to showcase their absolute best in front of 30, 40, and sometimes even 50 of their longtime comrads.\nI was able to use the veteran lions of yesteryear - Chris Adams, Justin Pierce, Kevin Megill - put them against up-and-coming prospects, and in the process further both on-court feuds and individual progress. How about \"Crazy One\" Mike Edwards for instance!? The man delivered Megill his first captains loss and remained extensively undefeated until he met headliner Kevin Adams .. another warrior who was able to step out of the shadows of his brothers and become easily one of the greatest, if not the, the game had ever seen.\nAs the man behind the madness, I wanted each of the players, especially the deserving leading generals, to feel special, like their place in\nECD\nwas irreplaceable. I certainly believed the hype and I can only hope you did too!\nNot Too Little, Not Too Much!\nThe games, the stars, the feuds, the stipulations .. There was always a time and place and I knew never to damage the reputation and credibility of each. Players are fans too and I wanted them to enjoy each aspect of their role. I made sure new stars were awarded the chance in the limelight they desperately deserved and yearned. Stipulations were saved for big-time matches and/or special events and rarely used more than once per ten-week season. Though usually sparked accidentally, long-standing feud bouts were promoted in advance and booked at a proper event (i.e. mid-season).\nI strongly feel that without such balance, events wouldn't have been as unique or meaningful to those that participated. \"Too little is never enough - too much of anything is never a good thing\" .. I like how that sounds.\n.......................\nThose that have taken the time to read thus far, I thank you very much. I admit, it feels pretty good, and rather familiar to sit and talk about the game - the journey - that changed my life forever. I've come away with more mental pictures and friends than I could've imagined. Yeah, times got rough for me towards\nmy\neventual retirement but it doesn't mean I'll lose or forget any of the memories or people I've gained throughout the past four glorious years.\nAs a bonus for reading - and because I want to (ha!) - I'd like to provide you with my own personal superlatives.\nFavorite Event\n: I'd have to go with DODGEBALL 100. \"Personal victory\" is a far understatement from what this night meant to me. I arrived nervous as hell, in fear expectations would fall flat. But I came out on top of the freakin' world. I remember [almost] wishing to have died on the court that night because I felt like I was in a heaven that could never be replicated. It was really that special to me. (Honorable Mentions: Too many to name!)\nFavorite Time Period\n: By the slimmest of margin, the\nDark Days\nof the 2006-2007 Fall/Winter earns the top spot. When the tennis lights unknowingly failed in early November 2006, I was confident that we could still keep things rolling. We were surviving on an event attendance average of about 15 with basically the same crew week after week; DiBuccio, Adams, Fitzpatrick, Stopa, and Megill. Though the lights continued to malfunction, a new \"light\" shined bright.\nThe second wave of future dodgeball sensations had arrived and there was no turning back.\nECD\nwould soon be introduced to Grant Cornero, Sascha Basista, Joey Smalls, Juan Londono, Pam D'Luhy, Michael Butler, Bobby Vetrano and that's only about half the list! These\nDark Days\nwere just the opposite and set the tone for the 2007 year and beyond. (Honorable Mentions: original ORP run in 2005; May-June 2006 for reaching huge turnouts; post-DODGEBALL 100 / Fall 2007; early-2008 while on crutches)\nMost Heated Rival\n: I can't pick one, but I can pick three. Chris Adams is one, no doubt. We were the big dogs back in the beginning. Kevin Fitzpatrick and I also locked horns several times and would usually purposely aim for one another. Though he may have not felt any personal vendetta against me, I always gunned for Megill as well. The guy's got a rifle left hand.\nMost Trusted Ally\n: My partner-in-crime from the very start was Diana. She helped review entries, offered opinions on concepts, ideas, and posters .. my go-to gal. She was there from the very beginning and always lent a helping hand.\nWho's The Best?\n: Ah, the question most are probably pondering. I believe to pick\none\nbest would be a slap in the face of those other \"best.\" I do feel however some individuals dominated the scene for lengthy periods of time. I'll toot my own horn in saying I believe I was #1 for a long time and if it wasn't me, Chris definitely deserved that spot. By mid-2006, Megill was the man to beat catching and hitting everyone in his path for a good couple months. There was a pool of stand-out talents throughout the transition from 2006 to 2007, but come summer 2007, there was no one more physically imposing than Kevin Adams. The 2008 calender belonged to a handful of top-level talent, perhaps none more feared than Fitz.\nIt is always tough to choose a single star throughout three-plus years, but some just rose above the rest during different eras. I think we all knew who we wanted on our teams anyway. Among the aforementioned names, you've got T. Adams, Pierce, Letsche, Sputz, Edwards, Cornero, and Kerr that always comprised the toughest teams to beat. Fun times I tell you, fun times.\n.......................\nI can't help but smile glancing back at the entry I've just competed. I am so very proud of what I was able to create and with all of your assistance, help preserve. It was one hell of a ride for me and though my \"play days\" might be over, my mind still reflects with optimism. I'm honored, privileged, lucky, and blessed to have met all of you. Thanks for the memories and never let the good times fade away.\n- J. Tronolone",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> It started out as just a vision, a mere dream that I looked to turn real. I vividly remember sitting at the popular FINS restaurant in Bradley as a matter of fact with the Winston gals making a list of those whom I thought would help get the boat afloat. And with the man and woman power - as well as a playable location and one sunny summer day - some odd months later, the ball began to roll. <br/><br/><a href=\"http://wwecoowner.livejournal.com/2005/09/04/\" target=\"_blank\">September 3, 2005</a>. Labor Day [Weekend] had new meaning by the time this multi-hour ball-bash ceased. I was fueled with adrenaline and little did I .. did any of us know or expect the staggering heights the soon-to-be named <b>EastCoastDodgeball</b> would've reached.<br/><br/>If you've kept up with your dodgeball history through the years, then you should know \"the rest is history.\" It's hard to believe that four years later, I sit behind this computer attempting to post an entry on the website I practically lived within. Hopefully, I've retained most of my writing skills (ha!). <br/><br/>So what's my purpose for the ramble this time? As the dedicated events organizer and promoter <i>and</i> a diehard competitor for 171 consecutive weeks, how could I not devote this time to <u>reflect</u> on a feat collectively reached.<br/><br/>.......................<br/><br/>I absolutely cherished my time as the so-called \"leader\" or \"king\" of the dodgeball community and wanted everyone to feel just as important to the game and group. No matter the age, weight, gender, race, or even number of appearances, everyone had a place on the hallowed battlegrounds. With that said, I detail some of the most important aspects that kept the \"boat afloat\" during my lengthy reign.<br/><br/><b>It's All In The Game!</b><br/>Of course dodgeball came with winners and losers. Sure situations boiled over and gums flapped. Rationally speaking though, I feel most of you understood that that's just the nature of the sport. What's a game without some rivalry, right! I made sure this was a priority and I think it's safe to assume most of you agree, otherwise you would've never come back for more.<br/><br/><b>Don't Hit Me, I'm In The Arts!</b><br/>Promotion, promotion, promotion. There's no denying this was crucial to the life of <i>ECD</i>. If it meant staying up 'til the wee-hours of the morning to perfect a poster or edit an entry, then so be it. Word of mouth was an integral part of advertising, but I wanted players, especially the newbies, to <i>believe</i> in what they were seeing. I wanted my pictures, ideas, and visions to speak more than a 1,000 words.<br/><br/><b>More Than One Paint Brush!</b><br/>As the decision-making, match-signing \"Writer\", I needed to keep things as fresh and innovative as possible, even if it meant sacrificing my own well-being and reputation. One of my proudest achievements - and a match I actually lost - was the first-ever <i>CREAMation Rules</i> contest pitting myself and Lenny Herrera against his \"BFF\" Kevin Adams and mine, Valerie Winston.<br/><br/>Not only did I want to send everyone home happy before my departure to <i>WrestleMania 23</i> the following weekend, but also prove that I wasn't afraid to try new things and test out new concepts. I personally feel the <i>CREAMation</i> bouts created more memories - and riled up nerves - than most standard encounters. The sky was the limit for such trials and errors .. <i>BoxBall Dodgeball</i>, the <i>Dodgeball Draft</i>, <i>WALL vs. ALL</i>, <i>GodMode Rules</i>, <i>RiskBall</i>, just to name a few. \"PondScum Invasion\" anyone? Talk about a victory.<br/><br/><b>Breaking Out The New Guns!</b><br/>I don't think anything was more thrilling behind-the-scenes [for myself personally] than taking a hungry, new lion and shoving them them into their most crucial battle. It was all about earning those stripes and receiving the recognition that you had \"made it.\" The season finales, and in some instances the mid-season showdowns, carved new names on the superstar rock and nothing could ever erase such accomplishment. The Londono-Wolf and Letsche-Cornero wars of 2008 are prime examples, as is the Teitelbaum-Yochum confrontation from the special <i>Family Reunion</i> in May '09. These six individuals, among countless others, had climbed the ladder of success and were ready to showcase their absolute best in front of 30, 40, and sometimes even 50 of their longtime comrads. <br/><br/>I was able to use the veteran lions of yesteryear - Chris Adams, Justin Pierce, Kevin Megill - put them against up-and-coming prospects, and in the process further both on-court feuds and individual progress. How about \"Crazy One\" Mike Edwards for instance!? The man delivered Megill his first captains loss and remained extensively undefeated until he met headliner Kevin Adams .. another warrior who was able to step out of the shadows of his brothers and become easily one of the greatest, if not the, the game had ever seen.<br/><br/>As the man behind the madness, I wanted each of the players, especially the deserving leading generals, to feel special, like their place in <i>ECD</i> was irreplaceable. I certainly believed the hype and I can only hope you did too!<br/><br/><b>Not Too Little, Not Too Much!</b><br/>The games, the stars, the feuds, the stipulations .. There was always a time and place and I knew never to damage the reputation and credibility of each. Players are fans too and I wanted them to enjoy each aspect of their role. I made sure new stars were awarded the chance in the limelight they desperately deserved and yearned. Stipulations were saved for big-time matches and/or special events and rarely used more than once per ten-week season. Though usually sparked accidentally, long-standing feud bouts were promoted in advance and booked at a proper event (i.e. mid-season).<br/><br/>I strongly feel that without such balance, events wouldn't have been as unique or meaningful to those that participated. \"Too little is never enough - too much of anything is never a good thing\" .. I like how that sounds.<br/><br/><br/>.......................<br/><br/><br/>Those that have taken the time to read thus far, I thank you very much. I admit, it feels pretty good, and rather familiar to sit and talk about the game - the journey - that changed my life forever. I've come away with more mental pictures and friends than I could've imagined. Yeah, times got rough for me towards <i>my</i> eventual retirement but it doesn't mean I'll lose or forget any of the memories or people I've gained throughout the past four glorious years.<br/><br/>As a bonus for reading - and because I want to (ha!) - I'd like to provide you with my own personal superlatives. <br/><br/><b>Favorite Event</b>: I'd have to go with DODGEBALL 100. \"Personal victory\" is a far understatement from what this night meant to me. I arrived nervous as hell, in fear expectations would fall flat. But I came out on top of the freakin' world. I remember [almost] wishing to have died on the court that night because I felt like I was in a heaven that could never be replicated. It was really that special to me. (Honorable Mentions: Too many to name!)<br/><br/><b>Favorite Time Period</b>: By the slimmest of margin, the <i>Dark Days</i> of the 2006-2007 Fall/Winter earns the top spot. When the tennis lights unknowingly failed in early November 2006, I was confident that we could still keep things rolling. We were surviving on an event attendance average of about 15 with basically the same crew week after week; DiBuccio, Adams, Fitzpatrick, Stopa, and Megill. Though the lights continued to malfunction, a new \"light\" shined bright.<br/><br/>The second wave of future dodgeball sensations had arrived and there was no turning back. <i>ECD</i> would soon be introduced to Grant Cornero, Sascha Basista, Joey Smalls, Juan Londono, Pam D'Luhy, Michael Butler, Bobby Vetrano and that's only about half the list! These <i>Dark Days</i> were just the opposite and set the tone for the 2007 year and beyond. (Honorable Mentions: original ORP run in 2005; May-June 2006 for reaching huge turnouts; post-DODGEBALL 100 / Fall 2007; early-2008 while on crutches)<br/><br/><b>Most Heated Rival</b>: I can't pick one, but I can pick three. Chris Adams is one, no doubt. We were the big dogs back in the beginning. Kevin Fitzpatrick and I also locked horns several times and would usually purposely aim for one another. Though he may have not felt any personal vendetta against me, I always gunned for Megill as well. The guy's got a rifle left hand.<br/><br/><b>Most Trusted Ally</b>: My partner-in-crime from the very start was Diana. She helped review entries, offered opinions on concepts, ideas, and posters .. my go-to gal. She was there from the very beginning and always lent a helping hand.<br/><br/><b>Who's The Best?</b>: Ah, the question most are probably pondering. I believe to pick <i>one</i> best would be a slap in the face of those other \"best.\" I do feel however some individuals dominated the scene for lengthy periods of time. I'll toot my own horn in saying I believe I was #1 for a long time and if it wasn't me, Chris definitely deserved that spot. By mid-2006, Megill was the man to beat catching and hitting everyone in his path for a good couple months. There was a pool of stand-out talents throughout the transition from 2006 to 2007, but come summer 2007, there was no one more physically imposing than Kevin Adams. The 2008 calender belonged to a handful of top-level talent, perhaps none more feared than Fitz.<br/><br/>It is always tough to choose a single star throughout three-plus years, but some just rose above the rest during different eras. I think we all knew who we wanted on our teams anyway. Among the aforementioned names, you've got T. Adams, Pierce, Letsche, Sputz, Edwards, Cornero, and Kerr that always comprised the toughest teams to beat. Fun times I tell you, fun times.<br/><br/><br/>.......................<br/><br/><br/>I can't help but smile glancing back at the entry I've just competed. I am so very proud of what I was able to create and with all of your assistance, help preserve. It was one hell of a ride for me and though my \"play days\" might be over, my mind still reflects with optimism. I'm honored, privileged, lucky, and blessed to have met all of you. Thanks for the memories and never let the good times fade away.<br/><br/>- J. Tronolone </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}