{
  "id": 102623,
  "url": "https://dodgeball.livejournal.com/102623.html",
  "title": "HELLO AGAIN!",
  "date": "",
  "body_text": "I've heard your never-ending requests and felt your undying enthusiasm - here's your one and only chance to prove your passion!\nAfter a lengthy absence, the famed \"local phenomenon\"\nEastCoastDodgeball\ninvites intense dodgeballers and their beloved relatives and friends to the premier sports\nand\nfamily event of the summer,\nFamily Affair III\n.\nThe History\nIt was the Spring of 2008 and I - \"The Writer\" - was in search for something fresh and exciting.\nECD\nhad witnessed plenty of firsts in its then two and a half year existence, but I was thirsty for more. I nestled the mouse to the keyboard and within a few hours, completed what would eventually become personalized paper invitations.\nThe next 30 days were a remarkably memorable time for the entire\nECD\ncommunity, with die-hard players and their loved ones eager and psyched for what awaited. On Saturday, May 31, the long, arduous journey to the inaugural\nFamily Affair\nhad finally culminated.\nThe spectacular athleticism of legends Megill, Wolf, Londono, and Edwards, the on-court antics of Mr. William Spengeman, the presence and enthusiasm of the adorable Tronolone sisters,\nFamily Affair I\nwas nothing short of amazing. Those who witnessed, whether as an active player or cheering fan, left for home with an irreplaceable smile.\nThe success of such an extraordinary event led to the sophomore family extravaganza,\nFamily Reunion\n, in May 2009. Like its predecessor, it too greatly surpassed expectations.\nPresent Day\nNow, in 2010, it is happening – again.\nIt's the unprecedented 3rd Annual extravaganza and\nEastCoastDodgeball\nwants you to be a part of it! Rejoin legends of the game as they showcase their athletic talents in front of an energetic audience comprised of beloved parents, siblings, and close family friends.\nPlease make every effort you can to attend this highly-anticipated, multi-hour spectacular only at the\nWall High School tennis courts\nbeginning at\n6:30pm\n. The entire event is cost-free; just bring a chair, a smile, and if you feel the uncontrollable urge, your \"A\" game. I truly hope to see you there!\n-- \"The Writer\" --",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big>I've heard your never-ending requests and felt your undying enthusiasm - here's your one and only chance to prove your passion!<br/><br/>After a lengthy absence, the famed \"local phenomenon\" <i>EastCoastDodgeball</i> invites intense dodgeballers and their beloved relatives and friends to the premier sports <u>and</u> family event of the summer, <i>Family Affair III</i>. <br/><br/><u><b>The History</b></u><br/>It was the Spring of 2008 and I - \"The Writer\" - was in search for something fresh and exciting. <i>ECD</i> had witnessed plenty of firsts in its then two and a half year existence, but I was thirsty for more. I nestled the mouse to the keyboard and within a few hours, completed what would eventually become personalized paper invitations. <br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/ECDFA10InvitationSideA.jpg\" vspace=\"3\">The next 30 days were a remarkably memorable time for the entire <i>ECD</i> community, with die-hard players and their loved ones eager and psyched for what awaited. On Saturday, May 31, the long, arduous journey to the inaugural <i>Family Affair</i> had finally culminated.<br/><br/>The spectacular athleticism of legends Megill, Wolf, Londono, and Edwards, the on-court antics of Mr. William Spengeman, the presence and enthusiasm of the adorable Tronolone sisters, <a href=\"http://dodgeball.livejournal.com/2008/06/01/\" target=\"_blank\"><i>Family Affair I</i></a> was nothing short of amazing. Those who witnessed, whether as an active player or cheering fan, left for home with an irreplaceable smile.<br/><br/>The success of such an extraordinary event led to the sophomore family extravaganza, <i>Family Reunion</i>, in May 2009. Like its predecessor, it too greatly surpassed expectations.<br/><br/><b><u>Present Day</u></b><br/>Now, in 2010, it is happening – again.<br/><br/>It's the unprecedented 3rd Annual extravaganza and <i>EastCoastDodgeball</i> wants you to be a part of it! Rejoin legends of the game as they showcase their athletic talents in front of an energetic audience comprised of beloved parents, siblings, and close family friends. <br/><br/>Please make every effort you can to attend this highly-anticipated, multi-hour spectacular only at the <b>Wall High School tennis courts</b> beginning at <b>6:30pm</b>. The entire event is cost-free; just bring a chair, a smile, and if you feel the uncontrollable urge, your \"A\" game. I truly hope to see you there!<br/><br/><center>-- \"The Writer\" --</center></img></big> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/ECDFA10InvitationSideA.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}