{
  "id": 103103,
  "url": "https://dodgeball.livejournal.com/103103.html",
  "title": "Family, Friends, and FOES",
  "date": "",
  "body_text": "The MONEY!\nBring out the dough if you're feeling lucky for a 50/50 raffle! Two winners will be decided throughout the evening.\nThe MUSIC by\nECD's\n-own C. Adams!\nFamily Affair III\nevent planner and legendary figure of the game, Christopher\nAdams, has put his musical magic to work in compiling a special soundtrack for the event!\nThe MAIN EVENT: Sascha Basista vs. Joey Smalls!\nTwo close friends, two better enemies. It's the titanic-sized clash and you can trust that there's a unique, compelling story ...\nThe journey to\nFamily Affair III\nbegins all the way back to a chilly,\nNovember 18, '06\nnight when a then-teenaged Basista entered the worshiped Wall High School battlegrounds. And a memorable debut indeed; some wicked dodges and the recipient of  \"Fritz\"-thrown bulletball put the youngster on the map. Just\none short week later\n, Basista's buddy-turned-adversary, the equally-hungry Smalls, made his own splash.\nParts I and II\nBasista-Smalls I\n- Joey's inaugural event - was a war with casualties. The soon-to-be nicknamed \"Eddie Gordo\" was vanquished by his dance-dodging counterpart which sent Smalls packing for a lengthy hiatus. But\nEastCoastDodgeball's\n\"writer\" wisely scheduled a rematch in\nJanuary 2007\nwith \"Gordo\" extracting a measure of revenge in a physically-taxing brawl.\nWith this intense series tied at one apiece, the fate of their feud was mysteriously put on hold.\nReunited?\nThe duo briefly rekindled their bond when Basista called upon his \"friend\" in the fight against Gerald Lewis and the \"BreakDancer's\" arch rival at the time, Ray Marzarella,\nlater that year\n. But the Basista-Smalls combination was a short-lived, one-hit wonder. The PondScum tandem easily disposed of their enemies and to this day, one could say the bad blood between the\nFamily Affair III\nheadliners still greatly exists.\nThe demise of\nECD's\nweekly battles unfortunately prevented\nBasista-Smalls III\nfrom ever occurring .. until now.\nThe Final Encounter\nPerhaps the two most energetic, charismatic, and certainly talented dodgeball warriors face-off in their feverishly-awaited third and final encounter.\nSascha \"BreakDancin'\" Basista\nepically collides with\nJoey \"Gordo\" Smalls\nat the 3rd Annual\nFamily Affair\nspectacular.\nAn event of this magnitude happens\nonly once\nso best be sure you attend!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=FamilyAffair2010F.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010F.jpg\"/></a></center><br/><big><br/><b><big>The MONEY!</big></b></big><br/>Bring out the dough if you're feeling lucky for a 50/50 raffle! Two winners will be decided throughout the evening.<br/><br/><big><b>The MUSIC by <i>ECD's</i>-own C. Adams!</b></big><br/><i>Family Affair III</i> event planner and legendary figure of the game, Christopher <img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010E.jpg\" vspace=\"3\">Adams, has put his musical magic to work in compiling a special soundtrack for the event!<br/><br/><b><big>The MAIN EVENT: Sascha Basista vs. Joey Smalls!</big></b><br/>Two close friends, two better enemies. It's the titanic-sized clash and you can trust that there's a unique, compelling story ...<br/><br/>The journey to <i>Family Affair III</i> begins all the way back to a chilly, <a href=\"http://dodgeball.livejournal.com/2006/11/20/\" target=\"_blank\">November 18, '06</a> night when a then-teenaged Basista entered the worshiped Wall High School battlegrounds. And a memorable debut indeed; some wicked dodges and the recipient of  \"Fritz\"-thrown bulletball put the youngster on the map. Just <a href=\"http://dodgeball.livejournal.com/2006/11/28/\" target=\"_blank\">one short week later</a>, Basista's buddy-turned-adversary, the equally-hungry Smalls, made his own splash.<br/><br/><u>Parts I and II</u><br/><i>Basista-Smalls I</i> - Joey's inaugural event - was a war with casualties. The soon-to-be nicknamed \"Eddie Gordo\" was vanquished by his dance-dodging counterpart which sent Smalls packing for a lengthy hiatus. But <i>EastCoastDodgeball's</i> \"writer\" wisely scheduled a rematch in <a href=\"http://dodgeball.livejournal.com/2007/01/29/\" target=\"_blank\">January 2007</a> with \"Gordo\" extracting a measure of revenge in a physically-taxing brawl. <br/><br/>With this intense series tied at one apiece, the fate of their feud was mysteriously put on hold.<br/><br/><u>Reunited?</u><br/>The duo briefly rekindled their bond when Basista called upon his \"friend\" in the fight against Gerald Lewis and the \"BreakDancer's\" arch rival at the time, Ray Marzarella, <a href=\"http://dodgeball.livejournal.com/2007/09/12/\" target=\"_blank\">later that year</a>. But the Basista-Smalls combination was a short-lived, one-hit wonder. The PondScum tandem easily disposed of their enemies and to this day, one could say the bad blood between the <i>Family Affair III</i> headliners still greatly exists. <br/><br/>The demise of <i>ECD's</i> weekly battles unfortunately prevented <i>Basista-Smalls III</i> from ever occurring .. until now.<br/><br/><u>The Final Encounter</u><br/>Perhaps the two most energetic, charismatic, and certainly talented dodgeball warriors face-off in their feverishly-awaited third and final encounter.<br/><br/><b>Sascha \"BreakDancin'\" Basista</b> epically collides with <b>Joey \"Gordo\" Smalls</b> at the 3rd Annual <i>Family Affair</i> spectacular. <br/><br/><big><big><center>An event of this magnitude happens<br/><u>only once</u> so best be sure you attend!</center></big></big> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010F.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010E.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}