{
  "id": 103294,
  "url": "https://dodgeball.livejournal.com/103294.html",
  "title": "The WORLD CUP",
  "date": "",
  "body_text": "WELCOME .. BACK .. TO\nEASTCOASTDODGEBALL\n!\nNever-ending requests and undying passion for the beloved game and its irreplaceable participants helped reform the storm that soaked an entire community in a four-year span. While the weekly journey may have culminated, the action, excitement, and thrills of the \"local phenomenon\" will never die. \"The Writer\" figuratively shakes your hand in welcoming you back to\nECD\n!\n\"GERMANY vs. BRAZIL\": Basista, Smalls in Epic Finale!\nOnly a contest of this magnitude could have firmly supported the rebirth of\nECD\n. The\nBasista-Smalls III\nclash, despite the agonizing years in exile, finally came to the forefront. It was almost as if time had stood still!\nFor three continuous hours, weapons were launched from every angle in attempt to completely knock the opposition out of contention. The leading generals themselves were nothing short of magnificent, each putting on an enviable performance for the crowd to witness. For Basista, the match was well in his grasp by the conclusion of round 3. Though Joey \"Gordo\" briefly rebounded, his \"breakdancin'\" counterpart managed to perpetrate enough anguish to secure victory.\nUnlimited energy. Natural charisma. A few dance steps and a touch of reckless abandon. Safe to say the 3rd Annual\nFamily Affair\nhad all the makings of a true \"world cup\" classic .. without the crummy referees. In their final confrontation upon the Wall High School battle zone, Sascha Basista vanquished long-time rival, Joey Smalls, 4 to 2.\nThe \"Family\" Affair\nWhat would this 3rd Annual spectacular have been without, you guessed it, the cherished relatives!\nECD\nwould like to recognize all the family members who came out in support: Ms. Gail Adams, The Cornero Family, The Fitzpatrick Family, Mrs. Jacob and Paige Jacob, Mrs. Colleen Kerr, The Mills Family, and The Yochum Family. The\nECD\nfamily truly appreciates you being a part of ours!\nRecords and Recognition\nAttendance\n: 33, comprised of 25 men and 8 women.\nNew Dodgeballers*\n: Angelo Melchiorri, Jared Gerbig, Joanice Lima, Jonathan Ranchin, Mari Travassos, Zack Berghoff.\nGame Rules\n: Classic two-team (Games 1-4); Prison Ball (Games 5-6).\nFeatured Match\n: Sascha Basista defeated Joey Smalls, 4-2.\nGame-By-Game Results\n: Basista 1-3, 5; Smalls 4, 6\nCaptains Records*\n: Basista 3-4-1, Smalls 1-4-0.\nPlay of the Night\n: Justin Wolf and Bobby Vetrano courageously went the distance during the three-minute \"Last Man Standing\" clock in games 2 and 4, respectively.\nPlayer of the Night\n: Grant Cornero, whose effective dodges, rocket-fast throws, and dynamite catches, made him essential to the Basista-lead victory.\n*Statistical information is a continuation of\nThe Tronolone Era\n: DODGEBALL DAY 1 to DODGEBALL 171 as well as\nFamily Reunion 2009\n.\nCredits\nStory\n: \"The Writer\"\nSoundtrack\n: Christopher Adams\nTheme Song\n: \"Kings and Queens\" by 30 Seconds To Mars\n________________________________________\n___________________________________",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><big><b>WELCOME .. BACK .. TO <i>EASTCOASTDODGEBALL</i>!</b></big></big></center>Never-ending requests and undying passion for the beloved game and its irreplaceable participants helped reform the storm that soaked an entire community in a four-year span. While the weekly journey may have culminated, the action, excitement, and thrills of the \"local phenomenon\" will never die. \"The Writer\" figuratively shakes your hand in welcoming you back to <i>ECD</i>!<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010G.jpg\" vspace=\"3\"><big><b>\"GERMANY vs. BRAZIL\": Basista, Smalls in Epic Finale!</b></big><br/>Only a contest of this magnitude could have firmly supported the rebirth of <i>ECD</i>. The <i>Basista-Smalls III</i> clash, despite the agonizing years in exile, finally came to the forefront. It was almost as if time had stood still!<br/><br/>For three continuous hours, weapons were launched from every angle in attempt to completely knock the opposition out of contention. The leading generals themselves were nothing short of magnificent, each putting on an enviable performance for the crowd to witness. For Basista, the match was well in his grasp by the conclusion of round 3. Though Joey \"Gordo\" briefly rebounded, his \"breakdancin'\" counterpart managed to perpetrate enough anguish to secure victory.<br/><br/>Unlimited energy. Natural charisma. A few dance steps and a touch of reckless abandon. Safe to say the 3rd Annual <i>Family Affair</i> had all the makings of a true \"world cup\" classic .. without the crummy referees. In their final confrontation upon the Wall High School battle zone, Sascha Basista vanquished long-time rival, Joey Smalls, 4 to 2.<br/><br/><big><u>The \"Family\" Affair</u></big><br/>What would this 3rd Annual spectacular have been without, you guessed it, the cherished relatives! <i>ECD</i> would like to recognize all the family members who came out in support: Ms. Gail Adams, The Cornero Family, The Fitzpatrick Family, Mrs. Jacob and Paige Jacob, Mrs. Colleen Kerr, The Mills Family, and The Yochum Family. The <i>ECD</i> family truly appreciates you being a part of ours!<br/><br/><big><u>Records and Recognition</u></big><br/><b>Attendance</b>: 33, comprised of 25 men and 8 women.<br/><b>New Dodgeballers*</b>: Angelo Melchiorri, Jared Gerbig, Joanice Lima, Jonathan Ranchin, Mari Travassos, Zack Berghoff.<br/><br/><b>Game Rules</b>: Classic two-team (Games 1-4); Prison Ball (Games 5-6).<br/><b>Featured Match</b>: Sascha Basista defeated Joey Smalls, 4-2.<br/><b>Game-By-Game Results</b>: Basista 1-3, 5; Smalls 4, 6<br/><b>Captains Records*</b>: Basista 3-4-1, Smalls 1-4-0.<br/><br/><b>Play of the Night</b>: Justin Wolf and Bobby Vetrano courageously went the distance during the three-minute \"Last Man Standing\" clock in games 2 and 4, respectively.<br/><b>Player of the Night</b>: Grant Cornero, whose effective dodges, rocket-fast throws, and dynamite catches, made him essential to the Basista-lead victory.<br/><br/>*Statistical information is a continuation of <u>The Tronolone Era</u>: DODGEBALL DAY 1 to DODGEBALL 171 as well as <i>Family Reunion 2009</i>.<br/><br/><big><u>Credits</u></big><br/><b>Story</b>: \"The Writer\"<br/><b>Soundtrack</b>: Christopher Adams<br/><b>Theme Song</b>: \"Kings and Queens\" by 30 Seconds To Mars<br/><br/><center>________________________________________<wbr/>___________________________________<br/><br/><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ImmaculateRedemptionB.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ImmaculateRedemptionB.jpg\"/></a></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/FamilyAffair2010G.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ImmaculateRedemptionB.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}