{
  "id": 103856,
  "url": "https://dodgeball.livejournal.com/103856.html",
  "title": "Somewhere, A Clock Is TICKING",
  "date": "",
  "body_text": "For the first - and last - time ever,\nChris Adams\nteams with\nJohn Tronolone\nin an effort to preserve their captaincy against\nKevin Adams\nand\nKevin Megill\non August 14.\nHere's their incredible story a half-decade in the making.\nFall2005.to.Spring2006: The Two-Man Power Trip\nThey were imposing, influential, and powerful. From the moment John Tronolone and Chris Adams set foot onto the famed Ocean Road Park battlegrounds, the\nECD\ncommunity knew who was in charge. \"Chris' debut (at DAY 3) was a wake-up call. My competition and partner-in-crime had arrived,\" Tronolone said.\nWhile the bad blood was noticeable between the two almost immediately, the future legends knew they had a slew of other top talents just wanting a crack. \"Despite our own personal vendetta, I think we stood more in unity; deep down, we felt were the best.\" Greats like Justin Pierce, Dan Spengeman, and Michael Rosinski, along with up-and-coming stars like Tom Adams, John Watters, and Kevin Fitzpatrick each gunned for the Tronolone-Adams pair.\nBy the time 2006 rolled around, only little had changed. \"I was pretty accurate, threw pretty powerfully, and I feared no new competitors for a long time. As long as I could maintain a threatening game, I would be ready to tackle main events from 2005 onward,\" Chris recounted.\nThe dominant alliance relentlessly punished much of their opposition until one man refused to fall at the front lines. His name was Kevin Megill.\nSpring2006.to.Winter2007: The Three-Man Power Trip + One\nAdams and Tronolone's spots as the top dogs were on shaking ground as the deadly southpaw fearlessly entered himself into the mix. After only mere single-digit event appearances, Megill was thrusts into the DODGEBALL 30 main event against \"The Creation,\" shockingly defeating the wily veteran! \"There was something eerie about 30. It took some time before I realized what was happening,\" Tronolone recalled.\nThe weeks that followed furthered \"KMJ's\" progress as an individual star - so much that at DODGEBALL XL in May, his impressive last man standing performance ushered the current three minute countdown. \"I knew I finally 'made it' when I discovered I had the ability to catch some throws. If one can throw decently but also catch, that's really going to be a problem for the opposition,\" Megill explained. The trio continued to terrorize the rest of the dodgeball community - and each other - all while another hungry combatant took a different, yet dangerous road to rid the plaguing shadow.\nAt DODGEBALL 48, 16 year-old Kevin Adams vanquished the fierce Sara DeCuir to be crowned the 6th\nCaptains Champion\n. In his first title defense, the young lad had to overcome one of the \"Big 3\" if he truly yearned the DODGEBALL 50 captains position. On July 22, the runt of the Adams clan conquered the near-impossible sending an obsessive Tronolone packing, retaining his coveted championship in the process. Then in the main attraction of the 50th spectacular, Kevin paired with his brother Steve, prevailing over the \"other brothers\" duo of Tom and, you guessed it, Chris. \"I had to claw my way up to the top and make a name for myself,\" the former champ remarked.\nThe transition from 2006 to 2007 was an absolute wild and twisting roller coaster as the so-called \"Three-Man Power Trip\" - plus one - devastated the scene.\nWinter2007.to.Summer2007: The Summer Of Slam\nKevin Adams' impressive captaincy and ever-growing physical stature elevated him to heights he had not yet reached. He focused his attention on one cocky individual and within just 90 days of '07, competed in and won the first-ever\nCREAMation Rules\ncontest in March, a match Tronolone suffered the ill-effects of.\nTronolone sought revenge at the biggest spectacle of them all, DODGEBALL 100, in August. In the colossal 3-on-3 collision, Kevin Adams, joined by Justin \"Piercer\" and \"Crazy One\" Edwards, faced and finished the threesome of Kevin Fitzpatrick, Ryan Letsche, and Tronolone himself. \"There's certainly pride to be found in a hard-fought victory, and ten events mean that to me: the ability to prove myself,\" described K. Adams. This would be the last time the once-crowned \"King of Dodgeball\" faced the youngest Adams in any type of captains contest.\nLike his Kevin-named counterpart, \"KMJ\" was just as much stamping his name in the record books as well. He turned back \"The Creation\" in the inaugural\nBoxBall Dodgeball\nan astonishing 17 games to 0, a record obliteration that still stands today. Coupled with Kevin Adams' onslaughts throughout the first-half of 2007, some\nECD\nhistorians believe this string of events and just the overall dominant physical skills led to \"Double K\" finally yanking the crown off the head of one Tronolone.\nAs for the other multi-time headliner, much of this enthralling period was spent embroiled in a heated, back-and-forth feud with incomparable powerhouse \"Fitz.\" But by late-autumn, Chris rejoined the fray.\nSummer2007.to.Winter2008: Runnin' Down a Dream\nThe journey to the never-before-seen \"dream match\" was becoming more prevalent when at the turn of the new year, the long-awaited \"Chris Adams vs. Kevin Megill\" match-up was shockingly announced for March's DODGEBALL C30. In the front-court,\nPrisonBall\n-filled, Season 13 Finale, the rocket southpaw dulled \"The Axe\" in a physically-taxing brawl. \"The stakes appeared higher and I knew the mentality of most players would be heightened. I, too, had to rise to the occasion,\" Megill recalled. Chris went back to the shop, sharpened his tools, and was burdened in wait an agonizing 8 months for a shot at payback.\nMeanwhile, Tronolone bravely led\nTeam ALL\nto victory two out of the three brutal Wall-All contests during the era, enough to extract ounces of vengeance for the year of embarrassment perpetrated by the then-teenaged Kevin. Additionally, the bloody, sophomore\nBoxBall Dodgeball\ncontinued his newly-regained reign of suffering. But just when things took a turn for the better, Tronolone's luck ran dry when a nagging foot injury put him into the operating room and on the sidelines beginning in late-January. \"I truly felt like I was back on top of the mountain. It was really unfortunate.\" Despite the assistance of crutches, Tronolone's determination was praised in the weeks afterward courageously competing to the best of his ability.\nWinter2008.to.Winter2009: New Beginnings and Last Chance\nIn his grand return, Tronolone involuntarily veered away from his most punishing adversaries but remained rather active during this particular stage of mayhem. He turned back the only three \"White Flag\" challenges while simultaneously keeping a close eye on the intensified C.Adams-Megill showdowns.\nAs summer came to a close, \"Dr. K. A.\" ventured off to college leaving his eldest sibling and \"KMJ\" to fight amongst themselves. \"I felt I was the best during (the) absence of Kevin (Adams) during his first year of school,\" Chris explained. As leading general, his golden opportunity to prove his words true came to a head when the anticipated C.Adams-Megill rematch was booked for Thanksgiving weekend. In the final encounter between any of the four for the rest of\nEastCoastDodgeball's\nexistence, Megill emerged with his hand raised high.\nWinter2009.to.Spring2010: Death Valley\nAs soon as 2009 started, it just as quickly ended for four-time season finale headliner Tronolone who surprisingly announced his immediate retirement on January 3. If that wasn't enough, Kevin Adams' educational requirements continued to prevent him from partaking on a full-time basis. Come late-spring, Megill decided in his best interest to hang up the boots as well.\nThe special \"Family Reunion\" in May 2009 treated die-hard fans to the \"sneak-peak\" temporary resurgence of the four mammoth competitors, though only Chris' heart and physical presence permanently stayed on the dodgeball battle zone, keeping the boat afloat until year's end ..\nuntil\n..\nSpring2010.to.PresentDay: Rebirth and Culmination\nThe 3rd Annual \"Family Affair,\" an extravaganza planned months in advance, brought the four household names back together and cemented their forthcoming engagement.\nWith a half-decade of incredible history and unlimited documentation on and off the court, it was only a matter of short time before this steaming situation finally boiled over. On August 14, 2010, it's really going to happen -\nChris Adams and John Tronolone\nversus\nKevin Adams and Kevin Megill\n.\nChris and John were, at the very most, a tad content trading the figurative torch amongst each other for a great length. The addition of two more foes just stirred up a recipe for disaster, so much in fact that they put their own battle issues aside.\nOn the flip side, the youngin' Kevin felt he rarely received the recognition he truly deserved with Steve, Tom, and especially Chris hogging the coveted spotlight. \"... for years I lived in the shadows of my brothers - brothers who came to the game at a much higher level than I did, like Chris! This stuff writes itself!\"\n\"Their attitude is irritating and perhaps cocky. I've been hating them for some time,\" proclaimed the left-handed Megill. It's safe to assume he, too, had grown tired of the selfish antics and control \"C&J\" held over the game.\nBut even with all the professional and personal animosity clearly visible, the need for the outrageous, and apparently desperate career-threatening stipulation can be summed in one simple statement .. Chris Adams and John Tronolone have\nnever\ndefeated either Kevin Adams or Kevin Megill in a captains confrontation. This one and only burning desire has eluded them in each of \"The Axe's\" and \"The Creation's\" stellar careers.\n\"Double K\" has accumulated a mass of 16 total victories, half of which came at the mercy of their August 14th opponents. One last triumph will terminate the eldest Adams' and the former \"King's\" captaincy for good.\n\"Immaculate Redemption?\" There is absolutely nothing holy about this hellish collision.\n________________________________________\n__________________________\nNext week, the final preview will comprise a list of awards and accolades earned by the quad of all-time greats. Keep your eyes open for that fascinating read.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big>For the first - and last - time ever, <b>Chris Adams</b> teams with <b>John Tronolone</b> in an effort to preserve their captaincy against <b>Kevin Adams</b> and <b>Kevin Megill</b> on August 14.<br/><br/><center>Here's their incredible story a half-decade in the making.</center></big><br/><b><u>Fall2005.to.Spring2006: The Two-Man Power Trip</u></b><br/>They were imposing, influential, and powerful. From the moment John Tronolone and Chris Adams set foot onto the famed Ocean Road Park battlegrounds, the <i>ECD</i> community knew who was in charge. \"Chris' debut (at DAY 3) was a wake-up call. My competition and partner-in-crime had arrived,\" Tronolone said.<br/><br/>While the bad blood was noticeable between the two almost immediately, the future legends knew they had a slew of other top talents just wanting a crack. \"Despite our own personal vendetta, I think we stood more in unity; deep down, we felt were the best.\" Greats like Justin Pierce, Dan Spengeman, and Michael Rosinski, along with up-and-coming stars like Tom Adams, John Watters, and Kevin Fitzpatrick each gunned for the Tronolone-Adams pair.<br/><br/>By the time 2006 rolled around, only little had changed. \"I was pretty accurate, threw pretty powerfully, and I feared no new competitors for a long time. As long as I could maintain a threatening game, I would be ready to tackle main events from 2005 onward,\" Chris recounted. <br/><br/>The dominant alliance relentlessly punished much of their opposition until one man refused to fall at the front lines. His name was Kevin Megill.<br/><br/><b><u>Spring2006.to.Winter2007: The Three-Man Power Trip + One</u></b><br/>Adams and Tronolone's spots as the top dogs were on shaking ground as the deadly southpaw fearlessly entered himself into the mix. After only mere single-digit event appearances, Megill was thrusts into the DODGEBALL 30 main event against \"The Creation,\" shockingly defeating the wily veteran! \"There was something eerie about 30. It took some time before I realized what was happening,\" Tronolone recalled.<br/><br/>The weeks that followed furthered \"KMJ's\" progress as an individual star - so much that at DODGEBALL XL in May, his impressive last man standing performance ushered the current three minute countdown. \"I knew I finally 'made it' when I discovered I had the ability to catch some throws. If one can throw decently but also catch, that's really going to be a problem for the opposition,\" Megill explained. The trio continued to terrorize the rest of the dodgeball community - and each other - all while another hungry combatant took a different, yet dangerous road to rid the plaguing shadow.<br/><br/>At DODGEBALL 48, 16 year-old Kevin Adams vanquished the fierce Sara DeCuir to be crowned the 6th <i>Captains Champion</i>. In his first title defense, the young lad had to overcome one of the \"Big 3\" if he truly yearned the DODGEBALL 50 captains position. On July 22, the runt of the Adams clan conquered the near-impossible sending an obsessive Tronolone packing, retaining his coveted championship in the process. Then in the main attraction of the 50th spectacular, Kevin paired with his brother Steve, prevailing over the \"other brothers\" duo of Tom and, you guessed it, Chris. \"I had to claw my way up to the top and make a name for myself,\" the former champ remarked.<br/><br/>The transition from 2006 to 2007 was an absolute wild and twisting roller coaster as the so-called \"Three-Man Power Trip\" - plus one - devastated the scene.<br/><br/><u><b>Winter2007.to.Summer2007: The Summer Of Slam</b></u><br/>Kevin Adams' impressive captaincy and ever-growing physical stature elevated him to heights he had not yet reached. He focused his attention on one cocky individual and within just 90 days of '07, competed in and won the first-ever <i>CREAMation Rules</i> contest in March, a match Tronolone suffered the ill-effects of.<br/><br/>Tronolone sought revenge at the biggest spectacle of them all, DODGEBALL 100, in August. In the colossal 3-on-3 collision, Kevin Adams, joined by Justin \"Piercer\" and \"Crazy One\" Edwards, faced and finished the threesome of Kevin Fitzpatrick, Ryan Letsche, and Tronolone himself. \"There's certainly pride to be found in a hard-fought victory, and ten events mean that to me: the ability to prove myself,\" described K. Adams. This would be the last time the once-crowned \"King of Dodgeball\" faced the youngest Adams in any type of captains contest.<br/><br/>Like his Kevin-named counterpart, \"KMJ\" was just as much stamping his name in the record books as well. He turned back \"The Creation\" in the inaugural <i>BoxBall Dodgeball</i> an astonishing 17 games to 0, a record obliteration that still stands today. Coupled with Kevin Adams' onslaughts throughout the first-half of 2007, some <i>ECD</i> historians believe this string of events and just the overall dominant physical skills led to \"Double K\" finally yanking the crown off the head of one Tronolone.<br/><br/>As for the other multi-time headliner, much of this enthralling period was spent embroiled in a heated, back-and-forth feud with incomparable powerhouse \"Fitz.\" But by late-autumn, Chris rejoined the fray.<br/><br/><b><u>Summer2007.to.Winter2008: Runnin' Down a Dream</u></b><br/>The journey to the never-before-seen \"dream match\" was becoming more prevalent when at the turn of the new year, the long-awaited \"Chris Adams vs. Kevin Megill\" match-up was shockingly announced for March's DODGEBALL C30. In the front-court, <i>PrisonBall</i>-filled, Season 13 Finale, the rocket southpaw dulled \"The Axe\" in a physically-taxing brawl. \"The stakes appeared higher and I knew the mentality of most players would be heightened. I, too, had to rise to the occasion,\" Megill recalled. Chris went back to the shop, sharpened his tools, and was burdened in wait an agonizing 8 months for a shot at payback.<br/><br/>Meanwhile, Tronolone bravely led <i>Team ALL</i> to victory two out of the three brutal Wall-All contests during the era, enough to extract ounces of vengeance for the year of embarrassment perpetrated by the then-teenaged Kevin. Additionally, the bloody, sophomore <i>BoxBall Dodgeball</i> continued his newly-regained reign of suffering. But just when things took a turn for the better, Tronolone's luck ran dry when a nagging foot injury put him into the operating room and on the sidelines beginning in late-January. \"I truly felt like I was back on top of the mountain. It was really unfortunate.\" Despite the assistance of crutches, Tronolone's determination was praised in the weeks afterward courageously competing to the best of his ability. <br/><br/><u><b>Winter2008.to.Winter2009: New Beginnings and Last Chance</b></u><br/>In his grand return, Tronolone involuntarily veered away from his most punishing adversaries but remained rather active during this particular stage of mayhem. He turned back the only three \"White Flag\" challenges while simultaneously keeping a close eye on the intensified C.Adams-Megill showdowns.<br/><br/>As summer came to a close, \"Dr. K. A.\" ventured off to college leaving his eldest sibling and \"KMJ\" to fight amongst themselves. \"I felt I was the best during (the) absence of Kevin (Adams) during his first year of school,\" Chris explained. As leading general, his golden opportunity to prove his words true came to a head when the anticipated C.Adams-Megill rematch was booked for Thanksgiving weekend. In the final encounter between any of the four for the rest of <i>EastCoastDodgeball's</i> existence, Megill emerged with his hand raised high. <br/><br/><u><b>Winter2009.to.Spring2010: Death Valley</b></u><br/>As soon as 2009 started, it just as quickly ended for four-time season finale headliner Tronolone who surprisingly announced his immediate retirement on January 3. If that wasn't enough, Kevin Adams' educational requirements continued to prevent him from partaking on a full-time basis. Come late-spring, Megill decided in his best interest to hang up the boots as well.<br/><br/>The special \"Family Reunion\" in May 2009 treated die-hard fans to the \"sneak-peak\" temporary resurgence of the four mammoth competitors, though only Chris' heart and physical presence permanently stayed on the dodgeball battle zone, keeping the boat afloat until year's end .. <i>until</i> ..<br/><br/><u><b>Spring2010.to.PresentDay: Rebirth and Culmination</b></u><br/>The 3rd Annual \"Family Affair,\" an extravaganza planned months in advance, brought the four household names back together and cemented their forthcoming engagement.<br/><br/>With a half-decade of incredible history and unlimited documentation on and off the court, it was only a matter of short time before this steaming situation finally boiled over. On August 14, 2010, it's really going to happen - <b>Chris Adams and John Tronolone</b> versus <b>Kevin Adams and Kevin Megill</b>.<br/><br/>Chris and John were, at the very most, a tad content trading the figurative torch amongst each other for a great length. The addition of two more foes just stirred up a recipe for disaster, so much in fact that they put their own battle issues aside.<br/><br/>On the flip side, the youngin' Kevin felt he rarely received the recognition he truly deserved with Steve, Tom, and especially Chris hogging the coveted spotlight. \"... for years I lived in the shadows of my brothers - brothers who came to the game at a much higher level than I did, like Chris! This stuff writes itself!\"<br/><br/>\"Their attitude is irritating and perhaps cocky. I've been hating them for some time,\" proclaimed the left-handed Megill. It's safe to assume he, too, had grown tired of the selfish antics and control \"C&amp;J\" held over the game. <br/><br/>But even with all the professional and personal animosity clearly visible, the need for the outrageous, and apparently desperate career-threatening stipulation can be summed in one simple statement .. Chris Adams and John Tronolone have <i>never</i> defeated either Kevin Adams or Kevin Megill in a captains confrontation. This one and only burning desire has eluded them in each of \"The Axe's\" and \"The Creation's\" stellar careers.<br/><br/>\"Double K\" has accumulated a mass of 16 total victories, half of which came at the mercy of their August 14th opponents. One last triumph will terminate the eldest Adams' and the former \"King's\" captaincy for good.<br/><br/>\"Immaculate Redemption?\" There is absolutely nothing holy about this hellish collision.<br/><br/><center>________________________________________<wbr/>__________________________</center><br/><br/><big>Next week, the final preview will comprise a list of awards and accolades earned by the quad of all-time greats. Keep your eyes open for that fascinating read.</big> </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}