{
  "id": 105111,
  "url": "https://dodgeball.livejournal.com/105111.html",
  "title": "5 CANDLES & 1 For Good Luck",
  "date": "",
  "body_text": "It all began on September 3, 2005. Now, five glorious years later, it's time to endlessly celebrate.\nWelcome to\nEastCoastDodgeball's\n5 Year Anniversary\n.\nThe Birth\nFINS restaurant, assistance from the Winston sisters, a pen, some paper, and a little imagination. One gorgeous Saturday night and a few willing participants helped transform my grand vision into one ultimate reality.\n\"For the longest time, I had been dying to play a dodgeball game of this kind,\"\nI excitedly explained in the very first results page. I just knew I had something and really wanted to expand not only the social landscape, but my creative juices as well.\nWho, What, When, Where, Why, and How\nPromotion, promotion, promotion. There's no denying this was crucial to the life of\nECD\n. If it meant staying up 'til the wee-hours of the morning to perfect a poster or edit an entry, then so be it. Word of mouth was an integral part of advertising, but I wanted players, especially the newbies, to\nbelieve\nin what they were seeing. I wanted my pictures, ideas, and visions to speak more than a 1,000 words.\nOf course dodgeball came with winners and losers. Sure situations boiled over and gums flapped. Rationally speaking though, I feel most of you understood that that's just the nature of the sport. What's a game without some rivalry, right! I made sure this was a priority and I think it's safe to assume most of you agree, otherwise you would've never come back for more.\nAs the decision-making, match-signing \"Writer\", I needed to keep things as fresh and innovative as possible, even if it meant sacrificing my own well-being and reputation. One of my proudest achievements - and a match I actually lost - was the first-ever\nCREAMation Rules\ncontest pitting myself and Lenny Herrera against his \"BFF\" Kevin Adams and mine, Valerie Winston. Not only did I want to send everyone home happy before my departure to\nWrestleMania 23\nthe following weekend, but also prove that I wasn't afraid to try new things and test out new concepts. I personally feel the\nCREAMation\nbouts created more memories - and riled up nerves - than most standard encounters. The sky was the limit for such trials and errors ..\nBoxBall Dodgeball\n, the\nDodgeball Draft\n,\nWALL vs. ALL\n,\nGodMode Rules\n,\nRiskBall\n, just to name a few. \"PondScum Invasion\" anyone? Talk about a victory.\nFew things were as thrilling behind-the-scenes [for myself personally] than taking a hungry, new lion and shoving them them into their most crucial battle. It was all about earning those stripes and receiving the recognition that you had \"made it.\" The season finales, and in some instances the mid-season showdowns, carved new names on the superstar rock and nothing could ever erase such accomplishment. The Londono-Wolf and Letsche-Cornero wars of 2008 are prime examples, as are the Teitelbaum-Yochum and Basista-Smalls confrontations from the '09 and '10 \"Family Affair\" events. These eight individuals, among countless others, had climbed the ladder of success and were ready to showcase their absolute best in front of 30, 40, and sometimes even 50 of their longtime comrads.\nI was able to use the veteran lions of yesteryear - Chris Adams, Justin Pierce, Kevin Megill - put them against up-and-coming prospects, and in the process further both on-court feuds and individual progress. How about \"Crazy One\" Mike Edwards for instance!? The man delivered Megill his first captains loss and remained extensively undefeated until he met headliner Kevin Adams .. another warrior who was able to step out of the shadows of his brothers and become easily one of the greatest, if not the, the game had ever seen.\nAs the man behind the madness, I wanted each of the players, especially the deserving leading generals, to feel special, like their place in\nECD\nwas irreplaceable. I certainly believed the hype and I can only hope you did too!\nThe games, the stars, the feuds, the stipulations .. There was always a time and place and I knew never to damage the reputation and credibility of each. Players are fans too and I wanted them to enjoy each aspect of their role. I made sure new stars were awarded the chance in the limelight they desperately deserved and yearned. Stipulations were saved for big-time matches and/or special events and rarely used more than once per ten-week season. Though usually sparked accidentally, long-standing feud bouts were promoted in advance and booked at a proper event (i.e. mid-season).\nI strongly feel that without such balance, events wouldn't have been as unique or meaningful to those that participated. \"Too little is never enough - too much of anything is never a good thing\" .. I like how that sounds.\nWith all that being said, let's take a look at the spectacular line-up for the \"5th Birthday Party.\"\nThe Main Event: WINSTON v. WINSTON 5!\nIt's the match that started it all! Two sisters, five years later, and there's still no clear cut winner - unbelievable! They faced-off at DODGEBALL DAY 1,\nECD's\nOne Year Anniversary\n, the 2006\nChrismas Special\n, and even the\nTwo Year Anniversary\n, and guess what, the score's exactly tied at 2. No other competitors, or contest for that matter, could headline what will truly be\nECD's\nlargest celebration. Legendary female titans\nValerie Winston\nand\nLauren Winston\nmeet at the all-important \"5 Year Anniversary.\"\nThe Hall of Fame: INAUGURAL CLASS!\nThe most influential, physically imposing, and overall deserving individuals of the past half-decade stand in the spotlight they helped create when seven of the game's iconic figures will be prestigiously inducted as the\ncharter members of the\nECDElite\n.\nThe on-court ceremony honoring these legends will feature a presentation of personalized awards medals and brief speeches from the players that knew - and fought - them the most. This attraction alone will be worth everyone's attendance.\nThe Bonuses: GAMES & CONTESTS!\nSince that fateful September 2005 weekend, players have participated in more than just your standard two-team match-up. From the strategic\nRimshot\nand\nHit The Human\ncontests to the wicked\nBattle Royal\n, you can safely assume seeing at least one bonus game sometime during \"5 Year Anniversary.\"\nThe Atmosphere: LOOK & LISTEN!\nBright, colorful decorations and an energetic, family-fun-filled soundtrack. It's just part of the added extras!\nThis monumental event only comes\nonce in a lifetime\n-\ndo not miss out!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD5YAInvitationSideA.jpg\" vspace=\"3\"><big><big>It all began on September 3, 2005. Now, five glorious years later, it's time to endlessly celebrate.<br/><br/>Welcome to <i>EastCoastDodgeball's</i> <b>5 Year Anniversary</b>.</big></big><br/><br/><big><u>The Birth</u></big><br/>FINS restaurant, assistance from the Winston sisters, a pen, some paper, and a little imagination. One gorgeous Saturday night and a few willing participants helped transform my grand vision into one ultimate reality.<br/><br/><a href=\"http://wwecoowner.livejournal.com/2005/09/04/\" target=\"_blank\">\"For the longest time, I had been dying to play a dodgeball game of this kind,\"</a> I excitedly explained in the very first results page. I just knew I had something and really wanted to expand not only the social landscape, but my creative juices as well. <br/><br/><big><u>Who, What, When, Where, Why, and How</u></big><br/><li>Promotion, promotion, promotion. There's no denying this was crucial to the life of <i>ECD</i>. If it meant staying up 'til the wee-hours of the morning to perfect a poster or edit an entry, then so be it. Word of mouth was an integral part of advertising, but I wanted players, especially the newbies, to <i>believe</i> in what they were seeing. I wanted my pictures, ideas, and visions to speak more than a 1,000 words.<br/><br/><li>Of course dodgeball came with winners and losers. Sure situations boiled over and gums flapped. Rationally speaking though, I feel most of you understood that that's just the nature of the sport. What's a game without some rivalry, right! I made sure this was a priority and I think it's safe to assume most of you agree, otherwise you would've never come back for more.<br/><br/><li>As the decision-making, match-signing \"Writer\", I needed to keep things as fresh and innovative as possible, even if it meant sacrificing my own well-being and reputation. One of my proudest achievements - and a match I actually lost - was the first-ever <i>CREAMation Rules</i> contest pitting myself and Lenny Herrera against his \"BFF\" Kevin Adams and mine, Valerie Winston. Not only did I want to send everyone home happy before my departure to <i>WrestleMania 23</i> the following weekend, but also prove that I wasn't afraid to try new things and test out new concepts. I personally feel the <i>CREAMation</i> bouts created more memories - and riled up nerves - than most standard encounters. The sky was the limit for such trials and errors .. <i>BoxBall Dodgeball</i>, the <i>Dodgeball Draft</i>, <i>WALL vs. ALL</i>, <i>GodMode Rules</i>, <i>RiskBall</i>, just to name a few. \"PondScum Invasion\" anyone? Talk about a victory.<br/><br/><li>Few things were as thrilling behind-the-scenes [for myself personally] than taking a hungry, new lion and shoving them them into their most crucial battle. It was all about earning those stripes and receiving the recognition that you had \"made it.\" The season finales, and in some instances the mid-season showdowns, carved new names on the superstar rock and nothing could ever erase such accomplishment. The Londono-Wolf and Letsche-Cornero wars of 2008 are prime examples, as are the Teitelbaum-Yochum and Basista-Smalls confrontations from the '09 and '10 \"Family Affair\" events. These eight individuals, among countless others, had climbed the ladder of success and were ready to showcase their absolute best in front of 30, 40, and sometimes even 50 of their longtime comrads. <br/><br/>I was able to use the veteran lions of yesteryear - Chris Adams, Justin Pierce, Kevin Megill - put them against up-and-coming prospects, and in the process further both on-court feuds and individual progress. How about \"Crazy One\" Mike Edwards for instance!? The man delivered Megill his first captains loss and remained extensively undefeated until he met headliner Kevin Adams .. another warrior who was able to step out of the shadows of his brothers and become easily one of the greatest, if not the, the game had ever seen.<br/><br/>As the man behind the madness, I wanted each of the players, especially the deserving leading generals, to feel special, like their place in <i>ECD</i> was irreplaceable. I certainly believed the hype and I can only hope you did too!<br/><br/><li>The games, the stars, the feuds, the stipulations .. There was always a time and place and I knew never to damage the reputation and credibility of each. Players are fans too and I wanted them to enjoy each aspect of their role. I made sure new stars were awarded the chance in the limelight they desperately deserved and yearned. Stipulations were saved for big-time matches and/or special events and rarely used more than once per ten-week season. Though usually sparked accidentally, long-standing feud bouts were promoted in advance and booked at a proper event (i.e. mid-season).<br/><br/>I strongly feel that without such balance, events wouldn't have been as unique or meaningful to those that participated. \"Too little is never enough - too much of anything is never a good thing\" .. I like how that sounds.<br/><br/>With all that being said, let's take a look at the spectacular line-up for the \"5th Birthday Party.\"<br/><br/><center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD2010095YearAnniversaryD.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD2010095YearAnniversaryD.jpg\"/></a></center><br/><big><big>The Main Event: WINSTON v. WINSTON 5!</big></big><br/>It's the match that started it all! Two sisters, five years later, and there's still no clear cut winner - unbelievable! They faced-off at DODGEBALL DAY 1, <i>ECD's</i> <a href=\"http://dodgeball.livejournal.com/2006/09/05/\" target=\"_blank\">One Year Anniversary</a>, the 2006 <a href=\"http://dodgeball.livejournal.com/2006/12/24/\" target=\"_blank\">Chrismas Special</a>, and even the <a href=\"http://dodgeball.livejournal.com/2007/09/03/\" target=\"_blank\">Two Year Anniversary</a>, and guess what, the score's exactly tied at 2. No other competitors, or contest for that matter, could headline what will truly be <i>ECD's</i> largest celebration. Legendary female titans <b>Valerie Winston</b> and <b>Lauren Winston</b> meet at the all-important \"5 Year Anniversary.\"<br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECDEliteLogoA.jpg\" vspace=\"3\"><br/><big><big>The Hall of Fame: INAUGURAL CLASS!</big></big><br/>The most influential, physically imposing, and overall deserving individuals of the past half-decade stand in the spotlight they helped create when seven of the game's iconic figures will be prestigiously inducted as the <b>charter members of the <i>ECDElite</i></b>.<br/><br/>The on-court ceremony honoring these legends will feature a presentation of personalized awards medals and brief speeches from the players that knew - and fought - them the most. This attraction alone will be worth everyone's attendance.<br/><br/><big><big>The Bonuses: GAMES &amp; CONTESTS!</big></big><br/>Since that fateful September 2005 weekend, players have participated in more than just your standard two-team match-up. From the strategic <i>Rimshot</i> and <i>Hit The Human</i> contests to the wicked <i>Battle Royal</i>, you can safely assume seeing at least one bonus game sometime during \"5 Year Anniversary.\"<br/><br/><big><big>The Atmosphere: LOOK &amp; LISTEN!</big></big><br/>Bright, colorful decorations and an energetic, family-fun-filled soundtrack. It's just part of the added extras!<br/><br/><big><b><center>This monumental event only comes <u>once in a lifetime</u> - <br/>do not miss out!</center></b></big> </img></li></li></li></li></li></img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD5YAInvitationSideA.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD2010095YearAnniversaryD.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECDEliteLogoA.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}