{
  "id": 106400,
  "url": "https://dodgeball.livejournal.com/106400.html",
  "title": "The PIE To DIE For",
  "date": "",
  "body_text": "\"Reluctantly crouched at the starting line, engines pumping and thumping in time.\nThe green light flashes, the flags go up. Churning and burning, they yearn for the cup ..\"\nIt was only one of the biggest wars ever witnessed as three of\nEastCoastDodgeball's\nmost recognized power couples were divorced into a massive, rare 3-on-3 encounter. And for nearly two years, die-hard fans had waited with great anticipation for the return of the game's most popular ingredient - the dreaded\nCREAMation\nstipulation - and no doubt were they in for an event impossible to forget.\nMATCH SUMMARY\nPerhaps never before had seven incredibly-fun, yet ultra-fierce rounds been so closely contested the likes of which experienced on October 16, 2010. The non-stop inaugural bout launched the mayhem to seemingly no end signaling the beginning of both \"Divorce Court\" and the one-point advantage for the Rafferty-Hoppe-Spengeman combination. The sophomore game duplicated the success of the self-named \"Team RAD\" only for them to be denied the same conclusive results in the following third and fourth.\nBy the time battles 5 and 6 rolled around, it was clear the physical and mental toll was off the page as several soldiers became either limited in mobility and/or unfortunately sidelined for good*. More importantly to the match itself, both coalitions traded victories yet again keeping the engagement from termination at an even 3.\nThe deadly seventh proved to be the deciding opportunity to put all the verbal disputes, debatable calls, and brutality to rest. In the last second of the final hour,\nECDElitest\nDiana DiBuccio managed to methodically dismiss fellow\nElitist\nand long-time nemesis Justin Pierce from further destruction. Along with her only ally, Captain Dan Spengeman, still alive, she followed up with pivotal kills on Steve Pham and enemy general Mullins. These crucial, wisely-timed eliminations opened up the chance for Captain Spengeman himself to seal the deal with a bullet perpetrated against Hall of Fame-bound female titan, Lauren Stopa.\nRyan Rafferty\n,\nAshley Hoppe\n, and\nDan Spengeman\ndefeated\nJulia Dennebaum\n,\nMichael Edwards\n, and\nMichelle Mullins\n, 4 - 3.\nThose absent from this magical melee if you will, surely missed one of\nECD's\nfinest presentations and, more specifically, its heart-pounding ending.\nEXCLUSIVE VIDEOS!\nDennebaum\nCREAMation\n..\nEdwards\nCREAMation\n..\nMullins\nCREAMation\n*Injured Reserves!\nThe combination of dodgeball's month-long absence and the chilly October breeze sent several combatants home with various aches and pains. New female sensation\nJoanice Lima\nand legendary\nECDElitist\nKevin Megill\nbattled leg and throwing arm injuries, respectively, prior to \"Divorce Court\" and were held to playing defensively. By Game 2, \"The Writer's\" right-hand man and first overall selection\nJohn Tronolone\njoined the injured reserves switching from his powerful primary throwing stance to an inconsistent southpaw position after his right arm began to quickly give out. The casualties didn't cease there either.\nIn one of the scarier moments, leading lady\nAshley Hoppe's\nviciously contorted left knee kept her seated along the sidelines for the remainder of \"Divorce Court.\"\nECDElitist\nMike \"Sputz\" Krott's\npotential broken toe,\nMari Travassos'\nbuckled right knee, and Captain\nDan Spengeman's\nsore shoulder and arm muscles should have all been obvious clues to throw in the towel earlier than the usual 9pm mark.\nRecords and Recogntion\nAttendance\n: 22, comprised of 15 men and 7 women.\nNew Dodgeballers\n: (2) Michael Petschenik and Alec Moran\nGame Rules\n: Classic two-team.\nFeatured Match\n: Ryan Rafferty, Ashley Hoppe, and Dan Spengeman defeated Julia Dennebaum, Michael Edwards, and Michelle Mullins in\nECD's\n10th\nCREAMation Rules\ncontest. This was the first 3-on-3 match contested under\nCREAMation Rules\nand only the fourth 3-on-3 match ever.\nGame-By-Game Results\n: Rafferty/Hoppe/Spengeman 1, 2, 5, 7 ; Dennebaum/Edwards/Mullins 3, 4, 6\nCaptains Records\n: Rafferty 1-0-0; Hoppe 2-0-0; Spengeman 5-1-0; Dennebaum 0-1-0; Edwards 5-2-1; Mullins 0-2-1.\nRafferty and Dennebaum became the first two captains to compete in their debut match under the\nCREAMation Rules\nstipulation.\nEdwards became only the third captain in history to compete in two separate 3-on-3 wars following Kevin Fitzpatrick (100, CXV) and Juan Londono (CXV, 150).\nSoundtrack\n: Julia Dennebaum\nTheme Song\n: \"The Distance\" by Cake\nOnline Exclusive!\nBelieve it or not, the\nCREAMation Rules\nstipulation was planned way back in mid-summer without any captains even scheduled. But in August, Julia Dennebaum discussed the possibility of becoming team general with current boyfriend Ryan Rafferty. They immediately agreed on the then-originally planned attraction pitting both she and Ryan against Ashley Hoppe and a reluctant Michael Edwards.\nAround the time of\nECD's\n\"5 Year Anniversary\" extravaganza, another couple was added to the mix in veterans Michelle Mullins and Dan Spengeman. With three boyfriend-girlfriend pairs willing and able to compete - none ever partaking in a\nCREAMation\nbout - each were split into the two formidable factions seen at \"Divorce Court.\"\nIt should also be noted that a possible fourth duo - Mari Travassos and Jon Yochum - were also asked to participate. Mari's work schedule however conflicted with her definite participation.\n________________________________________\n___________________\nNext Event\n: WALL faces ALL for the first time in nearly 24 months on November 27. (Date subject to change)",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><b>\"Reluctantly crouched at the starting line, engines pumping and thumping in time.<br/>The green light flashes, the flags go up. Churning and burning, they yearn for the cup ..\"</b></big><br/><br/><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201010DivorceCourtC.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201010DivorceCourtC.jpg\"/></a></center><br/>It was only one of the biggest wars ever witnessed as three of <i>EastCoastDodgeball's</i> most recognized power couples were divorced into a massive, rare 3-on-3 encounter. And for nearly two years, die-hard fans had waited with great anticipation for the return of the game's most popular ingredient - the dreaded <i>CREAMation</i> stipulation - and no doubt were they in for an event impossible to forget.<br/><br/>MATCH SUMMARY<br/>Perhaps never before had seven incredibly-fun, yet ultra-fierce rounds been so closely contested the likes of which experienced on October 16, 2010. The non-stop inaugural bout launched the mayhem to seemingly no end signaling the beginning of both \"Divorce Court\" and the one-point advantage for the Rafferty-Hoppe-Spengeman combination. The sophomore game duplicated the success of the self-named \"Team RAD\" only for them to be denied the same conclusive results in the following third and fourth.<br/><br/>By the time battles 5 and 6 rolled around, it was clear the physical and mental toll was off the page as several soldiers became either limited in mobility and/or unfortunately sidelined for good*. More importantly to the match itself, both coalitions traded victories yet again keeping the engagement from termination at an even 3.<br/><br/>The deadly seventh proved to be the deciding opportunity to put all the verbal disputes, debatable calls, and brutality to rest. In the last second of the final hour, <i>ECDElitest</i> Diana DiBuccio managed to methodically dismiss fellow <i>Elitist</i> and long-time nemesis Justin Pierce from further destruction. Along with her only ally, Captain Dan Spengeman, still alive, she followed up with pivotal kills on Steve Pham and enemy general Mullins. These crucial, wisely-timed eliminations opened up the chance for Captain Spengeman himself to seal the deal with a bullet perpetrated against Hall of Fame-bound female titan, Lauren Stopa.<br/><br/><i><b>Ryan Rafferty</b>, <b>Ashley Hoppe</b>, and <b>Dan Spengeman</b> defeated <b>Julia Dennebaum</b>, <b>Michael Edwards</b>, and <b>Michelle Mullins</b>, 4 - 3.</i><br/><br/>Those absent from this magical melee if you will, surely missed one of <i>ECD's</i> finest presentations and, more specifically, its heart-pounding ending.<br/><br/><center><b><big>EXCLUSIVE VIDEOS!</big></b> <br/><a href=\"http://www.youtube.com/watch?v=LLYxQZqiy-I\" rel=\"nofollow\" target=\"_blank\">Dennebaum <i>CREAMation</i></a> .. <a href=\"http://www.youtube.com/watch?v=n6-8pnN8zxk\" rel=\"nofollow\" target=\"_blank\">Edwards <i>CREAMation</i></a> .. <a href=\"http://www.youtube.com/watch?v=8XfixB4-46w\" rel=\"nofollow\" target=\"_blank\">Mullins <i>CREAMation</i></a></center><br/><u>*Injured Reserves!</u><br/>The combination of dodgeball's month-long absence and the chilly October breeze sent several combatants home with various aches and pains. New female sensation <b>Joanice Lima</b> and legendary <i>ECDElitist</i> <b>Kevin Megill</b> battled leg and throwing arm injuries, respectively, prior to \"Divorce Court\" and were held to playing defensively. By Game 2, \"The Writer's\" right-hand man and first overall selection <b>John Tronolone</b> joined the injured reserves switching from his powerful primary throwing stance to an inconsistent southpaw position after his right arm began to quickly give out. The casualties didn't cease there either.<br/><br/>In one of the scarier moments, leading lady <b>Ashley Hoppe's</b> viciously contorted left knee kept her seated along the sidelines for the remainder of \"Divorce Court.\" <i>ECDElitist</i> <b>Mike \"Sputz\" Krott's</b> potential broken toe, <b>Mari Travassos'</b> buckled right knee, and Captain <b>Dan Spengeman's</b> sore shoulder and arm muscles should have all been obvious clues to throw in the towel earlier than the usual 9pm mark.<br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201010DivorceCourtD.jpg\" vspace=\"3\"><br/><big><u>Records and Recogntion</u></big><br/><b>Attendance</b>: 22, comprised of 15 men and 7 women.<br/><b>New Dodgeballers</b>: (2) Michael Petschenik and Alec Moran<br/><br/><b>Game Rules</b>: Classic two-team.<br/><b>Featured Match</b>: Ryan Rafferty, Ashley Hoppe, and Dan Spengeman defeated Julia Dennebaum, Michael Edwards, and Michelle Mullins in <i>ECD's</i> 10th <i>CREAMation Rules</i> contest. This was the first 3-on-3 match contested under <i>CREAMation Rules</i> and only the fourth 3-on-3 match ever. <br/><b>Game-By-Game Results</b>: Rafferty/Hoppe/Spengeman 1, 2, 5, 7 ; Dennebaum/Edwards/Mullins 3, 4, 6<br/><b>Captains Records</b>: Rafferty 1-0-0; Hoppe 2-0-0; Spengeman 5-1-0; Dennebaum 0-1-0; Edwards 5-2-1; Mullins 0-2-1.<br/><li>Rafferty and Dennebaum became the first two captains to compete in their debut match under the <i>CREAMation Rules</i> stipulation.<br/><li>Edwards became only the third captain in history to compete in two separate 3-on-3 wars following Kevin Fitzpatrick (100, CXV) and Juan Londono (CXV, 150).<br/><br/><b>Soundtrack</b>: Julia Dennebaum<br/><b>Theme Song</b>: \"The Distance\" by Cake<br/><br/><u><i>Online Exclusive!</i></u><br/>Believe it or not, the <i>CREAMation Rules</i> stipulation was planned way back in mid-summer without any captains even scheduled. But in August, Julia Dennebaum discussed the possibility of becoming team general with current boyfriend Ryan Rafferty. They immediately agreed on the then-originally planned attraction pitting both she and Ryan against Ashley Hoppe and a reluctant Michael Edwards.<br/><br/>Around the time of <i>ECD's</i> \"5 Year Anniversary\" extravaganza, another couple was added to the mix in veterans Michelle Mullins and Dan Spengeman. With three boyfriend-girlfriend pairs willing and able to compete - none ever partaking in a <i>CREAMation</i> bout - each were split into the two formidable factions seen at \"Divorce Court.\"<br/><br/>It should also be noted that a possible fourth duo - Mari Travassos and Jon Yochum - were also asked to participate. Mari's work schedule however conflicted with her definite participation.<br/><br/><center>________________________________________<wbr/>___________________<br/><br/><b>Next Event</b>: WALL faces ALL for the first time in nearly 24 months on November 27. (Date subject to change)<br/></center> </li></li></img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201010DivorceCourtC.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201010DivorceCourtD.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}