{
  "id": 107594,
  "url": "https://dodgeball.livejournal.com/107594.html",
  "title": "INITIATION DAY",
  "date": "",
  "body_text": "A Message From \"The Writer\"!\nI would like to welcome each and every\nEastCoastDodgeball\ncombatant to a new era of competition and excitement with the \"Rookies vs. Legends\" initiative!\nYou will witness some of\nECD's\nmost thrilling, never-before-seen showdowns pitting the game's newest and brightest stars against a slew of iconic figures who helped pave the way for all those that followed. Without any further adieu, I proudly present this kick-off - -\nIn the first of this intriguing series of contests, comedic rookie sensation\nArthur Casbarro\ngoes one-on-one with arguably the single, most dangerous force to ever compete,\nKevin Fitzpatrick\n. They've exchanged more than just words the last several events and will certainly intensify their brewing rivalry the old fashioned way.\nFrom the moment he set foot on the dodgeball battleground, fearless upstart\nCasbarro\nforced many of his peers to turn their heads in recognition. In his captains debut, the rookie will attempt to make an even bigger name for himself at the expense of one of the all-time greats.\nBorn November 6, 1988\nDebut November 27, 2010 | \"Wall Brawl\"\nECDElitist\n\"Fitz\"\nknows what it is like to stand in this type of spotlight. Having headlined some of\nECD's\nmost crucial outings - a\nCREAMation\nand season finales just to name two - one has to believe Fitzpatrick will be the solid favorite to win.\nBorn January 31, 1987\nDebut November 5, 2005 | DODGEBALL XTWO\n________________________________________\n___________________\nEVENT EXCLUSIVE!\nAs part of the 2011 calendar year, \"The Writer\" asks you, the\nECD\ncrew, to participate in several photo opportunities. Players will have the chance to star in a future promotional poster as well as help build their very own player profile. So get ready because the cameras will be out throughout!\n\"March Mayhem\" comes to you live,\nSaturday, March 26\n, beginning at\n3pm\n. Don't miss it!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><big><u><b>A Message From \"The Writer\"!</b></u></big></big></center>I would like to welcome each and every <i>EastCoastDodgeball</i> combatant to a new era of competition and excitement with the \"Rookies vs. Legends\" initiative!<br/><br/>You will witness some of <i>ECD's</i> most thrilling, never-before-seen showdowns pitting the game's newest and brightest stars against a slew of iconic figures who helped pave the way for all those that followed. Without any further adieu, I proudly present this kick-off - -<br/><br/><center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201103MarchMayhemB-1.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201103MarchMayhemB-1.jpg\"/></a></center><br/>In the first of this intriguing series of contests, comedic rookie sensation <b>Arthur Casbarro</b> goes one-on-one with arguably the single, most dangerous force to ever compete, <b>Kevin Fitzpatrick</b>. They've exchanged more than just words the last several events and will certainly intensify their brewing rivalry the old fashioned way.<br/><br/>From the moment he set foot on the dodgeball battleground, fearless upstart <b>Casbarro</b> forced many of his peers to turn their heads in recognition. In his captains debut, the rookie will attempt to make an even bigger name for himself at the expense of one of the all-time greats.<br/><li> Born November 6, 1988<br/><li> Debut November 27, 2010 | \"Wall Brawl\"<br/><br/><i>ECDElitist</i> <b>\"Fitz\"</b> knows what it is like to stand in this type of spotlight. Having headlined some of <i>ECD's</i> most crucial outings - a <i>CREAMation</i> and season finales just to name two - one has to believe Fitzpatrick will be the solid favorite to win.<br/><li> Born January 31, 1987<br/><li> Debut November 5, 2005 | DODGEBALL XTWO<br/><center>________________________________________<wbr/>___________________<br/><br/><big><b>EVENT EXCLUSIVE!</b></big></center><br/>As part of the 2011 calendar year, \"The Writer\" asks you, the <i>ECD</i> crew, to participate in several photo opportunities. Players will have the chance to star in a future promotional poster as well as help build their very own player profile. So get ready because the cameras will be out throughout!<br/><br/><center><b><big>\"March Mayhem\" comes to you live, <u>Saturday, March 26</u>, beginning at <u>3pm</u>. Don't miss it!</big></b><br/><br/><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201103MarchMayhem.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201103MarchMayhem.jpg\"/></a></center> </li></li></li></li></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201103MarchMayhemB-1.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201103MarchMayhem.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}