{
  "id": 108913,
  "url": "https://dodgeball.livejournal.com/108913.html",
  "title": "Affair FOUR All",
  "date": "",
  "body_text": "It's the all-inclusive, annual tradition that defines\nEast Coast Dodgeball\n.\nWelcome to the 2011\nFamily Affair\nspectacular.\nECDElite\nHall of Fame to Induct New Members\nIt's the prestigious, exclusive hall of famed competitors and on the 18th of June, 2011, the golden doors will reopen to welcome two more of the game's most deserving individuals. Their physical resiliency, mental toughness, and behind-the-scenes contributions have earned the\ntwelfth\nand\nthirteenth\ninductees spots in this very \"elite\" group.\nJoin the celebration when the one and only - and fellow\nECDElitist\n-\nChristopher Adams\nhosts this special attraction at the 4th annual\nFamily Affair\n.\nFamily Affair IV\nRaffle to Send Someone Home Happy\nLike every major\nECD\nouting, there just has to be an extra ingredient added to the mix. One lucky resident of the\nECD\ncommunity will walk away a happy camper. The prize? Well, just leave it to fortunate winner.\nJacobs, Vetrano Clash in Main Event\nThe stage is set for the year's most anticipated showdown when\nECD\n's mightiest finally reach the apex of their careers. 2011's fastest rising superstar\nKenny Jacobs\nepically collides with seasoned veteran\nBobby Vetrano\nat\nFamily Affair IV\n. Here are their stories ...\nJACOBS\n★\nIt was\nEast Coast Dodgeball's\ngrandest occasion as a glorious half-decade of memories were relived and revisited during the single-night spectacular known as the\n5 YEAR ANNIVERSARY\n. That fateful evening produced\nKenny Jacobs\n, eager to accept the challenge set forth.\nThe following months proved fruitful for\nECD\n's newest and brightest mainstay as noble soldiers of years' past took notice at the upstart. But despite a powerful right cannon and athletic defensive displays, not much is truly known of Jacobs.\nHis ascension to the summit has come as fast as it has been furious and chances are, he'll be both physically equipped and mentally prepped for the fight of his life.\n→ Born: May 9, 1990\n→ Debut: September 11, 2010 | 5 YEAR ANNIVERSARY\n→ Entrance Anthem: Eminem \"Not Afraid\"\nVETRANO\n★\nHe was merely a boy among men with the heart of a champion and the capabilities of a skilled, young lion forced to fend for himself. In early 2007, one\nBobby Vetrano's\nEast Coast Dodgeball\njourney arduously commenced, but it wasn't all fun and games.\nCatastrophic wars against Pellecchia and \"Rimshot King\" Letsche - his dastardly cousin no less - helped put the kid on the map. Amidst the ridicule by royal founders and framers, the hungry gladiator Vetrano was left with no alternative but to scratch and claw his way up and above the ranks to cement his name and future legacy.\nNow in 2011, an agonizing four-plus calenders, his odyssey will culminate.\n→ Born November 13, 1992\n→ Debut January 6, 2007 | DODGEBALL 71\n→ Entrance Anthem: Metallica \"For Whom The Bell Tolls\"\nWhile clearly no history or similarities exist between the combatants, the fire and desire within each leading general will be hard to contain within the confines of the dodgeball battlegrounds. Who will raise their hand in triumph? Find out live June 18.\nYour presence would be greatly appreciated.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><big><big>It's the all-inclusive, annual tradition that defines <i>East Coast Dodgeball</i>.<br/>Welcome to the 2011 <i>Family Affair</i> spectacular.</big></big></big></center><br/><br/><big><big><b><i>ECDElite</i> Hall of Fame to Induct New Members</b></big></big><br/>It's the prestigious, exclusive hall of famed competitors and on the 18th of June, 2011, the golden doors will reopen to welcome two more of the game's most deserving individuals. Their physical resiliency, mental toughness, and behind-the-scenes contributions have earned the <b>twelfth</b> and <b>thirteenth</b> inductees spots in this very \"elite\" group.<br/><br/>Join the celebration when the one and only - and fellow <i>ECDElitist</i> - <b>Christopher Adams</b> hosts this special attraction at the 4th annual <i>Family Affair</i>.<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201106FamilyAffairIVG.jpg\" vspace=\"3\"><big><big><b><i>Family Affair IV</i> Raffle to Send Someone Home Happy</b></big></big><br/>Like every major <i>ECD</i> outing, there just has to be an extra ingredient added to the mix. One lucky resident of the <i>ECD</i> community will walk away a happy camper. The prize? Well, just leave it to fortunate winner.<br/><br/><big><big><b>Jacobs, Vetrano Clash in Main Event</b></big></big><br/>The stage is set for the year's most anticipated showdown when <i>ECD</i>'s mightiest finally reach the apex of their careers. 2011's fastest rising superstar <b>Kenny Jacobs</b> epically collides with seasoned veteran <b>Bobby Vetrano</b> at <i>Family Affair IV</i>. Here are their stories ...<br/><br/><big><u>JACOBS</u></big> ★<br/>It was <i>East Coast Dodgeball's</i> grandest occasion as a glorious half-decade of memories were relived and revisited during the single-night spectacular known as the <i>5 YEAR ANNIVERSARY</i>. That fateful evening produced <b>Kenny Jacobs</b>, eager to accept the challenge set forth.<br/><br/>The following months proved fruitful for <i>ECD</i>'s newest and brightest mainstay as noble soldiers of years' past took notice at the upstart. But despite a powerful right cannon and athletic defensive displays, not much is truly known of Jacobs.<br/><br/>His ascension to the summit has come as fast as it has been furious and chances are, he'll be both physically equipped and mentally prepped for the fight of his life.<br/><br/>→ Born: May 9, 1990<br/>→ Debut: September 11, 2010 | 5 YEAR ANNIVERSARY <br/>→ Entrance Anthem: Eminem \"Not Afraid\"<br/><br/><big><u>VETRANO</u></big> ★<br/>He was merely a boy among men with the heart of a champion and the capabilities of a skilled, young lion forced to fend for himself. In early 2007, one <b>Bobby Vetrano's</b> <i>East Coast Dodgeball</i> journey arduously commenced, but it wasn't all fun and games.<br/><br/>Catastrophic wars against Pellecchia and \"Rimshot King\" Letsche - his dastardly cousin no less - helped put the kid on the map. Amidst the ridicule by royal founders and framers, the hungry gladiator Vetrano was left with no alternative but to scratch and claw his way up and above the ranks to cement his name and future legacy.<br/><br/>Now in 2011, an agonizing four-plus calenders, his odyssey will culminate.<br/><br/>→ Born November 13, 1992<br/>→ Debut January 6, 2007 | DODGEBALL 71<br/>→ Entrance Anthem: Metallica \"For Whom The Bell Tolls\"<br/><br/>While clearly no history or similarities exist between the combatants, the fire and desire within each leading general will be hard to contain within the confines of the dodgeball battlegrounds. Who will raise their hand in triumph? Find out live June 18.<br/><br/><center><big><big><big>Your presence would be greatly appreciated.<br/></big></big></big></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201106FamilyAffairIVG.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}