{
  "id": 112216,
  "url": "https://dodgeball.livejournal.com/112216.html",
  "title": "The FINAL FLIGHT ..",
  "date": "",
  "body_text": "Select a flight, purchase a ticket. Board the plane and fasten your seatbelt - you're in for the ride of your life. The engine starts, the ascension begins, and top speed peaks. Your\nFinal Destination\nawaits.\nThe six-year phenomenon\nEast Coast Dodgeball\ninvites you on one last journey, and here's why ...\nThe \"FINAL DESTINATION\" Top Four\n4) The Passengers\n: You just never know who's gonna end up sitting beside you.\nECDElitists\nKevin Megill, Lauren Stopa, Justin Wolf? Reigning\nRIMshot Contest\nChampion Kayla Knott? The Writer perhaps?\n3) The View\n: Just one quick glance down below is all you need to capture the magnificently-illuminated Wall High School battlegrounds. It really is a sight to see.\n2) The Ride\n: A little turbelence only heightens the thrills .. and spills. The unpredictability of it all makes this specific destination that much more memorable.\n1) The Destination\n: This just may be it, for good. Will this be the joy ride that flies into the sunset? Well, just be on the safe side - snag your golden ticket because you never know when it'll be your last.\n________________________________________\n_____________________________\nECD\npresents the grand finale of 2011 with\nFINAL DESTINATION\n, presented live Friday, November 25, emanating from the Wall High School tennis courts beginning at 5:00pm.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>Select a flight, purchase a ticket. Board the plane and fasten your seatbelt - you're in for the ride of your life. The engine starts, the ascension begins, and top speed peaks. Your <b>Final Destination</b> awaits.</i><br/><br/>The six-year phenomenon <i>East Coast Dodgeball</i> invites you on one last journey, and here's why ...<br/><br/><center><big><big><b>The \"FINAL DESTINATION\" Top Four</b></big></big></center><br/><li><b>4) The Passengers</b>: You just never know who's gonna end up sitting beside you. <i>ECDElitists</i> Kevin Megill, Lauren Stopa, Justin Wolf? Reigning <i>RIMshot Contest</i> Champion Kayla Knott? The Writer perhaps?<br/><br/><li><b>3) The View</b>: Just one quick glance down below is all you need to capture the magnificently-illuminated Wall High School battlegrounds. It really is a sight to see.<br/><br/><li><b>2) The Ride</b>: A little turbelence only heightens the thrills .. and spills. The unpredictability of it all makes this specific destination that much more memorable.<br/><br/><li><b>1) The Destination</b>: This just may be it, for good. Will this be the joy ride that flies into the sunset? Well, just be on the safe side - snag your golden ticket because you never know when it'll be your last.<br/><br/><center>________________________________________<wbr/>_____________________________</center><br/><br/><big><i>ECD</i> presents the grand finale of 2011 with <b>FINAL DESTINATION</b>, presented live Friday, November 25, emanating from the Wall High School tennis courts beginning at 5:00pm.</big><br/><br/><center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201111FinalDestinationA.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201111FinalDestinationA.jpg\"/></a></center> </li></li></li></li></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201111FinalDestinationA.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}