{
  "id": 114290,
  "url": "https://dodgeball.livejournal.com/114290.html",
  "title": "One Day To Stop This WORLD",
  "date": "",
  "body_text": "Charity Fund: ALZHEIMER'S ASSOCIATION\nWant to take that extra step? Here's your golden chance and what a tremendous cause, too. Headed by proud Sunrise Senior Living employee John Tronolone, he and his occupational team members are kindly asking for just an ounce of financial support in their \"Walk To End Alzheimer's\" charity fund. All proceeds will benefit the Alzheimer's Association and each donator of a $1 minimum will receive a complimentary mini\nClifBar\nas a \"thank you.\" This is truly a worth-while effort and your contribution would certainly be appreciated.\nFor more information, check the local Sunrise page by clicking\nHERE\n.\nThe Main Event: KATZ v. WOLF\nNow, if you're looking for blood, than make no mistake about it - this malignant confrontation is for\nyou\n. The evil, behind-the-scenes mastermind has chosen the game's baddest animals and forced them to duke it out. But only one will survive. Catch this match-of-the-year contender when \"The Big Kat\"\nZach Katz\nclashes with \"The Wolf Man\"\nJustin Wolf\nin this do-or-die encounter. And remember, it's Wolf's birthday!\nOne Musn't Forget: The HISTORY\nThe\nECD\nWorld has reached it's next milestone and no doubt it'll be a classic. If you're not convinced or remain unsure of your attendance, why not take a stroll down memory lane ...\nFAMILY AFFAIR I\nIt was arguably the most important and memorable outing in the history of\nECD\n. Personalized invitations and countless emails and texts helped set the stage, and trust that the stakes were sky high. Come game time, the dodgeball battlefield was swarmed with close friends and beloved relatives in what would soon become a successful annual tradition. A whopping 25-plus spectactors captured the sights and sounds of the multi-hour extravaganza, with reviews universally acclaimed throughout the community.\n→ May 31, 2008\n→ Event #140; FAMILY AFFAIR was actually the subtitle for the chronological DODGEBALL CXL\n→ Active Participants: 39\nFAMILY REUNION\nIn the midst of the\nAdams Era\nof\nECD\n, the second annual FAMILY AFFAIR reunited the stars of yesteryear for this one-time-only presentation. Again, the audience was jam-packed and those feeling frisky risked their physical health for an ounce of dodgeball goodness. It was really a sight to see.\n→ May 23, 2009\n→ Event #172\n→ Active Participants: 30-40*\n→ *To date, this is the\nonly\nECD\nevent under Tronolone without any recorded statistics other than the main event match-up\nFAMILY AFFAIR III\nThe third installment was crucial for one main reason: the rebirth of\nECD\n. All eyes and ears were glued to the promotional posters, adrenaline-pumping previews, and major announcements for the agonizing month before showtime. By nightfall on the 24th of July, 2010, the unforgettable nostalgic feeling re-emerged for countless diehards who had remained in hope for this incredible evening.\n→ July 24, 2010\n→ Event #173\n→ Active Participants: 33\nFAMILY AFFAIR IV\nAnd of course the yearly spectacle just had to continue in 2011, generating yet another all-around fun-filled gathering for players and crowd members alike. Starring the likes of Kenny Jacobs, Bobby Vetrano, and newly-inducted\nECDElite\nHall of Famers Lauren Stopa and John Tronolone, not a single soul left Wall High School unhappy.\n→ June 18, 2011\n→ Event #182\n→ Active Participants: 24\nFAMILY AFFAIR V\nSaturday, June 23, 2012\n5:30pm - 9:30pm\nWall High School",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201206FamilyAffair5D.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201206FamilyAffair5D.jpg\"/></a></center><br/><big><big><b>Charity Fund: ALZHEIMER'S ASSOCIATION</b></big></big><br/>Want to take that extra step? Here's your golden chance and what a tremendous cause, too. Headed by proud Sunrise Senior Living employee John Tronolone, he and his occupational team members are kindly asking for just an ounce of financial support in their \"Walk To End Alzheimer's\" charity fund. All proceeds will benefit the Alzheimer's Association and each donator of a $1 minimum will receive a complimentary mini <i>ClifBar</i> as a \"thank you.\" This is truly a worth-while effort and your contribution would certainly be appreciated.<br/>For more information, check the local Sunrise page by clicking <b><a href=\"http://act.alz.org/site/TR/Walk/NJ-GreaterNewJersey/243167018?pg=team&amp;fr_id=1744&amp;team_id=41540\" rel=\"nofollow\" target=\"_blank\">HERE</a></b>.<br/><br/><big><big><b>The Main Event: KATZ v. WOLF</b></big></big><br/>Now, if you're looking for blood, than make no mistake about it - this malignant confrontation is for <i>you</i>. The evil, behind-the-scenes mastermind has chosen the game's baddest animals and forced them to duke it out. But only one will survive. Catch this match-of-the-year contender when \"The Big Kat\" <b>Zach Katz</b> clashes with \"The Wolf Man\" <b>Justin Wolf</b> in this do-or-die encounter. And remember, it's Wolf's birthday!<br/><br/><big><big><b>One Musn't Forget: The HISTORY</b></big></big><br/>The <i>ECD</i> World has reached it's next milestone and no doubt it'll be a classic. If you're not convinced or remain unsure of your attendance, why not take a stroll down memory lane ...<br/><br/><b><a href=\"http://dodgeball.livejournal.com/2008/06/01/\" target=\"_blank\">FAMILY AFFAIR I</a></b><br/>It was arguably the most important and memorable outing in the history of <i>ECD</i>. Personalized invitations and countless emails and texts helped set the stage, and trust that the stakes were sky high. Come game time, the dodgeball battlefield was swarmed with close friends and beloved relatives in what would soon become a successful annual tradition. A whopping 25-plus spectactors captured the sights and sounds of the multi-hour extravaganza, with reviews universally acclaimed throughout the community.<br/>→ May 31, 2008<br/>→ Event #140; FAMILY AFFAIR was actually the subtitle for the chronological DODGEBALL CXL<br/>→ Active Participants: 39<br/><br/><b>FAMILY REUNION</b><br/>In the midst of the <i>Adams Era</i> of <i>ECD</i>, the second annual FAMILY AFFAIR reunited the stars of yesteryear for this one-time-only presentation. Again, the audience was jam-packed and those feeling frisky risked their physical health for an ounce of dodgeball goodness. It was really a sight to see.<br/>→ May 23, 2009<br/>→ Event #172<br/>→ Active Participants: 30-40*<br/>→ *To date, this is the <u>only</u> <i>ECD</i> event under Tronolone without any recorded statistics other than the main event match-up<br/><br/><b><a href=\"http://dodgeball.livejournal.com/2010/07/27/\" target=\"_blank\">FAMILY AFFAIR III</a></b><br/>The third installment was crucial for one main reason: the rebirth of <i>ECD</i>. All eyes and ears were glued to the promotional posters, adrenaline-pumping previews, and major announcements for the agonizing month before showtime. By nightfall on the 24th of July, 2010, the unforgettable nostalgic feeling re-emerged for countless diehards who had remained in hope for this incredible evening.<br/>→ July 24, 2010<br/>→ Event #173<br/>→ Active Participants: 33<br/><br/><b><a href=\"http://dodgeball.livejournal.com/2011/06/21/\" target=\"_blank\">FAMILY AFFAIR IV</a></b><br/>And of course the yearly spectacle just had to continue in 2011, generating yet another all-around fun-filled gathering for players and crowd members alike. Starring the likes of Kenny Jacobs, Bobby Vetrano, and newly-inducted <i>ECDElite</i> Hall of Famers Lauren Stopa and John Tronolone, not a single soul left Wall High School unhappy.<br/>→ June 18, 2011<br/>→ Event #182<br/>→ Active Participants: 24<br/><br/><center><b><big><big><big>FAMILY AFFAIR V<br/>Saturday, June 23, 2012<br/>5:30pm - 9:30pm<br/>Wall High School</big></big></big></b></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201206FamilyAffair5D.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}