{
  "id": 115312,
  "url": "https://dodgeball.livejournal.com/115312.html",
  "title": "One Seat At The THRONE",
  "date": "",
  "body_text": "It was destined to occur at some point during this journey. Now is finally the time where the single, biggest powerhouses perhaps of all-time clash in this epic, earth-shattering confrontation. And you will never, ever see it again.\nKevin Adams v. Kevin Fitzpatrick\nat\nEast Coast Dodgeball\nCLASH of the TITANS\non 08.04.2012. Here's their incredible story over a half-decade in the making ..\n________________________________________\n_______\n5, A.D.\n: Fifteen year-old Kevin Adams joins the\nECD\nuniverse becoming the third of the four recognized brothers to enter the games.\n10, A.D.\n: In just his fifth outing, the young Adams squares off against sibling Steve in the first-ever season finale extravaganza.\n12, A.D.\n: Kevin Fitzpatrick makes an immediate impact in his debut, battling the aggressive nature of C. Adams, Pierce, and most notably, \"The Creation\" Tronolone.\n19, A.D.\n: Fitzpatrick impressively vanquishes Katz in his inaugural showdown.\n20, A.D.\n: Perhaps in a prelude to their future clash, both Adams and Fitzpatrick receive prestigious \"Excellence Awards\" -\nAct Of Courage\nand\nPowerhouse Thrower\n, respectively. Clearly, their god-like statuses were beginning to increase.\n35, A.D.\nTension had finally boiled over when Fitzpatrick went toe-to-toe with Tronolone in their first of two intense meetings.\n48, A.D.\n: Adams becomes the 6th\nCaptains Champion\ndefeating female sensation DeCuir.\n49, A.D.\nAdams retains the coveted championship, eliminating the maniacal Tronolone from contention.\n50, A.D.\n: In the grandest clash of the unforgettable era, Adams and brother Steve turn back the challenge of the \"other brothers\" duo, Tom and Chris. Meanwhile, Fitzpatrick becomes the second\nAct Of Courage\nrecipient.\n51, A.D.\n: Adams' reign of generalship supremacy continues with his record-tying fourth consecutive victory, this time over the gifted Letsche.\n52, A.D.\n: The\nCaptains Championship\nis subsequently retired following the Adams-Letsche sequel.\n62, A.D.\n: In an unprecedented feat, Fitzpatrick captures three\nBattle Royal\nvictories further cementing a legacy early in his career.\n70, A.D.\n: In unquestionably one of the most satanic melees ever witnessed, the rivalry that revolutionized the captains match comes to a head when Fitzpatrick rather handily defeats C. Adams to conclude the calendar.\n76, A.D.\n: Legend Lauren Stopa is stopped dead in her tracks by Fitzpatrick in a crushing 11-1 slaughter.\n81, A.D.\n: Tronolone and Herrera are soundly sent packing against the tandem of Adams and V. Winston in the\nECD\nWorld's first\nCREAMation Rules\nencounter.\n86, A.D.\n: In his next war, Adams successfully battles the athletically-blessed Cornero in a contest billed as \"2005 v. 2007\".\n94, A.D.\n: Adams puts on a heroic clinic despite his captain's denied quest at grabbing hold the event victory. The Writer believes this event to be a pivotal turning point in the career of the now 17 year-young warrior.\n100, A.D.\n: To some, it is still the grandest and greatest of all-time and maybe for one prime reason: the triumphant trio of Pierce, Edwards, and Adams faced off against Tronolone, Letsche, and Fitzpatrick. To date, it is the only time in any\nECD\nera where Adams and Fitzpatrick met in any type of captains confrontation. Additionally, some\nECD\nhistorians and the omniscient Writer strongly believe that this event placed Adams atop the\nECD\nthrone.\n105, A.D.\n: In the midst of this period of transition, Fitzpatrick and C. Adams wage war in their long-awaited return bout from the previous calendar in just the third\nCREAMation Rules\ncollision.\n111, A.D.\n: Not to be outdone, Adams once again turns back Cornero in their own sophomore encounter.\n115, A.D.\n: Fitzpatrick finally closes the coffin on his enduring feud with C. Adams in this classic three-vs-three war also featuring Londono, Marzarella, Basista, and Avakian.\n120, A.D.\n: After being voted by his peers, Adams reigns supreme as the \"Player of the Year\".\n123, A.D.\n: Herrera is no match for the powerful Fitzpatrick in this anticipated special attraction.\n142, A.D.\n: Fitzpatrick adds another trophy to his collection, winning his 4th\nBattle Royal\n. To this day, he holds the record for the second-most number of\nBattle Royal\ntitles.\n145, A.D.\n: Adams however had his own record-shattering agenda by destroying high-ranking general Edwards in a 6-0 blow-out. The victory made Adams the\nonly\ncaptain to reach both 5 straight\nand\n9 total wins.\n169, A.D.\n: Christmas was never quite the same after this contest when Fitzpatrick hands friend-turned-foe Wolf a brutal season beating.\n171, A.D.\n: Fitzpatrick and Tronolone meet only once more, this time to the distinct advantage of Fitzpatrick. The win sent Tronolone packing for nearly 19 months.\n174, A.D.\n: In his final captains war to date, Adams, alongside icon Megill, mightily clashed with long-standing, revenge-filled rivals C. Adams and Tronolone. Fitzpatrick, an uncommon ally of the C. Adams-Tronolone coalition, was rather instrumental preventing Adams his own closure.\n175, A.D.\n: Both Adams and Fitzpatrick are inducted as charter members of the\nECDElite\nHall of Fame.\n184, A.D.\n: Fitzpatrick - along with the elder Winston and Pierce - compete in a memorable \"Star\" War with renewed rival C. Adams, familiar enemy Edwards, and the cunning youngest Winston. The all-knowing Writer trusts the figurative\nECD\ncrown belonged solely to Fitzpatrick; a lengthy, year-long stretch [and beyond].\n189, A.D.\n: Earth-shaking rumblings begin of the never-before-seen, one-on-one clash of titans between Adams and Fitzpatrick.\n191, A.D.\n: The announcement of the mega Adams-Fitzpatrick encounter is made official for 192, A.D.\n192, A.D.\n: And so it goes .. the coined CLASH OF THE TITANS is carved in stone to host the massive, titanic battle between arguably the two most powerful, imposing forces in all the heavens.\n________________________________________\n_______\nAdams and Fitzpatrick might just be the very last of their kind. The decline of iconic figures Tronolone and Megill as well as the permanent departure of one C. Adams have dispelled any re-emerging notions of the formerly-known \"Big Three\". The grounds' security system has also experienced its members dwindle leaving Pierce as the sole survivor. Major leaders like Wolf, Stopa, Edwards, Katz, among several others remain as high-ranking officials, but with slightly less experience than their counterparts.\nAdams and Fitzpatrick have clearly etched their names in the annals of time and perhaps this one, last effort is all that's left to prove. Through all the mental anguish, physical pain, and in rare cases emotional breakdown, they have each - at one period or another - undeniably ascended to the pinnacle of\nECD\n. But at CLASH OF THE TITANS, only\none\nwill be able to plant their flag on Mount Olympus.\nThere isn't anything more to say or do for the power rests in the bodies, minds, hearts, and souls of the two gods that remain.\nKevin Adams vs. Kevin Fitzpatrick\nCLASH OF THE TITANS | 192 A.D.\nAugust 4, 2012",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><b>It was destined to occur at some point during this journey. Now is finally the time where the single, biggest powerhouses perhaps of all-time clash in this epic, earth-shattering confrontation. And you will never, ever see it again.<br/><br/><b><u>Kevin Adams v. Kevin Fitzpatrick</u></b> at <i>East Coast Dodgeball</i> <b>CLASH of the TITANS</b> on 08.04.2012. Here's their incredible story over a half-decade in the making .. </b></big><br/><center>________________________________________<wbr/>_______</center><br/><b>5, A.D.</b>: Fifteen year-old Kevin Adams joins the <i>ECD</i> universe becoming the third of the four recognized brothers to enter the games.<br/><br/><b>10, A.D.</b>: In just his fifth outing, the young Adams squares off against sibling Steve in the first-ever season finale extravaganza.<br/><br/><b>12, A.D.</b>: Kevin Fitzpatrick makes an immediate impact in his debut, battling the aggressive nature of C. Adams, Pierce, and most notably, \"The Creation\" Tronolone.<br/><br/><b>19, A.D.</b>: Fitzpatrick impressively vanquishes Katz in his inaugural showdown.<br/><br/><b>20, A.D.</b>: Perhaps in a prelude to their future clash, both Adams and Fitzpatrick receive prestigious \"Excellence Awards\" - <i>Act Of Courage</i> and <i>Powerhouse Thrower</i>, respectively. Clearly, their god-like statuses were beginning to increase.<br/><br/><b>35, A.D.</b> Tension had finally boiled over when Fitzpatrick went toe-to-toe with Tronolone in their first of two intense meetings.<br/><br/><b>48, A.D.</b>: Adams becomes the 6th <i>Captains Champion</i> defeating female sensation DeCuir.<br/><br/><b>49, A.D.</b> Adams retains the coveted championship, eliminating the maniacal Tronolone from contention.<br/><br/><b>50, A.D.</b>: In the grandest clash of the unforgettable era, Adams and brother Steve turn back the challenge of the \"other brothers\" duo, Tom and Chris. Meanwhile, Fitzpatrick becomes the second <i>Act Of Courage</i> recipient.<br/><br/><b>51, A.D.</b>: Adams' reign of generalship supremacy continues with his record-tying fourth consecutive victory, this time over the gifted Letsche.<br/><br/><b>52, A.D.</b>: The <i>Captains Championship</i> is subsequently retired following the Adams-Letsche sequel.<br/><br/><b>62, A.D.</b>: In an unprecedented feat, Fitzpatrick captures three <i>Battle Royal</i> victories further cementing a legacy early in his career.<br/><br/><b>70, A.D.</b>: In unquestionably one of the most satanic melees ever witnessed, the rivalry that revolutionized the captains match comes to a head when Fitzpatrick rather handily defeats C. Adams to conclude the calendar.<br/><br/><b>76, A.D.</b>: Legend Lauren Stopa is stopped dead in her tracks by Fitzpatrick in a crushing 11-1 slaughter.<br/><br/><b>81, A.D.</b>: Tronolone and Herrera are soundly sent packing against the tandem of Adams and V. Winston in the <i>ECD</i> World's first <i>CREAMation Rules</i> encounter.<br/><br/><b>86, A.D.</b>: In his next war, Adams successfully battles the athletically-blessed Cornero in a contest billed as \"2005 v. 2007\".<br/><br/><b>94, A.D.</b>: Adams puts on a heroic clinic despite his captain's denied quest at grabbing hold the event victory. The Writer believes this event to be a pivotal turning point in the career of the now 17 year-young warrior.<br/><br/><b>100, A.D.</b>: To some, it is still the grandest and greatest of all-time and maybe for one prime reason: the triumphant trio of Pierce, Edwards, and Adams faced off against Tronolone, Letsche, and Fitzpatrick. To date, it is the only time in any <i>ECD</i> era where Adams and Fitzpatrick met in any type of captains confrontation. Additionally, some <i>ECD</i> historians and the omniscient Writer strongly believe that this event placed Adams atop the <i>ECD</i> throne.<br/><br/><b>105, A.D.</b>: In the midst of this period of transition, Fitzpatrick and C. Adams wage war in their long-awaited return bout from the previous calendar in just the third <i>CREAMation Rules</i> collision.<br/><br/><b>111, A.D.</b>: Not to be outdone, Adams once again turns back Cornero in their own sophomore encounter.<br/><br/><b>115, A.D.</b>: Fitzpatrick finally closes the coffin on his enduring feud with C. Adams in this classic three-vs-three war also featuring Londono, Marzarella, Basista, and Avakian.<br/><br/><b>120, A.D.</b>: After being voted by his peers, Adams reigns supreme as the \"Player of the Year\".<br/><br/><b>123, A.D.</b>: Herrera is no match for the powerful Fitzpatrick in this anticipated special attraction.<br/><br/><b>142, A.D.</b>: Fitzpatrick adds another trophy to his collection, winning his 4th <i>Battle Royal</i>. To this day, he holds the record for the second-most number of <i>Battle Royal</i> titles.<br/><br/><b>145, A.D.</b>: Adams however had his own record-shattering agenda by destroying high-ranking general Edwards in a 6-0 blow-out. The victory made Adams the <i>only</i> captain to reach both 5 straight <i>and</i> 9 total wins.<br/><br/><b>169, A.D.</b>: Christmas was never quite the same after this contest when Fitzpatrick hands friend-turned-foe Wolf a brutal season beating.<br/><br/><b>171, A.D.</b>: Fitzpatrick and Tronolone meet only once more, this time to the distinct advantage of Fitzpatrick. The win sent Tronolone packing for nearly 19 months. <br/><br/><b>174, A.D.</b>: In his final captains war to date, Adams, alongside icon Megill, mightily clashed with long-standing, revenge-filled rivals C. Adams and Tronolone. Fitzpatrick, an uncommon ally of the C. Adams-Tronolone coalition, was rather instrumental preventing Adams his own closure.<br/><br/><b>175, A.D.</b>: Both Adams and Fitzpatrick are inducted as charter members of the <i>ECDElite</i> Hall of Fame. <br/><br/><b>184, A.D.</b>: Fitzpatrick - along with the elder Winston and Pierce - compete in a memorable \"Star\" War with renewed rival C. Adams, familiar enemy Edwards, and the cunning youngest Winston. The all-knowing Writer trusts the figurative <i>ECD</i> crown belonged solely to Fitzpatrick; a lengthy, year-long stretch [and beyond]. <br/><br/><b>189, A.D.</b>: Earth-shaking rumblings begin of the never-before-seen, one-on-one clash of titans between Adams and Fitzpatrick.<br/><br/><b>191, A.D.</b>: The announcement of the mega Adams-Fitzpatrick encounter is made official for 192, A.D.<br/><br/><b>192, A.D.</b>: And so it goes .. the coined CLASH OF THE TITANS is carved in stone to host the massive, titanic battle between arguably the two most powerful, imposing forces in all the heavens. <center>________________________________________<wbr/>_______</center><br/><big><b>Adams and Fitzpatrick might just be the very last of their kind. The decline of iconic figures Tronolone and Megill as well as the permanent departure of one C. Adams have dispelled any re-emerging notions of the formerly-known \"Big Three\". The grounds' security system has also experienced its members dwindle leaving Pierce as the sole survivor. Major leaders like Wolf, Stopa, Edwards, Katz, among several others remain as high-ranking officials, but with slightly less experience than their counterparts.<br/><br/>Adams and Fitzpatrick have clearly etched their names in the annals of time and perhaps this one, last effort is all that's left to prove. Through all the mental anguish, physical pain, and in rare cases emotional breakdown, they have each - at one period or another - undeniably ascended to the pinnacle of <i>ECD</i>. But at CLASH OF THE TITANS, only <u>one</u> will be able to plant their flag on Mount Olympus.<br/><br/>There isn't anything more to say or do for the power rests in the bodies, minds, hearts, and souls of the two gods that remain.<br/><br/><center><big>Kevin Adams vs. Kevin Fitzpatrick<br/>CLASH OF THE TITANS | 192 A.D.<br/>August 4, 2012</big></center></b></big><br/><br/><center><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=clash.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"clash\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/clash.jpg\"/></a></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/clash.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}