{
  "id": 115456,
  "url": "https://dodgeball.livejournal.com/115456.html",
  "title": "High Above These HEAVENS",
  "date": "",
  "body_text": "One Crown. One Throne. One Torch .. One Man.\nBACKGROUND INFORMATION\nEast Coast Dodgeball\nCLASH OF THE TITANS\nwas the astounding 192nd event produced within the\nTronolone Era\n. It was the 171st placed on a Saturday and began around 6:30PM.\nCLASH OF THE TITANS will undoubtedly be remembered for the immediate relocation from the classic Wall High School battlegrounds to the original home of\nECD\n,\nOcean Road Park\n. This sudden change came from the unannounced reconstruction of the Wall High School courts, prompting a brief venue search by legendary figures Justin Wolf, Michael \"Sputz\" Krott, John Tronolone, and event captain Kevin Fitzpatrick.\nAs a result, in the extensive, multi-year history of\nECD\n, CLASH OF THE TITANS became just the 23rd Ocean Road Park outing - a first since the\nONE YEAR ANNIVERSARY\nin September 2006!\nMAIN ATTRACTION\nBilled as the event name said, the feverishly-awaited encounter between iconic forces\nKevin Adams\nand\nKevin Fitzpatrick\nshook the very foundations of the Earth. In the epic collision believed by some of\nECD\n's most devoted to once and for all crown the true \"greatest\",\nAdams defeated Fitzpatrick\n.\nAdams' road to victory came rather smooth with both a strong supporting cast and impressive individual performance. Aside from several methodical eliminations on key adversaries, his terminations perpetrated against Fitzpatrick were crucial in the overall outcome. With the incomparable powerhouse out of commission, the Adams brigade was able to gradually pick apart the opposition.\nOf the eight total contests, the initial six were hard-earned by Adams. Fitzpatrick, to his credit, began a successful counterattack to alter the momentum of the epic war. But time ticked away at the resurgence and eventually concluded the mighty clash.\nNotable god-blessed combatants included the likes of the ultra-powerful Grant Cornero, the comedic but strategic Travis Mills, and the high-leaping battle cat Zach Katz.\nSPECIAL OCCASION\nThey recited the words \"I Do\" on the unforgettable evening of May 19, 2012; on August 4, they said their heart-felt \"goodbyes\" to the entire\nECD\nWorld.\nNewlyweds\nChris and Joanice Adams\nmade their final appearance at an\nEast Coast Dodgeball\nextravaganza. The near seven-year veteran and two-year sensation, respectively, received a deserving ovation from the remaining crowd as well as an authentic souvenir in appreciation of their dedication: one pair of prized captains armbands.\nAs the behind-the-scenes Writer, on behalf of everyone at\nECD\n, I - John Tronolone - wish you both the best. You will be missed!\nONLINE EXCLUSIVE!\nBoth leading generals verbally agreed to the match the day of Chris and Joanice's wedding!\nSTATISTICAL SIGNIFICANCE\nThe attendance for the monumental CLASH OF THE TITANS was an impressive\ntwenty-three (23)\n, an exceptional number considering the sudden location change.\nIncluded in the turnout:\n→ 22 men participated meaning that just 1 female was present - Joanice Lima.\n→ Dell Cee, Hadjh Day, Jason Tyson, and Te Ed were the 4 new\nECD\nplayers meaning that a grand total of 497 different people have competed throughout the legendary\nTronolone Years\n.\nAugust 4\nbecame the first date to host three\nECD\nspectaculars:\nDODGEBALL 50\n(2006),\nDODGEBALL NINETY-NINE\n(2007), and now CLASH OF THE TITANS (2012).\nCaptains’ Statistics\nThe K. Adams-Fitzpatrick bout witnessed Adams capture his record-setting 10th win handing Fitzpatrick just his fourth overall loss and his first since the memorable\nCREAMation 3\nagainst Chris Adams in September 2007.\nRecords stand at 10-3-0 (Adams) and 7-4-1 (Fitzpatrick).\n________________________________________\n___________________________\nSEVEN: The Anniversary\nSaturday, September 1, 2012\nWall High School*\n*Subject to Change",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><big><b>One Crown. One Throne. One Torch .. One Man.</b></big></big><br/><br/><li><big><big>BACKGROUND INFORMATION</big></big><br/><i>East Coast Dodgeball</i> <b>CLASH OF THE TITANS</b> was the astounding 192nd event produced within the <i>Tronolone Era</i>. It was the 171st placed on a Saturday and began around 6:30PM.<br/><br/>CLASH OF THE TITANS will undoubtedly be remembered for the immediate relocation from the classic Wall High School battlegrounds to the original home of <i>ECD</i>, <b>Ocean Road Park</b>. This sudden change came from the unannounced reconstruction of the Wall High School courts, prompting a brief venue search by legendary figures Justin Wolf, Michael \"Sputz\" Krott, John Tronolone, and event captain Kevin Fitzpatrick.<br/><br/>As a result, in the extensive, multi-year history of <i>ECD</i>, CLASH OF THE TITANS became just the 23rd Ocean Road Park outing - a first since the <a href=\"http://dodgeball.livejournal.com/2006/09/05/\" target=\"_blank\">ONE YEAR ANNIVERSARY</a> in September 2006!<br/><br/><li><big><big>MAIN ATTRACTION</big></big><br/>Billed as the event name said, the feverishly-awaited encounter between iconic forces <b>Kevin Adams</b> and <b>Kevin Fitzpatrick</b> shook the very foundations of the Earth. In the epic collision believed by some of <i>ECD</i>'s most devoted to once and for all crown the true \"greatest\", <b>Adams defeated Fitzpatrick</b>.<br/><br/>Adams' road to victory came rather smooth with both a strong supporting cast and impressive individual performance. Aside from several methodical eliminations on key adversaries, his terminations perpetrated against Fitzpatrick were crucial in the overall outcome. With the incomparable powerhouse out of commission, the Adams brigade was able to gradually pick apart the opposition. <br/><br/>Of the eight total contests, the initial six were hard-earned by Adams. Fitzpatrick, to his credit, began a successful counterattack to alter the momentum of the epic war. But time ticked away at the resurgence and eventually concluded the mighty clash.<br/><br/>Notable god-blessed combatants included the likes of the ultra-powerful Grant Cornero, the comedic but strategic Travis Mills, and the high-leaping battle cat Zach Katz. <br/><br/><li><big><big>SPECIAL OCCASION</big></big><br/>They recited the words \"I Do\" on the unforgettable evening of May 19, 2012; on August 4, they said their heart-felt \"goodbyes\" to the entire <i>ECD</i> World.<br/><br/>Newlyweds <b>Chris and Joanice Adams</b> made their final appearance at an <i>East Coast Dodgeball</i> extravaganza. The near seven-year veteran and two-year sensation, respectively, received a deserving ovation from the remaining crowd as well as an authentic souvenir in appreciation of their dedication: one pair of prized captains armbands. <br/><br/>As the behind-the-scenes Writer, on behalf of everyone at <i>ECD</i>, I - John Tronolone - wish you both the best. You will be missed!<br/><br/><u>ONLINE EXCLUSIVE!</u><br/>Both leading generals verbally agreed to the match the day of Chris and Joanice's wedding! <br/><br/><li><big><big>STATISTICAL SIGNIFICANCE</big></big><br/>The attendance for the monumental CLASH OF THE TITANS was an impressive <b>twenty-three (23)</b>, an exceptional number considering the sudden location change.<br/><br/>Included in the turnout:<br/>→ 22 men participated meaning that just 1 female was present - Joanice Lima.<br/>→ Dell Cee, Hadjh Day, Jason Tyson, and Te Ed were the 4 new <i>ECD</i> players meaning that a grand total of 497 different people have competed throughout the legendary <i>Tronolone Years</i>.<br/><br/><b>August 4</b> became the first date to host three <i>ECD</i> spectaculars: <a href=\"http://dodgeball.livejournal.com/2006/08/07/\" target=\"_blank\">DODGEBALL 50</a> (2006), <a href=\"http://dodgeball.livejournal.com/2007/08/06/\" target=\"_blank\">DODGEBALL NINETY-NINE</a> (2007), and now CLASH OF THE TITANS (2012). <br/><br/><u>Captains’ Statistics</u><br/>The K. Adams-Fitzpatrick bout witnessed Adams capture his record-setting 10th win handing Fitzpatrick just his fourth overall loss and his first since the memorable <i>CREAMation 3</i> against Chris Adams in September 2007.<br/><br/>Records stand at 10-3-0 (Adams) and 7-4-1 (Fitzpatrick).<br/><br/><center>________________________________________<wbr/>___________________________<br/><br/><br/><big><big><big><b>SEVEN: The Anniversary</b></big><br/>Saturday, September 1, 2012<br/>Wall High School*</big></big><br/><br/><a href=\"http://s483.photobucket.com/albums/rr193/bnl2009/?action=view&amp;current=ECD201209SEVENC.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201209SEVENC.jpg\"/></a><br/><br/><small>*Subject to Change</small></center> </li></li></li></li></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201209SEVENC.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}