{
  "id": 117128,
  "url": "https://dodgeball.livejournal.com/117128.html",
  "title": "NOTHIN' But NET",
  "date": "",
  "body_text": "East Coast Dodgeball\nOCTOBERFEST\nwas the 194th spectacular produced within the\nTronolone Era\n. The event was announced at SEVEN: THE ANNIVERSARY on September 1 and only minimal promotion was released during the following weeks.\nLike the last two outings, the reconstruction of the now beautified Wall High School battlegrounds put a damper on the event location. For OCTOBERFEST however, the alternate first home Ocean Road Park was not selected; instead, nearby Orchard Park served as the host venue for the first time in\nECD\n's historic seven year-plus existence! And trust that this was just one of the many unusual happenings during the three hours ..\nRECORD-BREAKING RECORDS\n◘ During the three-hour duration, an incredible\neighteen (18)\ntotal rounds were completed, higher than any other previous\nECD\nspectacular and a first since March 2007. In fact, only 5 events have ever exceeded 15 (X, XXX-SEVEN, LIX, LX SEVEN, and 79)\n◘ Another ECD first was the unusual but simple\nalphabetical team selection process\n. Players formed a single file based on their first name; from there, the dueling squads were divided equally.\n◘ And, as already mentioned in the introduction, neither Wall High School nor Ocean Road Park were chosen as the host venue. OCTOBERFEST emanated from the illuminated\nOrchard Park\n; one tennis court was used throughout meaning that combatants had to throw and aim considerably higher to get the ball over the net.\nAll in all, it's unlikely anyone went home disappointed. The last minute venue selection coupled with\nECD\n's \"advanced age\" certainly provided yet another long-lasting memory.\nFourteen (14) total competitors\nwere recorded in the night's turnout. Billy Rice, friend of the legendary Grant Cornero, was the only newbie in action.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>East Coast Dodgeball</i> <b>OCTOBERFEST</b> was the 194th spectacular produced within the <i>Tronolone Era</i>. The event was announced at SEVEN: THE ANNIVERSARY on September 1 and only minimal promotion was released during the following weeks.<br/><br/>Like the last two outings, the reconstruction of the now beautified Wall High School battlegrounds put a damper on the event location. For OCTOBERFEST however, the alternate first home Ocean Road Park was not selected; instead, nearby Orchard Park served as the host venue for the first time in <i>ECD</i>'s historic seven year-plus existence! And trust that this was just one of the many unusual happenings during the three hours ..<br/><br/><big><big>RECORD-BREAKING RECORDS</big></big><br/>◘ During the three-hour duration, an incredible <b>eighteen (18)</b> total rounds were completed, higher than any other previous <i>ECD</i> spectacular and a first since March 2007. In fact, only 5 events have ever exceeded 15 (X, XXX-SEVEN, LIX, LX SEVEN, and 79)<br/><br/>◘ Another ECD first was the unusual but simple <b>alphabetical team selection process</b>. Players formed a single file based on their first name; from there, the dueling squads were divided equally.<br/><br/>◘ And, as already mentioned in the introduction, neither Wall High School nor Ocean Road Park were chosen as the host venue. OCTOBERFEST emanated from the illuminated <b>Orchard Park</b>; one tennis court was used throughout meaning that combatants had to throw and aim considerably higher to get the ball over the net.<br/><br/><center><a href=\"http://s483.beta.photobucket.com/user/bnl2009/library/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201210OctoberFestX.jpg\"/></a></center><br/>All in all, it's unlikely anyone went home disappointed. The last minute venue selection coupled with <i>ECD</i>'s \"advanced age\" certainly provided yet another long-lasting memory. <br/><br/><b>Fourteen (14) total competitors</b> were recorded in the night's turnout. Billy Rice, friend of the legendary Grant Cornero, was the only newbie in action. </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201210OctoberFestX.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}