{
  "id": 117852,
  "url": "https://dodgeball.livejournal.com/117852.html",
  "title": "Winner Take 'W'ALL Of It",
  "date": "",
  "body_text": "EVENT BACKGROUND\nWINNER TAKE WALL was the astounding 197th\nEast Coast Dodgeball\nevent produced within the Tronolone Era. The makings of the encounter came immediately following the conclusion of the previous event, WALKING DEAD.\nMAIN EVENT HYPE\nThe event subtitle gave plenty of indication that the massive rivaling factions\nWALL and ALL\nwould indeed clash again. Prior to WINNER TAKE WALL, the dualing armies had competed a total of twelve times, with the hometown Wall Knights capturing eight victories to ALL's four.\nPromotional posters and online articles slated this 197th\nECD\nspectacle to be the 13th - and supposed final - collision between Wall and All. More specifically, the Knights had\nnever\ndefeated the unwelcomed visitors three consecutive occasions in the historic series; All somehow managed to recoup after a pair of setbacks.\nWALL v. ALL 13\nWith a three lead changes, a crucial one-on-one showdown, and the stellar line-up that comprised each army, there isn't any doubt that \"WA13\" produced the greatest battle in this heated war story.\nThrough the first six rounds, the score was at a deadlocked 3. Fitzpatrick, Edwards, Tronolone, Adams, Megill, Pierce, Wolf, among others refused the raise the dreaded white flag.\nThen, in the series' most pivotal moment, the lucky 7th pitted two long-time veterans in a last man standing showdown for personal pride and team bragging rights: Kevin Megill against Justin Wolf. Trust that it wasn't an easy task for either\nECDElitist\nto eliminate the other. The southpaw Megill had even begun throwing at near full-speed, a site not witnessed since before his unfortunate shoulder injury in September 2010. The hungry Wolf wouldn't show any remorse, and after a nail-biting battle, the 2011 Hall Of Fame inductee's bulletball was the final blow. Wall had regained the advantage and, despite an incredible effort by their opposition, never relinquished the lead.\nWALL: 1, 3, 6, 7, 9, 11\n(6)\nALL: 2, 4, 5, 8, 10\n(5)\nRECORDS & AFTERMATH\n◘ Attendance for WINNER TAKE WALL was a\nseventeen (17)\nstrong. Two new competitors were included in the turnout: Katrina Petrovich and Samuel Moss.\n◘ Because of the Megill-Wolf showdown, both men have agreed to face in a one-on-one captains confrontation at the next\nECD\npresentation, MAYN EVENT. Shockingly,\nCREAMation Rules\nwill be in effect.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201304WinnerTakeAllD_zps38651fbc.jpg\" vspace=\"3\"><big><big>EVENT BACKGROUND</big></big><br/>WINNER TAKE WALL was the astounding 197th <i>East Coast Dodgeball</i> event produced within the Tronolone Era. The makings of the encounter came immediately following the conclusion of the previous event, WALKING DEAD.<br/><br/><big><big>MAIN EVENT HYPE</big></big><br/>The event subtitle gave plenty of indication that the massive rivaling factions <b>WALL and ALL</b> would indeed clash again. Prior to WINNER TAKE WALL, the dualing armies had competed a total of twelve times, with the hometown Wall Knights capturing eight victories to ALL's four.<br/><br/>Promotional posters and online articles slated this 197th <i>ECD</i> spectacle to be the 13th - and supposed final - collision between Wall and All. More specifically, the Knights had <i>never</i> defeated the unwelcomed visitors three consecutive occasions in the historic series; All somehow managed to recoup after a pair of setbacks.<br/><br/><big><big>WALL v. ALL 13</big></big><br/>With a three lead changes, a crucial one-on-one showdown, and the stellar line-up that comprised each army, there isn't any doubt that \"WA13\" produced the greatest battle in this heated war story.<br/><br/>Through the first six rounds, the score was at a deadlocked 3. Fitzpatrick, Edwards, Tronolone, Adams, Megill, Pierce, Wolf, among others refused the raise the dreaded white flag.<br/><br/>Then, in the series' most pivotal moment, the lucky 7th pitted two long-time veterans in a last man standing showdown for personal pride and team bragging rights: Kevin Megill against Justin Wolf. Trust that it wasn't an easy task for either <i>ECDElitist</i> to eliminate the other. The southpaw Megill had even begun throwing at near full-speed, a site not witnessed since before his unfortunate shoulder injury in September 2010. The hungry Wolf wouldn't show any remorse, and after a nail-biting battle, the 2011 Hall Of Fame inductee's bulletball was the final blow. Wall had regained the advantage and, despite an incredible effort by their opposition, never relinquished the lead.<br/><br/>WALL: 1, 3, 6, 7, 9, 11 <i>(6)</i><br/>ALL: 2, 4, 5, 8, 10 <i>(5)</i><br/><br/><big><big>RECORDS &amp; AFTERMATH</big></big><br/>◘ Attendance for WINNER TAKE WALL was a <u>seventeen (17)</u> strong. Two new competitors were included in the turnout: Katrina Petrovich and Samuel Moss.<br/>◘ Because of the Megill-Wolf showdown, both men have agreed to face in a one-on-one captains confrontation at the next <i>ECD</i> presentation, MAYN EVENT. Shockingly, <i>CREAMation Rules</i> will be in effect.<br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/ECD201305MaynEventA_zps5885b901.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo ECD201305MaynEventA_zps5885b901.jpg\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201305MaynEventA_zps5885b901.jpg\"/></a></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201304WinnerTakeAllD_zps38651fbc.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201305MaynEventA_zps5885b901.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}