{
  "id": 118197,
  "url": "https://dodgeball.livejournal.com/118197.html",
  "title": "MEGILL + WOLF = CREAMation 12",
  "date": "",
  "body_text": "What!? Why? How? Perhaps\nECD\n's biggest trio of questions, all related to the most anticipated\nCREAMation Rules\ncontest, well, ever!\nHow did these two icons -\nMegill and Wolf\n- come together? What made each accept the blinding stipulation?\nHere's the exclusive, behind-the-scenes look at the \"pie in the eye\" encounter the\nECD\nWorld is buzzing over.\nâ\u0096¬ The Lone\nElitists\nWinston, Tronolone, DiBuccio, Adams, Letsche, and the rest of the all-star cast within the\nECDElite\nHall of Fame have swallowed their pride to compete in this type of situation. It's no easy task; the eyes of\nECD\nare intently watching and the cameras are constantly rolling, especially in the agony of defeat.\nBut even with all that unmeasurable extra pressure, every\nECDElitist\nwho have captained a team more than five separate times have participated minimally once in the sticky stipulation.. except for Megill and Wolf. Both legends had previously, and emphatically, declined the added ingredient on several different occasions until now.\nâ\u0096¬ There's Just Something Personal About All Of This\nOne of\nECD\n's most forgotten, but critical collisions occured in December 2007 at DODGEBALL 119. That night, Megill vanguished the upstart Wolf in what has remained the only captains match-up between the two warriors. Admittedly the contest had little hype other than \"the year-end finale,\" but Wolf certainly hasn't erased it from his memory.\nThroughout the Wall-All wars of years past, their quiet rivalry rarely escalated to its boiling point. But that all changed at WINNER TAKE WALL in April 2013 when, during a pivotal mano-e-mano showdown, Wolf fired the final shot upon his left-handed adversary to lead the Knights to the deciding Game 7 victory. Megill had had enough; now they come to blows.\nâ\u0096¬ The Verbal Contractual Agreement\nEn route to\nECD\n's DODGEBOWL 200, The Writer has vowed to produce the game's most wanted match-ups during this homestretch of extravaganzas. One can only imagine the amount of effort and time it took convincing either combatant to accept, and rightfully so. But persistence paid off and will again on May 25, 2013.\nThrough countless texts and two very important phone conversations, both Megill and Wolf reluctantly agreed to the MAYN EVENT main event. And trust that it's indeed a double \"main event\" because the physical clash between these legendary figures will be equally as awaited as its resulting aftermath.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big>What!? Why? How? Perhaps <i>ECD</i>'s biggest trio of questions, all related to the most anticipated <i>CREAMation Rules</i> contest, well, ever!<br/><br/>How did these two icons - <b>Megill and Wolf</b> - come together? What made each accept the blinding stipulation?</big><br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/MAYNEVENTMW_zpsfbf8534c.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo MAYNEVENTMW_zpsfbf8534c.jpg\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/MAYNEVENTMW_zpsfbf8534c.jpg\"/></a></center><br/><br/>Here's the exclusive, behind-the-scenes look at the \"pie in the eye\" encounter the <i>ECD</i> World is buzzing over.<br/><br/><b>â\u0096¬ The Lone <i>Elitists</i></b><br/>Winston, Tronolone, DiBuccio, Adams, Letsche, and the rest of the all-star cast within the <i>ECDElite</i> Hall of Fame have swallowed their pride to compete in this type of situation. It's no easy task; the eyes of <i>ECD</i> are intently watching and the cameras are constantly rolling, especially in the agony of defeat.<br/><br/>But even with all that unmeasurable extra pressure, every <i>ECDElitist</i> who have captained a team more than five separate times have participated minimally once in the sticky stipulation.. except for Megill and Wolf. Both legends had previously, and emphatically, declined the added ingredient on several different occasions until now.<br/><br/><b>â\u0096¬ There's Just Something Personal About All Of This</b><br/>One of <i>ECD</i>'s most forgotten, but critical collisions occured in December 2007 at DODGEBALL 119. That night, Megill vanguished the upstart Wolf in what has remained the only captains match-up between the two warriors. Admittedly the contest had little hype other than \"the year-end finale,\" but Wolf certainly hasn't erased it from his memory.<br/><br/>Throughout the Wall-All wars of years past, their quiet rivalry rarely escalated to its boiling point. But that all changed at WINNER TAKE WALL in April 2013 when, during a pivotal mano-e-mano showdown, Wolf fired the final shot upon his left-handed adversary to lead the Knights to the deciding Game 7 victory. Megill had had enough; now they come to blows.<br/><br/><b>â\u0096¬ The Verbal Contractual Agreement</b><br/>En route to <i>ECD</i>'s DODGEBOWL 200, The Writer has vowed to produce the game's most wanted match-ups during this homestretch of extravaganzas. One can only imagine the amount of effort and time it took convincing either combatant to accept, and rightfully so. But persistence paid off and will again on May 25, 2013.<br/><br/>Through countless texts and two very important phone conversations, both Megill and Wolf reluctantly agreed to the MAYN EVENT main event. And trust that it's indeed a double \"main event\" because the physical clash between these legendary figures will be equally as awaited as its resulting aftermath. <br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/ECD201305MaynEventB_zps94e979c7.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo ECD201305MaynEventB_zps94e979c7.jpg\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/ECD201305MaynEventB_zps94e979c7.jpg\"/></a></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/MAYNEVENTMW_zpsfbf8534c.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/ECD201305MaynEventB_zps94e979c7.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}