{
  "id": 119226,
  "url": "https://dodgeball.livejournal.com/119226.html",
  "title": "",
  "date": "",
  "body_text": "As much as it is the match, it's equally about the match-ups. With so much colorful history, who could possibly fill the coveted DODGEBOWL 200 main event slots and collectively make it work? Well, these carefully selected legends - Kevin Fitzpatrick, Grant Cornero, Diana DiBuccio, John Tronolone, Michael \"Sputz\" Krott, Kevin Adams - have all the assets and experience to create the awe-inspiring atmosphere the ECD Community anxiously awaits. It's undeniably the biggest showdown on the grandest stage and trust that it will happen just this once ...\n►\nFITZPATRICK\n, CORNERO, DIBUCCIO vs. TRONOLONE, SPUTZ,\nK. ADAMS\nECD\nhistorians have narrowed it down to these iconic figures. Uncanny power, ability and agility to avoid disaster, and the physical and mental resiliency to keep their engines running. The shiny gold crown and empty throne await one man - who is\nECD\n's greatest warrior?\n► FITZPATRICK,\nCORNERO\n, DIBUCCIO vs. TRONOLONE,\nSPUTZ\n, K. ADAMS\nIt's the unstoppable force against the immovable monster and there's no predicting the outcome of this unearthly clash. Cornero's missile fastball looks to smash through the game's \"hot hands\" catcher as each man comprise the impactful offense and defense of their respective three-person coalitions. Who will prevail in this ultimate test of might and will?\n► FITZPATRICK, CORNERO,\nDIBUCCIO\nvs.\nTRONOLONE\n, SPUTZ, K. ADAMS\nThey started the journey at the inaugural showdown in September 2005. They've accumulated the highest participation percentage of their peers. They've seen, fought, and beaten the best. Eight glorious years later, all that remains is to meet head-to-head. What will happen when\nECD\n's most recognized faces collide for the first, and last, time ever?\n________________________________________\n_______________________________\nAlliance Breakdown\nFITZPATRICK, CORNERO, and DIBUCCIO have little history to share. Save for the Wall-All struggles throughout the years - Cornero and DiBuccio members of All, Fitzpatrick Wall - it's highly unlikely internal civil war will break out.\nNow TRONOLONE, SPUTZ, and ADAMS do have some documentation; four brutal and perhaps unforgiving confrontations between Tronolone and Adams could possibly raise the tension between the two. They'll obviously have to put those differences aside especially if their physically-imposing ally has anything to say about it.\nOppositional Conflict\n- Founders of their respective entities\nEast Coast Dodgeball\nand its spin-off\nWest Coast Dodgeball\n, Tronolone and Cornero - known to insiders as \"The Writer\" and \"The Scribe\" - will finally meet for the very first time ever.\n- As the league's self-appointed referees, Sputz and DiBuccio will undoubtedly keep a close eye during each and every play. The outspoken opponents may end up screaming at each other! But don't let the mouths do the talking; they're arguably the best male-female catchers of all-time.\n- The Fitzpatrick-Tronolone wars stretch as far back as 2005, with bouts at DODGEBALL 35 in April 2006 and DODGEBALL 171 in January 2009. Ironically, Tronolone and Fitzpatrick were co-captains at the initial centennial celebration, DODGEBALL 100, a match they eventually lost.\n- Billed as \"2005 vs. 2007\", Cornero vs. Adams was a main attraction during the 2007 calendar. They collided at DODGEBALL 86 in May and DODGEBALL CX1 in November.\n- Lastly and most importantly, Fitzpatrick and Adams have met twice before and both times in the month of August: 2007 at\nECD\n's mega DODGEBALL 100 as part of the first-ever six-person squads and 2012 at DODGEBALL 192:\nClash of the Titans\n.\n________________________________________\n_______________________________\nThe stage is set, the rivals in place, and the end result awaits. There's no turning back now, and no tomorrow.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>As much as it is the match, it's equally about the match-ups. With so much colorful history, who could possibly fill the coveted DODGEBOWL 200 main event slots and collectively make it work? Well, these carefully selected legends - Kevin Fitzpatrick, Grant Cornero, Diana DiBuccio, John Tronolone, Michael \"Sputz\" Krott, Kevin Adams - have all the assets and experience to create the awe-inspiring atmosphere the ECD Community anxiously awaits. It's undeniably the biggest showdown on the grandest stage and trust that it will happen just this once ...</i> <br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/c5618e28-9633-4d1f-845d-463be3960ed4_zps03e3dc76.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo c5618e28-9633-4d1f-845d-463be3960ed4_zps03e3dc76.jpg\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/c5618e28-9633-4d1f-845d-463be3960ed4_zps03e3dc76.jpg\"/></a> </center><br/><br/><big>► <b>FITZPATRICK</b>, CORNERO, DIBUCCIO vs. TRONOLONE, SPUTZ, <b>K. ADAMS</b><br/><i>ECD</i> historians have narrowed it down to these iconic figures. Uncanny power, ability and agility to avoid disaster, and the physical and mental resiliency to keep their engines running. The shiny gold crown and empty throne await one man - who is <i>ECD</i>'s greatest warrior?<br/><br/>► FITZPATRICK, <b>CORNERO</b>, DIBUCCIO vs. TRONOLONE, <b>SPUTZ</b>, K. ADAMS<br/>It's the unstoppable force against the immovable monster and there's no predicting the outcome of this unearthly clash. Cornero's missile fastball looks to smash through the game's \"hot hands\" catcher as each man comprise the impactful offense and defense of their respective three-person coalitions. Who will prevail in this ultimate test of might and will?<br/><br/>► FITZPATRICK, CORNERO, <b>DIBUCCIO</b> vs. <b>TRONOLONE</b>, SPUTZ, K. ADAMS<br/>They started the journey at the inaugural showdown in September 2005. They've accumulated the highest participation percentage of their peers. They've seen, fought, and beaten the best. Eight glorious years later, all that remains is to meet head-to-head. What will happen when <i>ECD</i>'s most recognized faces collide for the first, and last, time ever?</big><br/><center>________________________________________<wbr/>_______________________________</center><br/><u>Alliance Breakdown</u><br/>FITZPATRICK, CORNERO, and DIBUCCIO have little history to share. Save for the Wall-All struggles throughout the years - Cornero and DiBuccio members of All, Fitzpatrick Wall - it's highly unlikely internal civil war will break out.<br/><br/>Now TRONOLONE, SPUTZ, and ADAMS do have some documentation; four brutal and perhaps unforgiving confrontations between Tronolone and Adams could possibly raise the tension between the two. They'll obviously have to put those differences aside especially if their physically-imposing ally has anything to say about it.<br/><br/><u>Oppositional Conflict</u><br/>- Founders of their respective entities <i>East Coast Dodgeball</i> and its spin-off <i>West Coast Dodgeball</i>, Tronolone and Cornero - known to insiders as \"The Writer\" and \"The Scribe\" - will finally meet for the very first time ever.<br/>- As the league's self-appointed referees, Sputz and DiBuccio will undoubtedly keep a close eye during each and every play. The outspoken opponents may end up screaming at each other! But don't let the mouths do the talking; they're arguably the best male-female catchers of all-time.<br/>- The Fitzpatrick-Tronolone wars stretch as far back as 2005, with bouts at DODGEBALL 35 in April 2006 and DODGEBALL 171 in January 2009. Ironically, Tronolone and Fitzpatrick were co-captains at the initial centennial celebration, DODGEBALL 100, a match they eventually lost.<br/>- Billed as \"2005 vs. 2007\", Cornero vs. Adams was a main attraction during the 2007 calendar. They collided at DODGEBALL 86 in May and DODGEBALL CX1 in November.<br/>- Lastly and most importantly, Fitzpatrick and Adams have met twice before and both times in the month of August: 2007 at <i>ECD</i>'s mega DODGEBALL 100 as part of the first-ever six-person squads and 2012 at DODGEBALL 192: <i>Clash of the Titans</i>.<br/><center>________________________________________<wbr/>_______________________________</center><br/><big>The stage is set, the rivals in place, and the end result awaits. There's no turning back now, and no tomorrow.<br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/cd5a9641-ff38-4393-a833-bad9f0e66fdd_zpse7ca6e71.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo cd5a9641-ff38-4393-a833-bad9f0e66fdd_zpse7ca6e71.jpg\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/cd5a9641-ff38-4393-a833-bad9f0e66fdd_zpse7ca6e71.jpg\"/></a></center></big> </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/c5618e28-9633-4d1f-845d-463be3960ed4_zps03e3dc76.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/cd5a9641-ff38-4393-a833-bad9f0e66fdd_zpse7ca6e71.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}