{
  "id": 119520,
  "url": "https://dodgeball.livejournal.com/119520.html",
  "title": "It All Comes Down To THIS",
  "date": "",
  "body_text": "I was 20 when I first started this foam football-filled, 12-person gathering. An astronomical 199 events, 508 participants, and 8 full calendars later, I never thought the journey would come to\nthis\n..\nThe MAIN EVENT: Colossal 3 vs. 3!\nSix household names we've all come to befriend and respect. And in that glorious spotlight each helped create, they square off one last time:\nJohn Tronolone, Michael \"Sputz\", Kevin Adams vs. Kevin Fitzpatrick, Grant Cornero, Diana DiBuccio\n. No turning back, no tomorrow: this is your mega DODGEBOWL 200 main event.\n\"Make A Change\" For ALZHEIMER'S!\nECD\nwill give back yet again and with your help, we can really make a change. As part of Sunrise Senior Living of Wall's annual \"Walk To End Alzheimer's\" fund, I'm simply asking for any coins you would like to donate to help this great cause. Every penny collected will go directly to such!\nSMILE For the CAMERA!\nTrust that I only want the best and that's exactly what I hired. Founder of\nMichelle Amy Photography\nand\nECD\nlegend in her own right, Michelle Mullins, will be on hand to capture the action and excitement of the multi-hour, once-in-a-lifetime spectacle. Thank you Michelle!\nWinner-Take-All: RIMSHOT CONTEST\nThe \"super\" centennial secondary contest will feature the return of the classic Rimshot Contest. A special prize will be awarded to the champion - good luck to all contestants!\nThe ECDElite: FINAL CLASS\nI've tallied all votes and picked up the personalized awards. Five of\nyou\nreading this will become members of the prestigious\nECDElite\nHall of Fame and I cannot express enough appreciation for your sizable contributions throughout the years.\nEvent EXTRAS!\nA special artifacts table, a kick-ass musical soundtrack everyone will enjoy, and some light food and refreshments round out this stacked extravaganza.\nEast Coast Dodgeball greatly improved my life beyond any number, statistic, or measure. From my current and beloved occupations to the countless lifelong friendships, it has been ever-so rewarding. I believe that even in the tiniest way, it has positively affected your life as well.\nSo for the last time, please come celebrate\nour\ntremendous accomplishment; all of us, together, have made this possible.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i><big>I was 20 when I first started this foam football-filled, 12-person gathering. An astronomical 199 events, 508 participants, and 8 full calendars later, I never thought the journey would come to <u>this</u> ..</big></i><br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/200E1_zpsdcda4f4a.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo 200E1_zpsdcda4f4a.jpg\" border=\"0\" fetchpriority=\"high\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/200E1_zpsdcda4f4a.jpg\"/></a></center><br/><br/><big><big><b>The MAIN EVENT: Colossal 3 vs. 3!</b></big></big><br/>Six household names we've all come to befriend and respect. And in that glorious spotlight each helped create, they square off one last time: <b>John Tronolone, Michael \"Sputz\", Kevin Adams vs. Kevin Fitzpatrick, Grant Cornero, Diana DiBuccio</b>. No turning back, no tomorrow: this is your mega DODGEBOWL 200 main event.<br/><br/><big><big><b>\"Make A Change\" For ALZHEIMER'S!</b></big></big><br/><i>ECD</i> will give back yet again and with your help, we can really make a change. As part of Sunrise Senior Living of Wall's annual \"Walk To End Alzheimer's\" fund, I'm simply asking for any coins you would like to donate to help this great cause. Every penny collected will go directly to such!<br/><br/><big><big><b>SMILE For the CAMERA!</b></big></big><br/>Trust that I only want the best and that's exactly what I hired. Founder of <i>Michelle Amy Photography</i> and <i>ECD</i> legend in her own right, Michelle Mullins, will be on hand to capture the action and excitement of the multi-hour, once-in-a-lifetime spectacle. Thank you Michelle!<br/><br/><big><big><b>Winner-Take-All: RIMSHOT CONTEST</b></big></big><br/>The \"super\" centennial secondary contest will feature the return of the classic Rimshot Contest. A special prize will be awarded to the champion - good luck to all contestants!<br/><br/><big><big><b>The ECDElite: FINAL CLASS</b></big></big><br/>I've tallied all votes and picked up the personalized awards. Five of <i>you</i> reading this will become members of the prestigious <i>ECDElite</i> Hall of Fame and I cannot express enough appreciation for your sizable contributions throughout the years.<br/><br/><big><big><b>Event EXTRAS!</b></big></big> <br/>A special artifacts table, a kick-ass musical soundtrack everyone will enjoy, and some light food and refreshments round out this stacked extravaganza. <br/><br/><center><a href=\"http://s483.photobucket.com/user/bnl2009/media/200E2_zpse644da16.jpg.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\" photo 200E2_zpse644da16.jpg\" border=\"0\" loading=\"lazy\" src=\"https://i483.photobucket.com/albums/rr193/bnl2009/200E2_zpse644da16.jpg\"/></a></center><br/><br/><br/><big><i>East Coast Dodgeball greatly improved my life beyond any number, statistic, or measure. From my current and beloved occupations to the countless lifelong friendships, it has been ever-so rewarding. I believe that even in the tiniest way, it has positively affected your life as well.<br/><br/>So for the last time, please come celebrate <i>our</i> tremendous accomplishment; all of us, together, have made this possible.</i></big> </div>",
  "comment_count_text": "",
  "images": [
    "https://i483.photobucket.com/albums/rr193/bnl2009/200E1_zpsdcda4f4a.jpg",
    "https://i483.photobucket.com/albums/rr193/bnl2009/200E2_zpse644da16.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}