{
  "id": 14909,
  "url": "https://dodgeball.livejournal.com/14909.html",
  "title": ">>> A NEW Chapter",
  "date": "",
  "body_text": "Twenty successful events and now this ...\nThe incredible journey continues as 2006 has arrived. DODGEBALL 21 is the next destination and it will no doubt be a blockbuster. But one cannot forget some of the awesome moments that took place during the second \"season\" of dodgeball. Starting with XONE and ending with 20, \"Season 2\" could go down in history as the most memorable. The weather changed drastically, serious injuries came about, new outstanding players came to the forefront, and more.\nRelive these timeless moments:\nDODGEBALL XIV\nThe first promotional poster not created by John Tronolone is released to the public during the week. Justin Pierce creates an impressive design. Also, player profiles are released just adding to the hype of DODGEBALL XIV, which would see an awesome captains battle between Ben Cotta and Derek Carty.\nDODGEBALL 19\nCaptains Kevin \"Fitz\" and Zach Katz square off. Zach also makes more history when he is nailed in his \"set\" by one Mike \"Sputz\".\nDODGEBALL XONE\nThe success of the first \"season\" kicks off the second in the best way; a brand new attendance record of 33. This night easily starts the \"Era of Devolution\" when captains Kyle Carty and Mike Rozz face off.\nDODGEBALL 17\nSix captains in one night and the debut of \"dark\" dodgeball make this event unforgettable.\nDODGEBALL 20: The ClimaXX\nAwards, the return of the music, injuries, and more close out 2005 with the biggest event of all time.\nDODGEBALL 13\nJim Martin breaks his ankle and the ongoing \"Era of Devolution\" continues with \"The Battle of the Dans\"; Karen vs. Spengeman.\nDODGEBALL X6\nA brand new location, Wall High School, takes effect immediately when the lights at Ocean Road Park are not on. The first ever \"Intergender\" captains match occurs as well when Sara DeCuir takes on Ryan McCrorey.\nDODGEBALL XTWO\nThe second night of the \"Double Header\" that shatters all attendance records before and after it; a gigantic 42.\nDODGEBALL 15\nThe final Ocean Road Park event ever. But it certainly went out with a bang ... Thanks to the Thanksgiving holiday, DODGEBALL 15 has the second highest attendance with an impressive 37. That's not all as the first ever \"V\"shot is recorded when Kristin Driscoll is hit \"below the belt\".\nDODGEBALL 18\nThe night belonged to ladies, most notably Valerie Winston, Lauren Freda, and Diana DiBuccio, all of whom played at their very best.\nThe story will continue once again this Saturday for DODGEBALL 21. Special thanks go to Dan Spengeman who created the design for the event seen below.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> Twenty successful events and now this ... <br/><br/>The incredible journey continues as 2006 has arrived. DODGEBALL 21 is the next destination and it will no doubt be a blockbuster. But one cannot forget some of the awesome moments that took place during the second \"season\" of dodgeball. Starting with XONE and ending with 20, \"Season 2\" could go down in history as the most memorable. The weather changed drastically, serious injuries came about, new outstanding players came to the forefront, and more. <br/><br/>Relive these timeless moments:<br/><br/>DODGEBALL XIV<br/>The first promotional poster not created by John Tronolone is released to the public during the week. Justin Pierce creates an impressive design. Also, player profiles are released just adding to the hype of DODGEBALL XIV, which would see an awesome captains battle between Ben Cotta and Derek Carty.<br/><br/>DODGEBALL 19<br/>Captains Kevin \"Fitz\" and Zach Katz square off. Zach also makes more history when he is nailed in his \"set\" by one Mike \"Sputz\".<br/><br/>DODGEBALL XONE<br/>The success of the first \"season\" kicks off the second in the best way; a brand new attendance record of 33. This night easily starts the \"Era of Devolution\" when captains Kyle Carty and Mike Rozz face off.<br/><br/>DODGEBALL 17<br/>Six captains in one night and the debut of \"dark\" dodgeball make this event unforgettable.<br/><br/>DODGEBALL 20: The ClimaXX<br/>Awards, the return of the music, injuries, and more close out 2005 with the biggest event of all time.<br/><br/>DODGEBALL 13<br/>Jim Martin breaks his ankle and the ongoing \"Era of Devolution\" continues with \"The Battle of the Dans\"; Karen vs. Spengeman.<br/><br/>DODGEBALL X6<br/>A brand new location, Wall High School, takes effect immediately when the lights at Ocean Road Park are not on. The first ever \"Intergender\" captains match occurs as well when Sara DeCuir takes on Ryan McCrorey.<br/><br/>DODGEBALL XTWO<br/>The second night of the \"Double Header\" that shatters all attendance records before and after it; a gigantic 42.<br/><br/>DODGEBALL 15<br/>The final Ocean Road Park event ever. But it certainly went out with a bang ... Thanks to the Thanksgiving holiday, DODGEBALL 15 has the second highest attendance with an impressive 37. That's not all as the first ever \"V\"shot is recorded when Kristin Driscoll is hit \"below the belt\".<br/><br/>DODGEBALL 18<br/>The night belonged to ladies, most notably Valerie Winston, Lauren Freda, and Diana DiBuccio, all of whom played at their very best.<br/><br/>The story will continue once again this Saturday for DODGEBALL 21. Special thanks go to Dan Spengeman who created the design for the event seen below.<br/><br/><center><img alt=\"Image hosted by Photobucket.com\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D21Promo.jpg\"/></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D21Promo.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}