{
  "id": 28096,
  "url": "https://dodgeball.livejournal.com/28096.html",
  "title": ">>> Season 4 CONCLUSION",
  "date": "",
  "body_text": "The final entry previewing DODGEBALL XL will be a collection of thoughts from anyone associated with dodgeball. It is a way of expressing your views and ideas, sharing memories, and more to the rest of the dodgeball gang. This particular entry is the only one of its kind, as it can and most likely will be updated at any time.\nOne of the most charismatic and likable players starts us off:\n\"Well my favorite memory, being a dodgeball amateur, is playing with the man who works for my mother; the creator of dodgeball in Wall Township himself, Johnny T. Of course there are other memories, but they aren't anywhere as cool as playing with one of my mother's employees!\"\n- GLEN BINGER (Posted May 19th, 2:48am)\n\"There is a long list of fun times and memories. DODGEBALL 20: the overall build-up and hype to it and then finally getting there and getting a feel of what I can still remember to be an incredible atmosphere. At DODGEBALL 30, I couldn't have been happier when my brother Mike participated as living in separate houses has kept us apart for the past year. Behind the 'scenes', DODGEBALL 30 made our bond stronger than ever. My wrist is still hurting from the fall I took at DODGEBALL 38, which I think I might want to get checked out (lol). I'll end my spiel with DODGEBALL DAY 2; I knew then and there that 'this' was going to be around for quite some time.\"\n- JOHN TRONOLONE (Posted 3:02am)\nSend in your responses to Undertaker13yrs@aol.com or send a message via Facebook or MySpace to John Tronolone. Be heard!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> The final entry previewing DODGEBALL XL will be a collection of thoughts from anyone associated with dodgeball. It is a way of expressing your views and ideas, sharing memories, and more to the rest of the dodgeball gang. This particular entry is the only one of its kind, as it can and most likely will be updated at any time. <br/><br/>One of the most charismatic and likable players starts us off:<br/><br/>\"Well my favorite memory, being a dodgeball amateur, is playing with the man who works for my mother; the creator of dodgeball in Wall Township himself, Johnny T. Of course there are other memories, but they aren't anywhere as cool as playing with one of my mother's employees!\"<br/>- GLEN BINGER (Posted May 19th, 2:48am)<br/><br/>\"There is a long list of fun times and memories. DODGEBALL 20: the overall build-up and hype to it and then finally getting there and getting a feel of what I can still remember to be an incredible atmosphere. At DODGEBALL 30, I couldn't have been happier when my brother Mike participated as living in separate houses has kept us apart for the past year. Behind the 'scenes', DODGEBALL 30 made our bond stronger than ever. My wrist is still hurting from the fall I took at DODGEBALL 38, which I think I might want to get checked out (lol). I'll end my spiel with DODGEBALL DAY 2; I knew then and there that 'this' was going to be around for quite some time.\"<br/>- JOHN TRONOLONE (Posted 3:02am)<br/><br/><i>Send in your responses to Undertaker13yrs@aol.com or send a message via Facebook or MySpace to John Tronolone. Be heard!</i> </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}