{
  "id": 31903,
  "url": "https://dodgeball.livejournal.com/31903.html",
  "title": ">>> UNIONS",
  "date": "",
  "body_text": "DODGEBALL 46 Captains Preview\nAfter a most crucial victory over the resilient Wesley Hebrew at DODGEBALL 45, Diana DiBuccio has certainly created what appears to be a most perfect story.\nSara DeCuir has waited patiently for her chance to claim arguably the top spot in dodgeball, the captain's championship. Little did anyone know however that the champion she would have to face is that of perhaps her arch rival.\nTwo of the most awesome, the most destructive women in the history of dodgeball look to perhaps settle the score once and for all. Diana DiBuccio goes in the champion and without question, looks to leave the same way. But you can bet your ass Sara DeCuir will do whatever she has to to overcome \"The Dribbler\".\nGood friends, Better Enemies: Diana DiBuccio vs. Sara DeCuir at DODGEBALL 46!\nCommon Unions\nOver the past week or so, there has been some quiet talk over the possible formations of stables. A stable, for those unaware, is merely a group of athletes that combine to make a single force.\nBut questions have been raised, and rightfully so.\n1.\n\"What is the point of a stable?\"\n- Many players enjoy teaming with certain people. Some honored \"teams\" would be Chris Adams and Lauren Freda, or the award-winning \"Allied Powers\", Travis Mills and Steve Adams. What a stable would simply ensure is that any player can team with whom they'd want to team with each event.\n2.\n\"How many players should/can form a stable?\"\n- At most, it would be fair to keep stables at a four-person maximum. An example may include \"The Adams Authority\", comprised of Chris, Steve, Tom, and Kevin.\n3.\n\"How can a captain form a team with stables present?\"\n- This is much easier than it seems. Using this week's captains, say that Diana were to choose Kevin Adams as her first pick. Since he is apart of the stable along with his brothers, her first pick is that of ALL four brothers. Obviously, Sara would have to match the number of players in order to make a fair team. She could pick four individual players not in a stable, perhaps two individual players and one two-person stable. (By now, it should be easy to understand.)\n4.\n\"What if a stable member is missing?\"\n- A stable can remain intact for the event obviously, if of course the members themselves want it that way. Say Tom does not show up to an event, but his brothers do. They simply form a three-person stable for the evening.\n5.\n\"Is there any positive to forming a stable?\"\n- This question has several answers.\nA. It can certainly be a way to eliminate the embarrassment of players picked last at each event. If they are in a stable, perhaps that won't happen any longer as they become part of a package deal.\nB. Besides the classic singles feuds, it may also allow for interesting team battles, which have rarely been seen. Close friends Ryan McCrorey and Mike \"Sputz\" may form their own two-person stable and feud with another pair of friends in Dan Turner and Ray Marzarella.\nC. Stables once again ensure that you team with at least three people (of your choosing) on a weekly basis.\nA stable can always break at any given time.\n.........\nSo now that the idea is out, how does it sound? If you like it, consider three of your favorite players, your closest friends, or hell, even you biggest rivals and form your own personalized team!\n\"BE HEARD\" as it says in the right hand corner of the entry is exactly what is needed. Express your opinion on the above idea.\nDODGEBALL 46 is this Friday, June 30th. Start time is 6:30 at the famous WHS Tennis Courts.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><u>DODGEBALL 46 Captains Preview</u></center><br/>After a most crucial victory over the resilient Wesley Hebrew at DODGEBALL 45, Diana DiBuccio has certainly created what appears to be a most perfect story.<br/><br/>Sara DeCuir has waited patiently for her chance to claim arguably the top spot in dodgeball, the captain's championship. Little did anyone know however that the champion she would have to face is that of perhaps her arch rival. <br/><br/>Two of the most awesome, the most destructive women in the history of dodgeball look to perhaps settle the score once and for all. Diana DiBuccio goes in the champion and without question, looks to leave the same way. But you can bet your ass Sara DeCuir will do whatever she has to to overcome \"The Dribbler\".<br/><br/>Good friends, Better Enemies: Diana DiBuccio vs. Sara DeCuir at DODGEBALL 46!<br/><br/><center><u>Common Unions</u></center><br/>Over the past week or so, there has been some quiet talk over the possible formations of stables. A stable, for those unaware, is merely a group of athletes that combine to make a single force. <br/><br/>But questions have been raised, and rightfully so.<br/><br/><b>1.</b> \"What is the point of a stable?\" <br/>- Many players enjoy teaming with certain people. Some honored \"teams\" would be Chris Adams and Lauren Freda, or the award-winning \"Allied Powers\", Travis Mills and Steve Adams. What a stable would simply ensure is that any player can team with whom they'd want to team with each event.<br/><br/><b>2.</b> \"How many players should/can form a stable?\"<br/>- At most, it would be fair to keep stables at a four-person maximum. An example may include \"The Adams Authority\", comprised of Chris, Steve, Tom, and Kevin.<br/><br/><b>3.</b> \"How can a captain form a team with stables present?\"<br/>- This is much easier than it seems. Using this week's captains, say that Diana were to choose Kevin Adams as her first pick. Since he is apart of the stable along with his brothers, her first pick is that of ALL four brothers. Obviously, Sara would have to match the number of players in order to make a fair team. She could pick four individual players not in a stable, perhaps two individual players and one two-person stable. (By now, it should be easy to understand.)<br/><br/><b>4.</b> \"What if a stable member is missing?\"<br/>- A stable can remain intact for the event obviously, if of course the members themselves want it that way. Say Tom does not show up to an event, but his brothers do. They simply form a three-person stable for the evening.<br/><br/><b>5.</b> \"Is there any positive to forming a stable?\"<br/>- This question has several answers. <br/><br/>A. It can certainly be a way to eliminate the embarrassment of players picked last at each event. If they are in a stable, perhaps that won't happen any longer as they become part of a package deal. <br/><br/>B. Besides the classic singles feuds, it may also allow for interesting team battles, which have rarely been seen. Close friends Ryan McCrorey and Mike \"Sputz\" may form their own two-person stable and feud with another pair of friends in Dan Turner and Ray Marzarella.<br/><br/>C. Stables once again ensure that you team with at least three people (of your choosing) on a weekly basis.<br/><br/>A stable can always break at any given time.<br/><br/>.........<br/><br/>So now that the idea is out, how does it sound? If you like it, consider three of your favorite players, your closest friends, or hell, even you biggest rivals and form your own personalized team!<br/><br/>\"BE HEARD\" as it says in the right hand corner of the entry is exactly what is needed. Express your opinion on the above idea. <br/><br/>DODGEBALL 46 is this Friday, June 30th. Start time is 6:30 at the famous WHS Tennis Courts. </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}