{
  "id": 40028,
  "url": "https://dodgeball.livejournal.com/40028.html",
  "title": ">>> FEMALE TITANS: Part II",
  "date": "",
  "body_text": "DODGEBALL LVIII Open Challenge!\nIt has been reported that one of the twelve titans on the poster has issued an open challenge to anyone on the current roster for a one-on-one captains showdown this coming weekend! There will be plenty more on this story as it develops. Check back soon!\nIt is now time for the remaining six female titans to take center stage right here on the dodgeball website.\nLAUREN STOPA\nShe is perhaps best known for underestimating her abilities, yet has succeeded on a number of occasions. Lauren Stopa is as fierce as they come, establishing an amazing legacy for herself. It wasn't long ago at DODGEBALL FIFTY-TWO where she was doubting her skills yet again. But on that night she scored several rimshots and earned many eliminations by night's end. Lauren Stopa has accomplished plenty in her dodgeball career, whether through the horrendous winter months or the warm temperatures of the summer. It's a career that has only gotten better with time.\nLAUREN WINSTON\nLauren is one of few players that have seen it all in the game of dodgeball. She debuted at the inaugural event and to say she hasn't achieved major success would be an understatement. Her skills improved with each passing event, earning the prestigious \"Most Improved Player\" award at DODGEBALL 30. Aside from physical abilities, she is always one to help, most notably in the decorations for DODGEBALL 20 and DODGEBALL 50. Lauren Winston is yet another legendary figure whose efforts, on and off the court, should never go unnoticed.\nMELISSA KERR\nThis is a heavy-hitter right here, arguably the best all-around female ever. Debuting at the incredible DODGEBALL XL in late-May, Melissa has been unstoppable since she arrived, taking the dodgeball world by storm. A powerful arm, pinpoint accuracy, sticky hands, swift dodges, the list just goes on and on. She has proven herself time and again that no matter how old, how large, or how dominant, never deny a woman power as they will fight to the very end. The world of dodgeball would take a crushing blow if Melissa Kerr ever quit.\nDIANA DIBUCCIO\nShe may be the most resilient female in dodgeball history, and for good reason: who stays up at the front more than she? Diana is a dodgeball original, accomplishing everything there is to accomplish in this great sport. She has rivaled with some of the most recognized faces, most notably Justin Pierce, and has succeeded. She is multi-time award winner [as well as her own mother] and a member of the defunct Hall of Fame. To this day, she is the only player to throw an actual dodgeball party. Although she is currently out action, expect her return to be nothing less than spectacular.\nELIZABTH NOGUEIRA\nLiz Nogueira has contributed in a variety of ways. Along with her sister Kathryn, she helped set up at the incomparable DODGEBALL 20, has assisted in the printing of the Dodgeball Excellence Awards, and was the camera-woman behind the infamous DODGEBALL 30 video. Her somewhat competitive nature allowed for her talent to grow, scoring eliminations at various events, catching the almost impossible Rozz-ball due to its unpredictability, and feuding with Mike \"Rozz\" himself, earning runner-up for \"Best Rivalry\" following\nDiana DiBuccio vs. Justin Pierce\n. Though she hasn't partaken in quite some time, her past accolades haven't been neglected.\nVALERIE WINSTON\nAt first she sold herself short in her abilities. But within weeks time, she had become a superior player and still is to this day. With numerous awards to her name, Valerie has come a long way from the days at Ocean Road Park. Her opposition first overlooked her now patented sideline throw, which only allowed for those to fall prey to her strategy. She's feuded with the best, beaten them, and lived to tell about it. Although a premiere player, she has sacrificed her time in a variety of ways, including the illumination of the many \"ten\" events only adding to her Hall of Fame career.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><b><u>DODGEBALL LVIII Open Challenge!</u></b></center><br/>It has been reported that one of the twelve titans on the poster has issued an open challenge to anyone on the current roster for a one-on-one captains showdown this coming weekend! There will be plenty more on this story as it develops. Check back soon!<br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D58Logo.jpg\"/></a><br/><br/>It is now time for the remaining six female titans to take center stage right here on the dodgeball website.</center><br/><u>LAUREN STOPA</u><br/>She is perhaps best known for underestimating her abilities, yet has succeeded on a number of occasions. Lauren Stopa is as fierce as they come, establishing an amazing legacy for herself. It wasn't long ago at DODGEBALL FIFTY-TWO where she was doubting her skills yet again. But on that night she scored several rimshots and earned many eliminations by night's end. Lauren Stopa has accomplished plenty in her dodgeball career, whether through the horrendous winter months or the warm temperatures of the summer. It's a career that has only gotten better with time.<br/><br/><u>LAUREN WINSTON</u><br/>Lauren is one of few players that have seen it all in the game of dodgeball. She debuted at the inaugural event and to say she hasn't achieved major success would be an understatement. Her skills improved with each passing event, earning the prestigious \"Most Improved Player\" award at DODGEBALL 30. Aside from physical abilities, she is always one to help, most notably in the decorations for DODGEBALL 20 and DODGEBALL 50. Lauren Winston is yet another legendary figure whose efforts, on and off the court, should never go unnoticed.<br/><br/><u>MELISSA KERR</u><br/>This is a heavy-hitter right here, arguably the best all-around female ever. Debuting at the incredible DODGEBALL XL in late-May, Melissa has been unstoppable since she arrived, taking the dodgeball world by storm. A powerful arm, pinpoint accuracy, sticky hands, swift dodges, the list just goes on and on. She has proven herself time and again that no matter how old, how large, or how dominant, never deny a woman power as they will fight to the very end. The world of dodgeball would take a crushing blow if Melissa Kerr ever quit. <br/><br/><u>DIANA DIBUCCIO</u><br/>She may be the most resilient female in dodgeball history, and for good reason: who stays up at the front more than she? Diana is a dodgeball original, accomplishing everything there is to accomplish in this great sport. She has rivaled with some of the most recognized faces, most notably Justin Pierce, and has succeeded. She is multi-time award winner [as well as her own mother] and a member of the defunct Hall of Fame. To this day, she is the only player to throw an actual dodgeball party. Although she is currently out action, expect her return to be nothing less than spectacular. <br/><br/><u>ELIZABTH NOGUEIRA</u><br/>Liz Nogueira has contributed in a variety of ways. Along with her sister Kathryn, she helped set up at the incomparable DODGEBALL 20, has assisted in the printing of the Dodgeball Excellence Awards, and was the camera-woman behind the infamous DODGEBALL 30 video. Her somewhat competitive nature allowed for her talent to grow, scoring eliminations at various events, catching the almost impossible Rozz-ball due to its unpredictability, and feuding with Mike \"Rozz\" himself, earning runner-up for \"Best Rivalry\" following <i>Diana DiBuccio vs. Justin Pierce</i>. Though she hasn't partaken in quite some time, her past accolades haven't been neglected.<br/><br/><u>VALERIE WINSTON</u><br/>At first she sold herself short in her abilities. But within weeks time, she had become a superior player and still is to this day. With numerous awards to her name, Valerie has come a long way from the days at Ocean Road Park. Her opposition first overlooked her now patented sideline throw, which only allowed for those to fall prey to her strategy. She's feuded with the best, beaten them, and lived to tell about it. Although a premiere player, she has sacrificed her time in a variety of ways, including the illumination of the many \"ten\" events only adding to her Hall of Fame career. </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D58Logo.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}