{
  "id": 41180,
  "url": "https://dodgeball.livejournal.com/41180.html",
  "title": ">>> ROUND 2",
  "date": "",
  "body_text": "What a showdown it will be when two of the most destructive forces to ever compete go head-to-head in perhaps the most anticipated rematch of all-time,\nCHRIS ADAMS vs. JOHN TRONOLONE\n! Chris defeated his Season 1 nemesis at DODGEBALL 9 and some fifty events later, they once again take center stage ...\nCHRIS ADAMS\n- Chris has a solid singles record of 3 and 0, having defeated some of the most decorated athletes ever, including John himself. His only recorded loss thus far came in the unorthodox team battle at DODGEBALL 50.\nOther Opponents\nDODGEBALL XXVIII; defeated Steve Adams\nDODGEBALL 50; [paired with his brother Tom Adams] lost to Kevin Adams and Steve Adams\nDODGEBALL 53; defeated Derek Carty\nFast Fact!\nChris has defeated the three worst captains in history, whom have suffered a combined 12 total losses.\nJOHN TRONOLONE\n- There has been little luck on John's side having lost 4 times as captain, tying the record. His only win came at the hands of rival Kevin Fitzpatrick at DODGEBALL 35, but John has still yet to conquer another superstar.\nOther Opponents\nDODGEBALL 20; lost to Jim Martin\nDODGEBALL 30; lost to Kevin Megill\nDODGEBALL 35; defeated Kevin Fitzpatrick\nDODGEBALL 49; lost to Kevin Adams\nFast Fact!\nBoth Jim Martin and Kevin Megill remain undefeated captains to this very day. Kevin Adams is arguably the most dominant captain of all-time having secured four consecutive wins during the Summer of 2006.\n--> There will be plenty more in the coming week! Check back for a detailed DODGEBALL 59 preview!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> What a showdown it will be when two of the most destructive forces to ever compete go head-to-head in perhaps the most anticipated rematch of all-time, <b>CHRIS ADAMS vs. JOHN TRONOLONE</b>! Chris defeated his Season 1 nemesis at DODGEBALL 9 and some fifty events later, they once again take center stage ...<br/><br/><u>CHRIS ADAMS</u><br/>- Chris has a solid singles record of 3 and 0, having defeated some of the most decorated athletes ever, including John himself. His only recorded loss thus far came in the unorthodox team battle at DODGEBALL 50.<br/><br/><b>Other Opponents</b><br/>DODGEBALL XXVIII; defeated Steve Adams<br/>DODGEBALL 50; [paired with his brother Tom Adams] lost to Kevin Adams and Steve Adams<br/>DODGEBALL 53; defeated Derek Carty<br/><br/><b>Fast Fact!</b> Chris has defeated the three worst captains in history, whom have suffered a combined 12 total losses.<br/><br/><u>JOHN TRONOLONE</u><br/>- There has been little luck on John's side having lost 4 times as captain, tying the record. His only win came at the hands of rival Kevin Fitzpatrick at DODGEBALL 35, but John has still yet to conquer another superstar.<br/><br/><b>Other Opponents</b><br/>DODGEBALL 20; lost to Jim Martin<br/>DODGEBALL 30; lost to Kevin Megill<br/>DODGEBALL 35; defeated Kevin Fitzpatrick<br/>DODGEBALL 49; lost to Kevin Adams<br/><br/><b>Fast Fact!</b> Both Jim Martin and Kevin Megill remain undefeated captains to this very day. Kevin Adams is arguably the most dominant captain of all-time having secured four consecutive wins during the Summer of 2006.<br/><br/>--&gt; There will be plenty more in the coming week! Check back for a detailed DODGEBALL 59 preview! </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}