{
  "id": 44927,
  "url": "https://dodgeball.livejournal.com/44927.html",
  "title": ">>> INVASION: The Aftermath",
  "date": "",
  "body_text": "How the mighty have fallen ... or have they?\nPond Scum, after a crushing [though unfair] defeat last week at LX3, is apparently asking for more come the 64th dodgeball extravaganza. It is unknown what role they will play come gametime, but you can bet they will be looking to outdo themselves. It is again rumored that several members will be appearing at DODGEBALL LXIV, but what affect will they have on the game? What affect will they have on the players that soundly defeated them one week prior?\nFANTASY WARFARE!!!\nDue to all the confusion surrounding the events of the past week or so, it is again unknown who the captains will be come DODGEBALL LXIV. But it is never a bad idea to think about the possible \"dream matches\" the world has yet to see. Below is a list of 5 captains battles that will ensure an all-around intense and exciting dodgeball event.\n-->\nKevin Fitzpatrick vs. Matt Brown\nIt's perhaps the biggest rivalry in dodgeball today, pitting two legends against each other in the first \"dream match\" listed right on\ndodgeball.livejournal.com\n. For weeks leading up to the colossal DODGEBALL LX, these two were always at each others' throats. The speed and agility of both players have easily made this one of the all-time great feuds not because they trash talk, but because of their many gifted talents. Putting these two warriors as rival-captains can only increase the intensity of an already explosive rivalry.\n-->\nJoe Kelly vs. Kevin Adams\nIt's the first recognized Captain's Champion against the last in what may be the biggest captains war in the entire one year history of dodgeball. Both men have accomplished more than any other competitors in regards to their unmirrored captain careers. They have defeated only the best the game has to offer and it would be a sin for a match of this magnitude not to happen.\nKelly's historic run:\n- defeated Sara DeCuir at DODGEBALL 38\n- defeated Ryan Letsche at DODGEBALL 39\n- defeated Travis Mills at DODGEBALL XL\n- defeated Derek Carty at DODGEBALL 41\nAdams's historic run:\n- defeated Sara DeCuir at DODGEBALL 48\n- defeated John Tronolone at DODGEBALL 49\n- defeated both Tom Adams and Chris Adams at DODGEBALL 50, teaming up with brother Steve.\n- defeated Ryan Letsche at DODGEBALL 51\n-->\nMike Edwards vs. (Anyone)\nDODGEBALL 47 was the beginning of the road for one Mike Edwards. Who could possibly make a good first opponent for the only \"L.A. Dodger\" Award winner? Finding someone of his caliber won't be an easy task, but rest assured, it'll be a war for the ages.\n-->\nKevin Megill vs. Chris Adams\nAs the great Jim Ross from WWE RAW would say, \"This one would damn sure be a slobber-knocker\". Arguably, the two most legendary and recognized figures to ever compete have never once went toe-to-toe in a classic captains confrontation. Their credentials speak for themself as both are multi-time award winners, have won numerous captains matches, and are just damn good all-around dodgeball megastars. It's a true \"legend vs. legend\" type of match which only a special occasion could host, likely a ten-event.\n-->\nZach Katz vs. Justin Pierce\nYet again, another huge match that would make headlines across town. To date, they are the only two \"Painball Powerhouse\" Award winners, and rightfully so. On one side, you have a deflection perfectionist in Zach Katz. On the other, you have the trash-talking Justin Pierce, who's always ready for a fight. Though neither of them have had the greatest luck as captain, it won't be hard to assume this match a true classic.\nWill the dodgeball world witness and experience one of the above matches at DODGEBALL LXIV?\nFind out live on November 18 at Wall High School!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> How the mighty have fallen ... or have they? <br/><br/>Pond Scum, after a crushing [though unfair] defeat last week at LX3, is apparently asking for more come the 64th dodgeball extravaganza. It is unknown what role they will play come gametime, but you can bet they will be looking to outdo themselves. It is again rumored that several members will be appearing at DODGEBALL LXIV, but what affect will they have on the game? What affect will they have on the players that soundly defeated them one week prior? <br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D64LogoD1.jpg\"/></a></center><br/><b>FANTASY WARFARE!!!</b><br/>Due to all the confusion surrounding the events of the past week or so, it is again unknown who the captains will be come DODGEBALL LXIV. But it is never a bad idea to think about the possible \"dream matches\" the world has yet to see. Below is a list of 5 captains battles that will ensure an all-around intense and exciting dodgeball event.<br/><br/>--&gt; <u>Kevin Fitzpatrick vs. Matt Brown</u> It's perhaps the biggest rivalry in dodgeball today, pitting two legends against each other in the first \"dream match\" listed right on <i>dodgeball.livejournal.com</i>. For weeks leading up to the colossal DODGEBALL LX, these two were always at each others' throats. The speed and agility of both players have easily made this one of the all-time great feuds not because they trash talk, but because of their many gifted talents. Putting these two warriors as rival-captains can only increase the intensity of an already explosive rivalry.<br/><br/>--&gt; <u>Joe Kelly vs. Kevin Adams</u> It's the first recognized Captain's Champion against the last in what may be the biggest captains war in the entire one year history of dodgeball. Both men have accomplished more than any other competitors in regards to their unmirrored captain careers. They have defeated only the best the game has to offer and it would be a sin for a match of this magnitude not to happen.<br/><br/>Kelly's historic run: <br/>- defeated Sara DeCuir at DODGEBALL 38<br/>- defeated Ryan Letsche at DODGEBALL 39<br/>- defeated Travis Mills at DODGEBALL XL<br/>- defeated Derek Carty at DODGEBALL 41<br/><br/>Adams's historic run:<br/>- defeated Sara DeCuir at DODGEBALL 48<br/>- defeated John Tronolone at DODGEBALL 49<br/>- defeated both Tom Adams and Chris Adams at DODGEBALL 50, teaming up with brother Steve.<br/>- defeated Ryan Letsche at DODGEBALL 51<br/><br/>--&gt; <u>Mike Edwards vs. (Anyone)</u> DODGEBALL 47 was the beginning of the road for one Mike Edwards. Who could possibly make a good first opponent for the only \"L.A. Dodger\" Award winner? Finding someone of his caliber won't be an easy task, but rest assured, it'll be a war for the ages.<br/><br/>--&gt; <u>Kevin Megill vs. Chris Adams</u> As the great Jim Ross from WWE RAW would say, \"This one would damn sure be a slobber-knocker\". Arguably, the two most legendary and recognized figures to ever compete have never once went toe-to-toe in a classic captains confrontation. Their credentials speak for themself as both are multi-time award winners, have won numerous captains matches, and are just damn good all-around dodgeball megastars. It's a true \"legend vs. legend\" type of match which only a special occasion could host, likely a ten-event.<br/><br/>--&gt; <u>Zach Katz vs. Justin Pierce</u> Yet again, another huge match that would make headlines across town. To date, they are the only two \"Painball Powerhouse\" Award winners, and rightfully so. On one side, you have a deflection perfectionist in Zach Katz. On the other, you have the trash-talking Justin Pierce, who's always ready for a fight. Though neither of them have had the greatest luck as captain, it won't be hard to assume this match a true classic.<br/><br/><b>Will the dodgeball world witness and experience one of the above matches at DODGEBALL LXIV?<br/>Find out live on November 18 at Wall High School!</b><br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D64LogoA1.jpg\"/></a></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D64LogoD1.jpg",
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D64LogoA1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}