{
  "id": 45453,
  "url": "https://dodgeball.livejournal.com/45453.html",
  "title": ">>> DREAMS",
  "date": "",
  "body_text": "Continuing with the trend from the LXIV final preview, let's look further into some of dodgeball's \"dream matches\".\n--\nMike \"Sputz\" Krott vs. (Anyone)\nThis is the real \"dream match\" right here. Those inside the dodgeball world have only imagined what it would be like if the catching-machine lead a team into battle. You will always find him on the \"Most Times Played\" list and despite the accolade, has never once formed his own alliance. If that day comes, it'll be one of the biggest shockers in the history of the sport. The question is, will it ever happen?\n--\nRob Avakian vs. (Anyone)\nThe legend known as \"Sharp\" has never once been captain despite an impressive career beginning at October 2005's, DODGEBALL 8. One of the most resilient, charismatic, and certainly intense players you'll ever meet might be looking for that perfect match. Who will this legend meet in his first captains showdown?\n--\nMelissa Kerr vs. Kerrin Marchese\nThere is a plethera of other females right for the job. So what makes these two stand out the most? They both debuted at a ten-event. Melissa debuted at an octane-filled DODGEBALL XL while Kerrin at the \"Superbowl of Dodgeball\", DODGEBALL LX. Much like Chris Adams vs. Kevin Megill, it's a \"legend vs. legend\" match-up as two of the most athletically gifted female titans go one-on-one. It's a clash of the \"Ten-Event Titans\".\n--\nJohn Tronolone vs. Diana DiBuccio\nThey debuted at DODGEBALL DAY 1 and are the only two from that historical encounter to remain regulars of the game. John has not once missed an event, having accomplished just about everything there is to accomplish in the great sport of dodgeball. He has fought and/or teamed with every single player that ever set foot on both the Ocean Road Park basketball courts and Wall High School tennis courts. Diana, only due to a serious injury suffered in middle of Season 6, is rarely out of action. She too has earned legendary status, becoming one of the most dominant women in the history of the game. It would be a real treat if these two went at it; a true clash of champions.\n--\nTom Adams vs. Kurt Gassner II\nThe last and final \"dream match\" pits two superb all-stars in a colossal return match. At DODGEBALL 15, all-around megastar Tom Adams defeated arguably the greatest semi-regular ever, the intense Kurt Gassner. With the forthcoming DODGEBALL LXV, how fitting it would be if these two fought one more time in their second battle exactly 364 days later. Both have won award after award, eliminated countless competitors, and have shown tremedous talents that truly make them two of the elite. Yet again, another legendary match-up surely to increase the hype and build-up for an event.\nThis is the final stop in the month of November.\nLast year's DODGEBALL 15 almost broke the attendance record; an astounding 37 competitors.\nBe sure to attend DODGEBALL LXV for the 2nd annual Thankgiving dodgeball spectacular!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> Continuing with the trend from the LXIV final preview, let's look further into some of dodgeball's \"dream matches\".<br/><br/>-- <u>Mike \"Sputz\" Krott vs. (Anyone)</u> This is the real \"dream match\" right here. Those inside the dodgeball world have only imagined what it would be like if the catching-machine lead a team into battle. You will always find him on the \"Most Times Played\" list and despite the accolade, has never once formed his own alliance. If that day comes, it'll be one of the biggest shockers in the history of the sport. The question is, will it ever happen?<br/><br/>-- <u>Rob Avakian vs. (Anyone)</u> The legend known as \"Sharp\" has never once been captain despite an impressive career beginning at October 2005's, DODGEBALL 8. One of the most resilient, charismatic, and certainly intense players you'll ever meet might be looking for that perfect match. Who will this legend meet in his first captains showdown?<br/><br/>-- <u>Melissa Kerr vs. Kerrin Marchese</u> There is a plethera of other females right for the job. So what makes these two stand out the most? They both debuted at a ten-event. Melissa debuted at an octane-filled DODGEBALL XL while Kerrin at the \"Superbowl of Dodgeball\", DODGEBALL LX. Much like Chris Adams vs. Kevin Megill, it's a \"legend vs. legend\" match-up as two of the most athletically gifted female titans go one-on-one. It's a clash of the \"Ten-Event Titans\".<br/><br/>-- <u>John Tronolone vs. Diana DiBuccio</u> They debuted at DODGEBALL DAY 1 and are the only two from that historical encounter to remain regulars of the game. John has not once missed an event, having accomplished just about everything there is to accomplish in the great sport of dodgeball. He has fought and/or teamed with every single player that ever set foot on both the Ocean Road Park basketball courts and Wall High School tennis courts. Diana, only due to a serious injury suffered in middle of Season 6, is rarely out of action. She too has earned legendary status, becoming one of the most dominant women in the history of the game. It would be a real treat if these two went at it; a true clash of champions.<br/><br/>-- <u>Tom Adams vs. Kurt Gassner II</u> The last and final \"dream match\" pits two superb all-stars in a colossal return match. At DODGEBALL 15, all-around megastar Tom Adams defeated arguably the greatest semi-regular ever, the intense Kurt Gassner. With the forthcoming DODGEBALL LXV, how fitting it would be if these two fought one more time in their second battle exactly 364 days later. Both have won award after award, eliminated countless competitors, and have shown tremedous talents that truly make them two of the elite. Yet again, another legendary match-up surely to increase the hype and build-up for an event.<br/><br/><b>This is the final stop in the month of November.<br/>Last year's DODGEBALL 15 almost broke the attendance record; an astounding 37 competitors.<br/>Be sure to attend DODGEBALL LXV for the 2nd annual Thankgiving dodgeball spectacular!</b> </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}