{
  "id": 45907,
  "url": "https://dodgeball.livejournal.com/45907.html",
  "title": ">>> Thanksgiving SLAUGHTER",
  "date": "",
  "body_text": "It's the very middle of Season 7 and the surprises and shocks are not yet scarce. Last week's DODGEBALL LXIV saw the return of\nDark Dodgeball\n, one of the lesser known gametypes if you will. On top of that, not one Pond Scum member attended despite a heavily rumored second challenge. What could have possibly happened at DODGEBALL LXV you ask?\nThe Story of LXV\nThe dodgeball world is in a state of turmoil.\nThe lamppost played a major part yet again at LXV, as the whole night was based on its three small yellow lights. The front courts was where the action was as for 3 hours, players exchanged fire in one of the most violent matches ever witnessed.\nAs for Pond Scum, for the second week running, they no-showed despite making a bold challenge right here on\ndodgeball.livejournal.com\n. It only furthered the whirlwind of thoughts inside the minds of dodgeball's finest.\nLike its predecessor, DODGEBALL LXV is yet another unsolved mystery in the long, winding road known as dodgeball.\nTeam SASCHA vs. Team JOEY\nThis captains confrontation brought along two new captains much like LXIV did with the female frenzy pitting Kathryn Nogueira against Aimee Savoth.\nEven with the tennis lights out for the entire duration of LXV, the action remained at its true finest. Neighbors in the surrounding area perhaps heard and felt some of the commotion as LXV featured easily some of the hardest shots and hits ever witnessed. The dreaded bulletballs certainly added to the mayhem as powerhouse throwers like Chris Adams and Kevin Megill rifled balls all night long in an effort to defeat\nand\ndestroy their opponents.\nThe match itself was a squash in favor of new sensation Sascha Basista, defeating debuting star Joey Smalls, 5 to 1.\nThe 65th Records\n- Attendance: 17\n- Biggest Return: Mary (Last played at DODGEBALL XXX-SEVEN)\n- New Players: (2) Vanessa Mattes and Joey Smalls\n- LXIV / LXV comparison:\n... The WHS Front courts housed players, with inclusion of trash cans used for team regeneration.\n...\nDark Dodgeball\nreturned as the large tennis lights refused to kick on.\n... Two new captains debuted in young stars Sascha B. and Joey S.\n... Pizza-man Luke delivered another free pizza [third week running].\n... Though they made another challenge, not a single member of Pond Scum attended.\n- Before the mayhem began, the popular game of Boxball was played in the parking lot by some of the dodgeball competitors.\nConsistent 66?\nBetween the light failure and Pond Scum no-showing, dodgeball has seen its share of mysteries in the past few weeks. What could possibly happen at DODGEBALL 66 that hasn't happened already?\nThe 66th dodgeball spectacular heads your way this Saturday night in the first event of the new month:\nDecember 2nd\n.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> It's the very middle of Season 7 and the surprises and shocks are not yet scarce. Last week's DODGEBALL LXIV saw the return of <i>Dark Dodgeball</i>, one of the lesser known gametypes if you will. On top of that, not one Pond Scum member attended despite a heavily rumored second challenge. What could have possibly happened at DODGEBALL LXV you ask?<br/><br/><u>The Story of LXV</u><br/>The dodgeball world is in a state of turmoil.<br/><br/>The lamppost played a major part yet again at LXV, as the whole night was based on its three small yellow lights. The front courts was where the action was as for 3 hours, players exchanged fire in one of the most violent matches ever witnessed.<br/><br/>As for Pond Scum, for the second week running, they no-showed despite making a bold challenge right here on <i>dodgeball.livejournal.com</i>. It only furthered the whirlwind of thoughts inside the minds of dodgeball's finest.<br/><br/>Like its predecessor, DODGEBALL LXV is yet another unsolved mystery in the long, winding road known as dodgeball.<br/><br/><u>Team SASCHA vs. Team JOEY</u><br/>This captains confrontation brought along two new captains much like LXIV did with the female frenzy pitting Kathryn Nogueira against Aimee Savoth.<br/><br/>Even with the tennis lights out for the entire duration of LXV, the action remained at its true finest. Neighbors in the surrounding area perhaps heard and felt some of the commotion as LXV featured easily some of the hardest shots and hits ever witnessed. The dreaded bulletballs certainly added to the mayhem as powerhouse throwers like Chris Adams and Kevin Megill rifled balls all night long in an effort to defeat <i>and</i> destroy their opponents.<br/><br/>The match itself was a squash in favor of new sensation Sascha Basista, defeating debuting star Joey Smalls, 5 to 1.<br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D65LogoC.jpg\"/></a></center><br/><u>The 65th Records</u><br/>- Attendance: 17<br/>- Biggest Return: Mary (Last played at DODGEBALL XXX-SEVEN)<br/>- New Players: (2) Vanessa Mattes and Joey Smalls<br/><br/>- LXIV / LXV comparison:<br/>... The WHS Front courts housed players, with inclusion of trash cans used for team regeneration.<br/>... <i>Dark Dodgeball</i> returned as the large tennis lights refused to kick on.<br/>... Two new captains debuted in young stars Sascha B. and Joey S.<br/>... Pizza-man Luke delivered another free pizza [third week running].<br/>... Though they made another challenge, not a single member of Pond Scum attended.<br/><br/>- Before the mayhem began, the popular game of Boxball was played in the parking lot by some of the dodgeball competitors.<br/><br/><u>Consistent 66?</u><br/>Between the light failure and Pond Scum no-showing, dodgeball has seen its share of mysteries in the past few weeks. What could possibly happen at DODGEBALL 66 that hasn't happened already? <br/><br/>The 66th dodgeball spectacular heads your way this Saturday night in the first event of the new month: <b>December 2nd</b>. </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D65LogoC.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}