{
  "id": 46867,
  "url": "https://dodgeball.livejournal.com/46867.html",
  "title": ">>>  GEARS of WAR",
  "date": "",
  "body_text": "The official poster for DODGEBALL LX SEVEN was not completed prior to the event itself. To view the poster in its full form, check out\nhttp://good-times.webshots.com/photo/2400914900090300279UxxaBc\n. Most will recognize the megastar featured on it.\n- Attendance: 12\n- Biggest Returns: Kerrin Marchese, Casi Smith, and Lauren Winston (Last appearances at DODGEBALL LXIV)\n- Because of the low turnout,\nPrison Ball\nreturned.\n- Captains nor rims were included at LX SEVEN.\n- The score of 13-3 is the second biggest slaughter ever following\nKyle Carty vs. Steve Adams\nat XXX-SEVEN, which saw Kyle decimate Steve 14-2.\n- Popular pizza-man Luke did\nnot\nbring free pizza for the first time.\n- Radio stations 103.5 (dance music) and moreso 106.7 (Christmas music) were heard throughout the entire night.\n- Despite a low attendance and light failure, DODGEBALL LX SEVEN ended at around 10:30pm.\nTHE \"KKK\"\nIf this match were on paper, it would have been extremely hard to predict the outcome.\nDiana DiBuccio, Mike \"Sputz\", and John Tronolone formed a terrific trio taking on exciting stars Kevin Megill, Kerrin Marchese, and Kevin Adams, otherwise known as\nKKK\n. The match appeared as evenly as can be. But then came the wave ... Rob Avakian, Chris Adams, Kevin Fitzpatrick, Casi Smith, Valerie Winston, Lauren Winston.\nDODGEBALL LX SEVEN featured some stinging action, accompanied by soft, beautiful Christmas music thanks to Mike \"Sputz\". John Tronolone described it as the\nGears of War\nvideo game commercial, as man is fighting off beast with the everso gentile music playing in the background.\nThe cold weather combined with the deadly speed of the bulletballs made each and every elimination as painful as possible. Players were actually limping off to the opposing prison.\n- In the early goings, Diana DiBuccio's twirl dodge added a little comedy to the explosive encounter.\n- Megastars Kerrin Marchese and Kevin Megill struck a feud with the longest running player John Tronolone. The eliminations were at a constant\n- Chris Adams and Kevin Fitzpatrick renewed their rivalry from 66. This one is a long way from being over.\n- Crafty catcher Mike \"Sputz\" suffering several eliminations after being hit on his hand.\n- Rob Avakian taking some of the worst neck shots known to the sport, and still putting up one hell of a fight.\n- Friendly-fire caused one Valerie Winston to suffer a dreadful eyeshot while imprisoned, thanks to ally Kevin Fitzpatrick. The resilient eldest Winston continued the night much to her credit.\nFew events could and will compare to the absolute massacre witnessed at the 67th dodgeball competition. Team\nKKK\ntruly earned their victory, despite a shortage of players. The crushing final score was 13-3 in one of the biggest slaughters ever recorded.\n________________________________________\n_____\nTHE ROAD TO 70\nThe forthcoming ten event is looking very, very interesting.\nDark Dodgeball\nhas taken over the sport and as of now, it doesn't look like much can be done. But being that it is DODGEBALL 70, it would only be fitting to shed some \"light\". Be prepared for an email in the coming week.\nDODGEBALL 68 is\nDecember 16th\nfollowed by the \"The Winston Cup III\" at DODGEBALL 69 on the\n23rd\n.\nThen its DODGEBALL 70, live from Wall High School, closing out the unprecendented 7th Season of dodgeball. Mark\nDecember 30th\non your calenders.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b>The official poster for DODGEBALL LX SEVEN was not completed prior to the event itself. To view the poster in its full form, check out <a href=\"http://good-times.webshots.com/photo/2400914900090300279UxxaBc\" rel=\"nofollow\" target=\"_blank\">http://good-times.webshots.com/photo/2400914900090300279UxxaBc</a>. Most will recognize the megastar featured on it.</b><br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D67LogoA1.jpg\"/></a></center><br/>- Attendance: 12<br/>- Biggest Returns: Kerrin Marchese, Casi Smith, and Lauren Winston (Last appearances at DODGEBALL LXIV)<br/><br/>- Because of the low turnout, <i>Prison Ball</i> returned.<br/>- Captains nor rims were included at LX SEVEN.<br/>- The score of 13-3 is the second biggest slaughter ever following <i>Kyle Carty vs. Steve Adams</i> at XXX-SEVEN, which saw Kyle decimate Steve 14-2.<br/>- Popular pizza-man Luke did <i>not</i> bring free pizza for the first time.<br/>- Radio stations 103.5 (dance music) and moreso 106.7 (Christmas music) were heard throughout the entire night.<br/>- Despite a low attendance and light failure, DODGEBALL LX SEVEN ended at around 10:30pm.<br/><br/><u><b>THE \"KKK\"</b></u><br/>If this match were on paper, it would have been extremely hard to predict the outcome. <br/><br/>Diana DiBuccio, Mike \"Sputz\", and John Tronolone formed a terrific trio taking on exciting stars Kevin Megill, Kerrin Marchese, and Kevin Adams, otherwise known as <i>KKK</i>. The match appeared as evenly as can be. But then came the wave ... Rob Avakian, Chris Adams, Kevin Fitzpatrick, Casi Smith, Valerie Winston, Lauren Winston.<br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D67Match.jpg\"/></a></center><br/>DODGEBALL LX SEVEN featured some stinging action, accompanied by soft, beautiful Christmas music thanks to Mike \"Sputz\". John Tronolone described it as the <i>Gears of War</i> video game commercial, as man is fighting off beast with the everso gentile music playing in the background.<br/><br/>The cold weather combined with the deadly speed of the bulletballs made each and every elimination as painful as possible. Players were actually limping off to the opposing prison.<br/><br/>- In the early goings, Diana DiBuccio's twirl dodge added a little comedy to the explosive encounter.<br/>- Megastars Kerrin Marchese and Kevin Megill struck a feud with the longest running player John Tronolone. The eliminations were at a constant<br/>- Chris Adams and Kevin Fitzpatrick renewed their rivalry from 66. This one is a long way from being over.<br/>- Crafty catcher Mike \"Sputz\" suffering several eliminations after being hit on his hand.<br/>- Rob Avakian taking some of the worst neck shots known to the sport, and still putting up one hell of a fight.<br/>- Friendly-fire caused one Valerie Winston to suffer a dreadful eyeshot while imprisoned, thanks to ally Kevin Fitzpatrick. The resilient eldest Winston continued the night much to her credit.<br/><br/>Few events could and will compare to the absolute massacre witnessed at the 67th dodgeball competition. Team <i>KKK</i> truly earned their victory, despite a shortage of players. The crushing final score was 13-3 in one of the biggest slaughters ever recorded.<br/><center>________________________________________<wbr/>_____<br/><br/><h3>THE ROAD TO 70</h3></center>The forthcoming ten event is looking very, very interesting. <i>Dark Dodgeball</i> has taken over the sport and as of now, it doesn't look like much can be done. But being that it is DODGEBALL 70, it would only be fitting to shed some \"light\". Be prepared for an email in the coming week.<br/><br/>DODGEBALL 68 is <b>December 16th</b> followed by the \"The Winston Cup III\" at DODGEBALL 69 on the <b>23rd</b>.<br/>Then its DODGEBALL 70, live from Wall High School, closing out the unprecendented 7th Season of dodgeball. Mark <b>December 30th</b> on your calenders. </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D67LogoA1.jpg",
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D67Match.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}