{
  "id": 47795,
  "url": "https://dodgeball.livejournal.com/47795.html",
  "title": ">>> The WINSTON Cup 3",
  "date": "",
  "body_text": "TWO DIVIDE. ONE CONQUERS.\nThe Winston Sisters' third confrontation this weekend at DODGEBALL 69 may be the most crucial of them all ... and here's why ...\nThe Biographies\n-- Valerie Winston\nDebuting at the inaugural event DODGEBALL DAY 1 in 2005, Valerie's quest to become one of the all-time greats has completed and no one could ever tell her different. One of the twelve original\nFemale Titans\n, even some 60-plus events later, her reign of terror sees no end. From the agile Tom Adams and John Tronolone to the powerhouses Chris Adams and Kevin Megill, she's eliminated them one way or another. In her match against younger sister at DODGEBALL 69, she will enter as the odds-on favorite, having already defeated Lauren on two seperate occasions.\n-- Lauren Winston\nNo one could ever take away the amount of heart and courage this titan possesses. Perhaps no one has given more to dodgeball off the court than Lauren Winston. She's one of few that can truly bring the ten events to life, proving her creativity to be unmatched. On the court, her accomplishments are as endless, having eliminated the biggest and the baddest from the days at Ocean Road Park to tennis courts of Wall High School. Her upcoming match against Valerie may be the biggest of her career.\nThe Winston Cup 1\nDODGEBALL DAY 1\nSeptember 3rd, 2005\nOcean Road Park\nIt was at the inaugural event where the legendary combo split, facing off in what would soon be a prelude of things to come. Team Valerie, comprised of John Watters, Diana DiBuccio, Kimmy Canzanella, and John Tronolone battled in a 5 on 5 showdown against Whitney Gill, Christian Ndreko, Kyle Carty, Mike Rosinski, and lead by Lauren Winston. With the unpredictable foam footballs in play, the eldest Winston took home the gold 3 to 1. Would Lauren avenge her loss?\nThe Winston Cup 2\nDODGEBALL 54 (One Year Anniversary)\nSeptember 3rd, 2006\nOcean Road Park and Wall High School\nDodgeball's one year anniversary wouldn't have been the same if the sisters of destruction weren't captains. It was a rather unusual showdown when compared to their 2005 match, as both Ocean Road Park and Wall High School hosted the event. DODGEBALL 54 caused much turmoil, as footballs, bulletballs, light malfunction and more turned the OYA into absolute chaos. But one thing that hadn't changed was the outcome. Valerie's sizeable lead from the ORP portion earned her her second victory against Lauren.\nThe Winston Cup 3\nDODGEBALL 69\nDecember 23rd, 2006\nWall High School\nIt's divide and conquer for Valerie as she looks to keep her undefeated streak in tact. Valerie has proven twice already that she has been unstoppable. Will this be the icing on the cake? For Lauren, it may be an uphill battle. But you can bet your ass she will fight to the very end.\nIt's\nTHE WINSTON CUP 3\nat the first ever Christmas event, DODGEBALL 69. Be there December 23rd and witness what happens.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b>TWO DIVIDE. ONE CONQUERS.</b><br/><br/>The Winston Sisters' third confrontation this weekend at DODGEBALL 69 may be the most crucial of them all ... and here's why ...<br/><br/><u>The Biographies</u><br/><br/>-- Valerie Winston<br/>Debuting at the inaugural event DODGEBALL DAY 1 in 2005, Valerie's quest to become one of the all-time greats has completed and no one could ever tell her different. One of the twelve original <i>Female Titans</i>, even some 60-plus events later, her reign of terror sees no end. From the agile Tom Adams and John Tronolone to the powerhouses Chris Adams and Kevin Megill, she's eliminated them one way or another. In her match against younger sister at DODGEBALL 69, she will enter as the odds-on favorite, having already defeated Lauren on two seperate occasions.<br/><br/>-- Lauren Winston<br/>No one could ever take away the amount of heart and courage this titan possesses. Perhaps no one has given more to dodgeball off the court than Lauren Winston. She's one of few that can truly bring the ten events to life, proving her creativity to be unmatched. On the court, her accomplishments are as endless, having eliminated the biggest and the baddest from the days at Ocean Road Park to tennis courts of Wall High School. Her upcoming match against Valerie may be the biggest of her career.<br/><br/><center><u>The Winston Cup 1</u><br/>DODGEBALL DAY 1<br/>September 3rd, 2005<br/>Ocean Road Park</center><br/>It was at the inaugural event where the legendary combo split, facing off in what would soon be a prelude of things to come. Team Valerie, comprised of John Watters, Diana DiBuccio, Kimmy Canzanella, and John Tronolone battled in a 5 on 5 showdown against Whitney Gill, Christian Ndreko, Kyle Carty, Mike Rosinski, and lead by Lauren Winston. With the unpredictable foam footballs in play, the eldest Winston took home the gold 3 to 1. Would Lauren avenge her loss? <br/><br/><center><u>The Winston Cup 2</u><br/>DODGEBALL 54 (One Year Anniversary)<br/>September 3rd, 2006<br/>Ocean Road Park and Wall High School</center><br/>Dodgeball's one year anniversary wouldn't have been the same if the sisters of destruction weren't captains. It was a rather unusual showdown when compared to their 2005 match, as both Ocean Road Park and Wall High School hosted the event. DODGEBALL 54 caused much turmoil, as footballs, bulletballs, light malfunction and more turned the OYA into absolute chaos. But one thing that hadn't changed was the outcome. Valerie's sizeable lead from the ORP portion earned her her second victory against Lauren.<br/><br/><center><u>The Winston Cup 3</u><br/>DODGEBALL 69<br/>December 23rd, 2006<br/>Wall High School</center><br/>It's divide and conquer for Valerie as she looks to keep her undefeated streak in tact. Valerie has proven twice already that she has been unstoppable. Will this be the icing on the cake? For Lauren, it may be an uphill battle. But you can bet your ass she will fight to the very end. <br/><br/>It's <b>THE WINSTON CUP 3</b> at the first ever Christmas event, DODGEBALL 69. Be there December 23rd and witness what happens. </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}