{
  "id": 48465,
  "url": "https://dodgeball.livejournal.com/48465.html",
  "title": ">>> DODGEBALL 70: The Finale of 2006",
  "date": "",
  "body_text": "THE RUNDOWN\nIt's the final days leading up to the 2006 finale spectacular known as DODGEBALL 70. And what a line-up in store.\nBEST OF 2006\nNext week,\ndodgeball.livejournal.com\nwill feature the Top 10 biggest occurances, events, and incidents, of the past year. 2006 was filled with memorable moments, both good and bad. The list was comprised by a small group of dodgeball elitest and will be unvailed to the world following the conclusion of DODGEBALL 70.\nBRING ON THE LIGHT!\nThe dodgeball crew is asked of their help in bringing any unused Christmas lights for this enormous event. Similiarly to DODGEBALL 20 one year ago, the lights will add a little flare to 70, creating what should be a most unique, and obviously bright atmosphere. One can certainly expect some classic decorations as well.\n*\nThose interested in setting up can arrive at 6pm\n*\nCHRIS ADAMS vs. KEVIN FITZPATRICK\nHell is sure to break loose in this legendary confrontation. Arguably, the two most dominant competitors ever finally meet in a one-on-one captains showdown.\n... Chris Adams has become one of the most respected veterans in history. His many talents, a powerful arm more than anything, have earned him bragging rights for life. He's feuded with the best and lived to tell about it. Kevin Megill, Tom Adams, John Tronolone, Justin Pierce, among other court generals will all tell you he's certainly deserving the title of \"legend\". His upcoming match at DODGEBALL 70 will be the most crucial of his entire career.\n... When you think of all-time greats, look no further than \"Fitz\". DODGEBALL XONE kicked off the\nNew Generation\nera, with Kevin Fitzpatrick coming out as the era's biggest star. The impact he made was instant, as fear set in the eyes of the new and old. The agile powerhouse is looking to cap off the year in a big way, and what better way than with a defeat of one Chris Adams. There isn't a better place to do it than at DODGEBALL 70.\nIt's\nLegend vs. Legend\nat the 70th dodgeball extravanganza!\nONLINE AWARDS\nDODGEBALL 70 will be the very first ten event to\nnot\nfeature the classic award ceremony. Due to the amount of time setting up may take, the award categories and winners themself will be announced after DODGEBALL 70's conclusion. Check back next week to see who walks away with a coveted \"Dodgeball Excellence Award\".\nLIVE ALL NIGHT!\nAt previous events, one could expect bands like Boy Hits Car, Nonpoint, Van Halen, Soundgarden, among other great artists and groups. Though you may hear songs from the bands mentioned, expect a twist into the music treatment at DODGEBALL 70. Everything from dance, to rap, to rock will be heard loud. The music will be a collection of songs\neveryone\ncan enjoy.\nThe new smash hit \"Ladies and Gentlemen\" by Saliva is the DODGEBALL 70 theme song.\nIt's safe to say DODGEBALL 70 will be a night to remember. The past year has been full of surprises and shocks, and what better way to go out than on top with the biggest event of the entire year! Witness\nLegend vs. Legend\n, dance to a variety of music, see the bright lights shine, and experience the intense fun and action that dodgeball has brought since Labor Day 2005.\nThere isn't a better place to be on December 30th than at DODGEBALL 70.\n>>> Special Poster:\nhttp://good-times.webshots.com/photo/2985924620090300279PtMMiv",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D70LogoA-1.jpg\"/></a><br/><h3>THE RUNDOWN</h3></center><i>It's the final days leading up to the 2006 finale spectacular known as DODGEBALL 70. And what a line-up in store.</i> <br/><br/><b><u>BEST OF 2006</u></b><br/>Next week, <i>dodgeball.livejournal.com</i> will feature the Top 10 biggest occurances, events, and incidents, of the past year. 2006 was filled with memorable moments, both good and bad. The list was comprised by a small group of dodgeball elitest and will be unvailed to the world following the conclusion of DODGEBALL 70.<br/><br/><b><u>BRING ON THE LIGHT!</u></b><br/>The dodgeball crew is asked of their help in bringing any unused Christmas lights for this enormous event. Similiarly to DODGEBALL 20 one year ago, the lights will add a little flare to 70, creating what should be a most unique, and obviously bright atmosphere. One can certainly expect some classic decorations as well. <br/><br/>*<i>Those interested in setting up can arrive at 6pm</i>*<br/><br/><b><u>CHRIS ADAMS vs. KEVIN FITZPATRICK</u></b><br/>Hell is sure to break loose in this legendary confrontation. Arguably, the two most dominant competitors ever finally meet in a one-on-one captains showdown.<br/><br/>... Chris Adams has become one of the most respected veterans in history. His many talents, a powerful arm more than anything, have earned him bragging rights for life. He's feuded with the best and lived to tell about it. Kevin Megill, Tom Adams, John Tronolone, Justin Pierce, among other court generals will all tell you he's certainly deserving the title of \"legend\". His upcoming match at DODGEBALL 70 will be the most crucial of his entire career.<br/><br/>... When you think of all-time greats, look no further than \"Fitz\". DODGEBALL XONE kicked off the <i>New Generation</i> era, with Kevin Fitzpatrick coming out as the era's biggest star. The impact he made was instant, as fear set in the eyes of the new and old. The agile powerhouse is looking to cap off the year in a big way, and what better way than with a defeat of one Chris Adams. There isn't a better place to do it than at DODGEBALL 70.<br/><br/>It's <i>Legend vs. Legend</i> at the 70th dodgeball extravanganza!<br/><br/><b><u>ONLINE AWARDS</u></b><br/>DODGEBALL 70 will be the very first ten event to <i>not</i> feature the classic award ceremony. Due to the amount of time setting up may take, the award categories and winners themself will be announced after DODGEBALL 70's conclusion. Check back next week to see who walks away with a coveted \"Dodgeball Excellence Award\".<br/><br/><b><u>LIVE ALL NIGHT!</u></b><br/>At previous events, one could expect bands like Boy Hits Car, Nonpoint, Van Halen, Soundgarden, among other great artists and groups. Though you may hear songs from the bands mentioned, expect a twist into the music treatment at DODGEBALL 70. Everything from dance, to rap, to rock will be heard loud. The music will be a collection of songs <i>everyone</i> can enjoy.<br/><br/>The new smash hit \"Ladies and Gentlemen\" by Saliva is the DODGEBALL 70 theme song.<br/><br/><b>It's safe to say DODGEBALL 70 will be a night to remember. The past year has been full of surprises and shocks, and what better way to go out than on top with the biggest event of the entire year! Witness <i>Legend vs. Legend</i>, dance to a variety of music, see the bright lights shine, and experience the intense fun and action that dodgeball has brought since Labor Day 2005.<br/><br/>There isn't a better place to be on December 30th than at DODGEBALL 70.</b><br/><br/>&gt;&gt;&gt; Special Poster: <a href=\"http://good-times.webshots.com/photo/2985924620090300279PtMMiv\" rel=\"nofollow\" target=\"_blank\">http://good-times.webshots.com/photo/2985924620090300279PtMMiv</a> </div>",
  "comment_count_text": "",
  "images": [
    "https://i9.photobucket.com/albums/a86/wwecoowner/DODGEBALL%20POSTERS/D70LogoA-1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}