{
  "id": 4873,
  "url": "https://dodgeball.livejournal.com/4873.html",
  "title": ">>> RUMORS Welcome",
  "date": "",
  "body_text": "\"RUMORS Welcome\" is a new column here on the dodgeball website. In it, you will read first hand what is going on in the dodgeball world. Whether the statements are true or not is for you to find out ...\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nWith DODGEBALL X just one day away, rumors are already floating around the dodgeball scene.\nI.\nOne of the biggest rumors concerns the Hall of Fame. Word has it that two of the HOF inductees will not be present to accept their awards. Who those inductees are remains a mystery to many.\nII.\nAnother interesting note concerns the \"Dodgeball Excellence\" awards. It is being said that many players already know the recipients of the awards. Could this be true?\nIII.\nTom Adams is said to be \"out of action indefinitely\" due to the horrendous 'nut' shot he took this past weekend at DODGEBALL 9.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nThere you have it ladies and gents. DODGEBALL X is certainly shaping up to be a surprising, and most definitely exciting night ever. All who have played before better be prepared for the biggest dodgeball event of all time.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> \"RUMORS Welcome\" is a new column here on the dodgeball website. In it, you will read first hand what is going on in the dodgeball world. Whether the statements are true or not is for you to find out ...<br/><br/><center>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</center><br/>With DODGEBALL X just one day away, rumors are already floating around the dodgeball scene. <br/><br/>I. <br/>One of the biggest rumors concerns the Hall of Fame. Word has it that two of the HOF inductees will not be present to accept their awards. Who those inductees are remains a mystery to many.<br/><br/>II. <br/>Another interesting note concerns the \"Dodgeball Excellence\" awards. It is being said that many players already know the recipients of the awards. Could this be true?<br/><br/>III. <br/>Tom Adams is said to be \"out of action indefinitely\" due to the horrendous 'nut' shot he took this past weekend at DODGEBALL 9. <br/><br/><center>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</center><br/>There you have it ladies and gents. DODGEBALL X is certainly shaping up to be a surprising, and most definitely exciting night ever. All who have played before better be prepared for the biggest dodgeball event of all time. </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}