{
  "id": 49049,
  "url": "https://dodgeball.livejournal.com/49049.html",
  "title": ">>> BEST of 2006",
  "date": "",
  "body_text": "What a thrilling year 2006 was. Every event beginning with DODGEBALL 21 to this past weekend's DODGEBALL 70 impacted the lives of players, spectators, Applebee's servers, and Dunkin Donuts employees alike.\nHere in this special DODGEBALL 71 preview, we take a look back at the \"Top Ten\" moments, events, and incidents that changed dodgeball forever. The list was comprised by three dodgeball elitist. We begin the countdown with #10, and work our way to the #1 moment in 2006.\nThe Dodgeball Uhaul\nWet War III\n, more commonly known as DODGEBALL TWENTY-TWO triggered a downward spiral in the days that followed. TWENTY-TWO will long be remembered as the coldest and wettest of the rain wars, an event that was eventually called off early. But the dodgeball warriors were thirsty for the action and intensity. But it only caused further havoc and turmoil.\nIt was decided that DODGEBALL 23 would be moved rather suddenly to Monday, January 16, only two days after the brutal\nWet War\n. But upon arrival at 23, the courts were completely iced-over, obviously caused by the downpour from the weekend. The dodgeball crew put their heads together in an effort to figure out what to do. The Wall High School gymnasium was an option, but the idea failed because of insurance reasons. GoodSports USA, located on Route 138, was the last resort and some knew it would come with a price.\nGoodSports USA is a business looking to make money for anyone that wants to use their equipment, rent their courts, etc. But the legends of dodgeball were not willing to pay the hefty price GoodSports was charging, especially for only an hour of play. Aside from that, the indoor tennis courts were already booked for the night, and even if they cleared, there was no guarantee to securing them. It was at the end of this struggle that finding an indoor venue would be one difficult task, with evidence of today's battles remaining outside.\nDODGEBALL 23 would be moved back to its original Saturday slot, but only to be moved one last time (Friday) by unanimous vote as similar weather to TWENTY-TWO was being reported.\nWelcome Back to Ocean Road Park\nIt's a place revered for hosting what would become a \"local phenomenon\". Ocean Road Park, the first and some say better \"home\", began the journey known as dodgeball. But along came the winter months and it was expected that sooner than later, the bright lights of Ocean Road Park would fail. At DODGEBALL X6 in December 2005, that's exactly what happened.\nThere was no alternative but to move play to Wall High School. But at the time, the move was thought of as a temporary solution as many longed to return to their home away from home. It was this nostalgic feel that instigated an Ocean Road Park revival.\nIn the weeks leading up to DODGEBALL 30, the voices were heard and the third ten-event scheduled on March 12, 2006, would indeed return to good ole ORP. The success of DODGEBALL 30 continued for the next few months, as DODGEBALL 35, DODGEBALL 38, DODGEBALL 42, DODGEBALL 43, and even DODGEBALL 50 would all take place from the sport's birthplace. Though it has been sometime since we've seen ORP, never say never as the #9 story of 2006 is proof that anything can happen.\nThe Lamppost\nWho knew that almost a year later, Wall High School would experience the same problem as Ocean Road Park.\nDODGEBALL LXIV signified the beginning of the\nDark Days\nas the WHS lights, much like ORP in 2005, would not kick on no matter how many times one pressed the button. It was thought of as a one time error but to much chagrin, the following week would see the same results.\nAfter weeks of darkness, it was reported that the installation of new timer was needed in order for the light problem fixed. But come DODGEBALL 68, questions remained unanswered as the lights shut off at 8pm when compared to the normal 11.\nIt's been a complete mystery since LXIV and though dodgeball has continued through this unorthodox period, many still await answers. All that is known is that a single lamppost has kept dodgeball in tact, with teams vying for victory as if nothing is different or strange at all. Will the lights ever go on again is yet another one of dodgeball's biggest mysteries.\nF*cked-up Fingers\nBurke, Spengeman, Sputz, DiBuccio. Four names, four fingers ... broken.\nIt was in May at DODGEBALL 41 where the world witnessed the first of these incidents. In an attempt to catch a bulletball from Kevin Megill, the impactful shot Burke felt left his pinky finger twisted and contorted in ways the human body just isn't supposed to move. He was taken to a nearby hospital by Mike \"Sputz\", who would oddly enough experience the same fate 8 events later. It was later revealed that Burke did more than just break his finger; \"... Dislocated it, broke it, tore all the ligaments, damaged the tendon.\" Since DODGEBALL 41, players have been extremely careful when attempting to catch, especially after three more of the same incidents followed.\n- At DODGEBALL 43, Dan Spengeman would be the next victim, an injury that required two reconstructive surgeries to his left pinky finger.\n- At DODGEBALL 49, Mike \"Sputz\" took a bulletball shot when he and Tom Adams were practicing on the sidelines. \"Sputz\" somehow continued through the night much to his credit.\n- And who knew that exactly one year after dodgeball's inception at DODGEBALL 54, veteran Diana DiBuccio would suffer the same anguish becoming the first female to break her finger. She thankfully did not need surgery and was back on the court in a matter of weeks wearing a large green cast covering her right arm.\n- It was believed that Lauren Stopa may have broken her finger as well at DODGEBALL SIXTY IX. Luckily, she was okay and was back on the court in no time.\nWar!\nEntering into November 2006, it wasn’t hard to realize dodgeball was fading. The inaugural event of the month, DODGEBALL 62, saw a mere 5 players; the lowest attendance ever recorded.\nDODGEBALL 62 was billed as \"The Calm before the Storm\", as what awaited the following week was a premeditated invasion by unknown stalkers. The weeks leading up to DODGEBALL LX3: \"War!\" caused mixed emotions. Some were angered by the threats while others embraced them, ready to take action at something never done before.\nThe invaders turned out to be the controversial group Pond Scum. Though they lagged in the numbers and eventually lost, their impact was enduring. For the first time in over a year, DODGEBALL LX3 witnessed a four-team tournament and concluded with a 2 vs. 2 captains showdown. To this day, DODGEBALL LX3 can be argued as the greatest non ten-event in history.\nDays after, rumors circulated about a possible second attack. These rumors diminished however and dodgeball continued through its traditional ways for the remainder of the year.\nDodgeball was given new life at LX3, sparking a revival of the veterans that helped shape the sport itself. Pond Scum’s time in the spotlight may have even prolonged the life of dodgeball itself, as Season 6 never hit the unpopular \"Mid-Season Slump\".\nThe World Heavyweight Championship\nNever before had winning meant so much. Sure you can eliminate your rivals, but becoming an actual champion was unheard of. Beginning officially at DODGEBALL XL, one Joe Kelly would change the game forever.\nIt was the Captains Championship, held by some of dodgeball’s finest stars. After winning his third straight match at DODGEBALL XL, Kelly officially became the first Captains Champion, taking on all comers who stepped in his way. At a record-setting DODGEBALL 41, Kelly would earn an unprecedented 4th win in a row, defeating Derek Carty by the slimmest of margins. Though Joe came up short in his fifth attempt the following week, it wasn’t hard to see the enormous change in dodgeball.\nList of Champions:\nJoe Kelly (DODGEBALL 38 – DODGEBALL 42)\nLenny Herrera (DODGEBALL 42 – DODGEBALL XLIV)\nWesley Hebrew (DODGEBALL XLIV – DODGEBALL 45)\nDiana DiBuccio (DODGEBALL 45 – DODGEBALL 46)\nSara DeCuir (DODGEBALL 46 – DODGEBALL 48) ...\nIt was perhaps the most competitive atmosphere ever, as names like Derek Carty, Steve Adams, and John Tronolone all wanted a crack at the title. Heading into DODGEBALL 50, one man stood alone, dominating the dodgeball scene for weeks.\nAfter winning the gold at DODGEBALL 48, one Kevin Adams secured his name as the final captains champion, defeating contenders John Tronolone (49), Chris and Tom Adams (50), and Ryan Letsche (51). The historic run of the championship ended at DODGEBALL FIFTY-TWO, where the title was retired following Letsche’s defeat of Kevin in their rematch.\nThough being a captain usually meant picking teams, it was at this time the competitive nature reached new heights. Beginning with Joe and ending with Kevin, all events in between were as violent and ruthless as can be.\nThe Populous Wars\n#4 on the countdown should come as no surprise, seeing how many of the incidents that transpired already appear on the “Top Ten” list.\nThe Populous Wars\n, viewed as the second of two peaks in dodgeball’s run, shook the very foundations of the sport. DODGEBALL XL, DODGEBALL 41, and DODGEBALL 42 installed new ideas, witnessed horrific occurrences, and broke records like never before.\nAn unbelievable 36 people attended the finale event in Season 4, headlined by what would soon be the beginning of the captains title,\nJoe Kelly vs. Travis Mills\n. But the impression DODGEBALL XL left can still be seen today, thanks mainly to one Steve Adams. The final game of the event took roughly about 40 minutes, obviously not setting well with those on the sidelines. Steve was the first to speak up and little would he have known the positive response. Since DODGEBALL XL, every event has included a special three-minute \"Last Man Standing\" rule. This means when there is one player left on a team, they must either: (A) regenerate the entire team by hitting the rim, or (B) eliminate at least one opponent in order to restart the timer. If neither was accomplished by three minutes, the game was lost.\nDODGEBALL 41 was just as significant as its predecessor, if not more. Since DODGEBALL XTWO in early November 2005, no event was able to break the attendance record. Come May 27 however, the possibility was there as the month ushered in the warm Spring weather and saw the returns of past players from college. After 203 days at the top, XTWO was finally defeated as an astounding 47 people attended DODGEBALL 41. Other shattered records included 15 new players and 13 female competitors. And don’t forget, this event sadly included the finger-breaking of one Chris Burke.\nHeading into the 42nd spectacular, Joe Kelly was looking for his unbelievable 5th straight win as captain. But he left a defeated man as new champion, Lenny Herrera, took seat to the thrown. Though DODGEBALL 42 signaled the end of Joe Kelly’s monumental streak, it was also famous for another reason. DODGEBALL 42, in short, was nicknamed \"Veteran’s Day\" as 32 people participated, not one of them a new star.\nNot JUST a Game\nThe title says it all; this is more than just a game.\nFollowing the madness of the first 20 events, specifically DODGEBALL 20, the popularity of dodgeball was at an all-time high [despite heading into the dead of winter]. DODGEBALL 20 had featured something never done before: video taping. Following the finale of 2005, several events after were also taped, with the focus a dodgeball documentary. The initial plan saw Ryan McCrorey and Dan Spengeman team up on the project, but the duo quickly split and Dan worked solo. It wasn’t long into 2006 that the first and only documentary about the life and times of dodgeball was released.\nAt \"Diana’s Dodgeball Dinner\" held on February 3, 2006, the dodgeball community witnessed the first official public viewing of the now classic DVD,\nNot JUST a Game\n. It sold numerous copies for a mere $3 and is still talked about to this very day. The release of\nNot JUST a Game\ncemented the legacy that is dodgeball.\nDODGEBALL 50: August 4, 2006\n\"It Just Doesn’t Get Any Bigger\", as the slogan read on one of many promotional posters. Arguably the biggest event of them all returned to its roots of Ocean Road Park, ready to embark on a 5-hour journey that was the 50th dodgeball extravaganza.\nThe event was highlighted by the insane Adams-only 2 vs. 2 captains match, the birth of the Rimshot Contest, the fake company\nA.S.K. FoodInc.\n\"delivering\" free food, coolers full of ice pops, and the most chaotic 5 minutes ever, a memorable water balloon fight. On top of that, much of the action was caught on camera, thanks to talented camera work by Ben Cotta.\nFew events, perhaps no other, truly meant more to the sport or the players themselves. For 11 months, dodgeball took the local community by storm; an incredible 180 players-plus.\nDODGEBALL 54: Year 2 Begins\nOne month after DODGEBALL 50 came the biggest non ten-event in history, the One Year Anniversary, DODGEBALL 54!\nWhat a night ... the Winston sisters locking horns in a rematch from DODGEBALL DAY 1, the reemerging foam footballs, Mike \"Sputz\" and Justin Pierce’s surprise water gun attack, as well other secrets and surprise. But there was a slight problem heading into the OYA.\nThanks to Hurricane Ernesto the day before, DODGEBALL 54 was met with light failure at Ocean Road Park (the event’s host venue) a little over an hour into the action. Much to the chagrin of several players, the action spilled onto the Wall High School tennis courts. But as luck would have it, the courts were full. It was during this time Alison Bertsch brought out a celebratory cake and parking lot party ensued. Fortunately, 10 minutes passed and the back courts of WHS were empty. Aside from Diana's finger injury, DODGEBALL 54 resumed without problems, with inclusion of the bulletballs.\nDODGEBALL 54 concluded an amazing chapter in the lives of all involved. The second year went off without a hitch.\nThe \"Top Ten\" of 2006 ... completed. And we're not done yet.\nWELCOME TO THE NEW YEAR!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> What a thrilling year 2006 was. Every event beginning with DODGEBALL 21 to this past weekend's DODGEBALL 70 impacted the lives of players, spectators, Applebee's servers, and Dunkin Donuts employees alike.<br/><br/>Here in this special DODGEBALL 71 preview, we take a look back at the \"Top Ten\" moments, events, and incidents that changed dodgeball forever. The list was comprised by three dodgeball elitist. We begin the countdown with #10, and work our way to the #1 moment in 2006.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/10.jpg\"/></a><br/><u><b>The Dodgeball Uhaul</b></u><br/><i>Wet War III</i>, more commonly known as DODGEBALL TWENTY-TWO triggered a downward spiral in the days that followed. TWENTY-TWO will long be remembered as the coldest and wettest of the rain wars, an event that was eventually called off early. But the dodgeball warriors were thirsty for the action and intensity. But it only caused further havoc and turmoil.<br/><br/>It was decided that DODGEBALL 23 would be moved rather suddenly to Monday, January 16, only two days after the brutal <i>Wet War</i>. But upon arrival at 23, the courts were completely iced-over, obviously caused by the downpour from the weekend. The dodgeball crew put their heads together in an effort to figure out what to do. The Wall High School gymnasium was an option, but the idea failed because of insurance reasons. GoodSports USA, located on Route 138, was the last resort and some knew it would come with a price.<br/><br/>GoodSports USA is a business looking to make money for anyone that wants to use their equipment, rent their courts, etc. But the legends of dodgeball were not willing to pay the hefty price GoodSports was charging, especially for only an hour of play. Aside from that, the indoor tennis courts were already booked for the night, and even if they cleared, there was no guarantee to securing them. It was at the end of this struggle that finding an indoor venue would be one difficult task, with evidence of today's battles remaining outside.<br/><br/>DODGEBALL 23 would be moved back to its original Saturday slot, but only to be moved one last time (Friday) by unanimous vote as similar weather to TWENTY-TWO was being reported.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/9.jpg\"/></a><br/><u><b>Welcome Back to Ocean Road Park</b></u><br/>It's a place revered for hosting what would become a \"local phenomenon\". Ocean Road Park, the first and some say better \"home\", began the journey known as dodgeball. But along came the winter months and it was expected that sooner than later, the bright lights of Ocean Road Park would fail. At DODGEBALL X6 in December 2005, that's exactly what happened.<br/><br/>There was no alternative but to move play to Wall High School. But at the time, the move was thought of as a temporary solution as many longed to return to their home away from home. It was this nostalgic feel that instigated an Ocean Road Park revival.<br/><br/>In the weeks leading up to DODGEBALL 30, the voices were heard and the third ten-event scheduled on March 12, 2006, would indeed return to good ole ORP. The success of DODGEBALL 30 continued for the next few months, as DODGEBALL 35, DODGEBALL 38, DODGEBALL 42, DODGEBALL 43, and even DODGEBALL 50 would all take place from the sport's birthplace. Though it has been sometime since we've seen ORP, never say never as the #9 story of 2006 is proof that anything can happen.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/8.jpg\"/></a><br/><u><b>The Lamppost</b></u><br/>Who knew that almost a year later, Wall High School would experience the same problem as Ocean Road Park. <br/><br/>DODGEBALL LXIV signified the beginning of the <i>Dark Days</i> as the WHS lights, much like ORP in 2005, would not kick on no matter how many times one pressed the button. It was thought of as a one time error but to much chagrin, the following week would see the same results.<br/><br/>After weeks of darkness, it was reported that the installation of new timer was needed in order for the light problem fixed. But come DODGEBALL 68, questions remained unanswered as the lights shut off at 8pm when compared to the normal 11.<br/><br/>It's been a complete mystery since LXIV and though dodgeball has continued through this unorthodox period, many still await answers. All that is known is that a single lamppost has kept dodgeball in tact, with teams vying for victory as if nothing is different or strange at all. Will the lights ever go on again is yet another one of dodgeball's biggest mysteries.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/7.jpg\"/></a><br/><u><b>F*cked-up Fingers</b></u><br/>Burke, Spengeman, Sputz, DiBuccio. Four names, four fingers ... broken.<br/><br/>It was in May at DODGEBALL 41 where the world witnessed the first of these incidents. In an attempt to catch a bulletball from Kevin Megill, the impactful shot Burke felt left his pinky finger twisted and contorted in ways the human body just isn't supposed to move. He was taken to a nearby hospital by Mike \"Sputz\", who would oddly enough experience the same fate 8 events later. It was later revealed that Burke did more than just break his finger; \"... Dislocated it, broke it, tore all the ligaments, damaged the tendon.\" Since DODGEBALL 41, players have been extremely careful when attempting to catch, especially after three more of the same incidents followed.<br/><br/>- At DODGEBALL 43, Dan Spengeman would be the next victim, an injury that required two reconstructive surgeries to his left pinky finger.<br/>- At DODGEBALL 49, Mike \"Sputz\" took a bulletball shot when he and Tom Adams were practicing on the sidelines. \"Sputz\" somehow continued through the night much to his credit.<br/>- And who knew that exactly one year after dodgeball's inception at DODGEBALL 54, veteran Diana DiBuccio would suffer the same anguish becoming the first female to break her finger. She thankfully did not need surgery and was back on the court in a matter of weeks wearing a large green cast covering her right arm.<br/>- It was believed that Lauren Stopa may have broken her finger as well at DODGEBALL SIXTY IX. Luckily, she was okay and was back on the court in no time.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/6.jpg\"/></a><br/><u><b>War!</b></u><br/>Entering into November 2006, it wasn’t hard to realize dodgeball was fading. The inaugural event of the month, DODGEBALL 62, saw a mere 5 players; the lowest attendance ever recorded.<br/><br/>DODGEBALL 62 was billed as \"The Calm before the Storm\", as what awaited the following week was a premeditated invasion by unknown stalkers. The weeks leading up to DODGEBALL LX3: \"War!\" caused mixed emotions. Some were angered by the threats while others embraced them, ready to take action at something never done before. <br/><br/>The invaders turned out to be the controversial group Pond Scum. Though they lagged in the numbers and eventually lost, their impact was enduring. For the first time in over a year, DODGEBALL LX3 witnessed a four-team tournament and concluded with a 2 vs. 2 captains showdown. To this day, DODGEBALL LX3 can be argued as the greatest non ten-event in history. <br/><br/>Days after, rumors circulated about a possible second attack. These rumors diminished however and dodgeball continued through its traditional ways for the remainder of the year.<br/><br/>Dodgeball was given new life at LX3, sparking a revival of the veterans that helped shape the sport itself. Pond Scum’s time in the spotlight may have even prolonged the life of dodgeball itself, as Season 6 never hit the unpopular \"Mid-Season Slump\".<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/5.jpg\"/></a><br/><u><b>The World Heavyweight Championship</b></u><br/>Never before had winning meant so much. Sure you can eliminate your rivals, but becoming an actual champion was unheard of. Beginning officially at DODGEBALL XL, one Joe Kelly would change the game forever.<br/><br/>It was the Captains Championship, held by some of dodgeball’s finest stars. After winning his third straight match at DODGEBALL XL, Kelly officially became the first Captains Champion, taking on all comers who stepped in his way. At a record-setting DODGEBALL 41, Kelly would earn an unprecedented 4th win in a row, defeating Derek Carty by the slimmest of margins. Though Joe came up short in his fifth attempt the following week, it wasn’t hard to see the enormous change in dodgeball.<br/><br/><i>List of Champions:</i><br/>Joe Kelly (DODGEBALL 38 – DODGEBALL 42)<br/>Lenny Herrera (DODGEBALL 42 – DODGEBALL XLIV)<br/>Wesley Hebrew (DODGEBALL XLIV – DODGEBALL 45)<br/>Diana DiBuccio (DODGEBALL 45 – DODGEBALL 46)<br/>Sara DeCuir (DODGEBALL 46 – DODGEBALL 48) ...<br/><br/>It was perhaps the most competitive atmosphere ever, as names like Derek Carty, Steve Adams, and John Tronolone all wanted a crack at the title. Heading into DODGEBALL 50, one man stood alone, dominating the dodgeball scene for weeks. <br/><br/>After winning the gold at DODGEBALL 48, one Kevin Adams secured his name as the final captains champion, defeating contenders John Tronolone (49), Chris and Tom Adams (50), and Ryan Letsche (51). The historic run of the championship ended at DODGEBALL FIFTY-TWO, where the title was retired following Letsche’s defeat of Kevin in their rematch.<br/><br/>Though being a captain usually meant picking teams, it was at this time the competitive nature reached new heights. Beginning with Joe and ending with Kevin, all events in between were as violent and ruthless as can be.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/4.jpg\"/></a><br/><u><b>The Populous Wars</b></u><br/>#4 on the countdown should come as no surprise, seeing how many of the incidents that transpired already appear on the “Top Ten” list. <br/><br/><i>The Populous Wars</i>, viewed as the second of two peaks in dodgeball’s run, shook the very foundations of the sport. DODGEBALL XL, DODGEBALL 41, and DODGEBALL 42 installed new ideas, witnessed horrific occurrences, and broke records like never before.<br/><br/>An unbelievable 36 people attended the finale event in Season 4, headlined by what would soon be the beginning of the captains title, <i>Joe Kelly vs. Travis Mills</i>. But the impression DODGEBALL XL left can still be seen today, thanks mainly to one Steve Adams. The final game of the event took roughly about 40 minutes, obviously not setting well with those on the sidelines. Steve was the first to speak up and little would he have known the positive response. Since DODGEBALL XL, every event has included a special three-minute \"Last Man Standing\" rule. This means when there is one player left on a team, they must either: (A) regenerate the entire team by hitting the rim, or (B) eliminate at least one opponent in order to restart the timer. If neither was accomplished by three minutes, the game was lost. <br/><br/>DODGEBALL 41 was just as significant as its predecessor, if not more. Since DODGEBALL XTWO in early November 2005, no event was able to break the attendance record. Come May 27 however, the possibility was there as the month ushered in the warm Spring weather and saw the returns of past players from college. After 203 days at the top, XTWO was finally defeated as an astounding 47 people attended DODGEBALL 41. Other shattered records included 15 new players and 13 female competitors. And don’t forget, this event sadly included the finger-breaking of one Chris Burke.<br/><br/>Heading into the 42nd spectacular, Joe Kelly was looking for his unbelievable 5th straight win as captain. But he left a defeated man as new champion, Lenny Herrera, took seat to the thrown. Though DODGEBALL 42 signaled the end of Joe Kelly’s monumental streak, it was also famous for another reason. DODGEBALL 42, in short, was nicknamed \"Veteran’s Day\" as 32 people participated, not one of them a new star.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/3.jpg\"/></a><br/><u><b>Not JUST a Game</b></u><br/>The title says it all; this is more than just a game. <br/><br/>Following the madness of the first 20 events, specifically DODGEBALL 20, the popularity of dodgeball was at an all-time high [despite heading into the dead of winter]. DODGEBALL 20 had featured something never done before: video taping. Following the finale of 2005, several events after were also taped, with the focus a dodgeball documentary. The initial plan saw Ryan McCrorey and Dan Spengeman team up on the project, but the duo quickly split and Dan worked solo. It wasn’t long into 2006 that the first and only documentary about the life and times of dodgeball was released.<br/><br/>At \"Diana’s Dodgeball Dinner\" held on February 3, 2006, the dodgeball community witnessed the first official public viewing of the now classic DVD, <i>Not JUST a Game</i>. It sold numerous copies for a mere $3 and is still talked about to this very day. The release of <i>Not JUST a Game</i> cemented the legacy that is dodgeball.<br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/2.jpg\"/></a><br/><u><b>DODGEBALL 50: August 4, 2006</b></u><br/>\"It Just Doesn’t Get Any Bigger\", as the slogan read on one of many promotional posters. Arguably the biggest event of them all returned to its roots of Ocean Road Park, ready to embark on a 5-hour journey that was the 50th dodgeball extravaganza.<br/><br/>The event was highlighted by the insane Adams-only 2 vs. 2 captains match, the birth of the Rimshot Contest, the fake company <i>A.S.K. FoodInc.</i> \"delivering\" free food, coolers full of ice pops, and the most chaotic 5 minutes ever, a memorable water balloon fight. On top of that, much of the action was caught on camera, thanks to talented camera work by Ben Cotta.<br/><br/>Few events, perhaps no other, truly meant more to the sport or the players themselves. For 11 months, dodgeball took the local community by storm; an incredible 180 players-plus. <br/><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/1.jpg\"/></a><br/><u><b>DODGEBALL 54: Year 2 Begins</b></u><br/>One month after DODGEBALL 50 came the biggest non ten-event in history, the One Year Anniversary, DODGEBALL 54!<br/><br/>What a night ... the Winston sisters locking horns in a rematch from DODGEBALL DAY 1, the reemerging foam footballs, Mike \"Sputz\" and Justin Pierce’s surprise water gun attack, as well other secrets and surprise. But there was a slight problem heading into the OYA.<br/><br/>Thanks to Hurricane Ernesto the day before, DODGEBALL 54 was met with light failure at Ocean Road Park (the event’s host venue) a little over an hour into the action. Much to the chagrin of several players, the action spilled onto the Wall High School tennis courts. But as luck would have it, the courts were full. It was during this time Alison Bertsch brought out a celebratory cake and parking lot party ensued. Fortunately, 10 minutes passed and the back courts of WHS were empty. Aside from Diana's finger injury, DODGEBALL 54 resumed without problems, with inclusion of the bulletballs.<br/><br/>DODGEBALL 54 concluded an amazing chapter in the lives of all involved. The second year went off without a hitch.<br/><br/><center><b><i>The \"Top Ten\" of 2006 ... completed. And we're not done yet.</i></b><br/><h3>WELCOME TO THE NEW YEAR!<br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/D71LogoB.jpg\"/></a></h3></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/10.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/9.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/8.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/7.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/6.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/5.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/4.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/3.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/2.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/D71LogoB.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}