{
  "id": 51258,
  "url": "https://dodgeball.livejournal.com/51258.html",
  "title": ">>> The TOMS RIVER TOURNAMENT",
  "date": "",
  "body_text": "\"I don't even know where to begin really. A surreal night, one unlike any other. This tournament brought out feelings in me only comparable to the ten-events. After all was said and done, you come away with more than just a trophy, but friends for the rest of your life. For 5 hours, life's roadblocks cease to exist.\"\n- JOHN TRONOLONE\n-- 52 teams, 1 goal: win the first-ever Toms River Tournament. Double Elimination!\nPretty simple right? WRONG.\nThe chills run up your spine, the hair on your neck stands up, the adrenaline pumps ...\nYou're probably getting those very feelings just thinking about it.\nThe R.A.T.S.\nFormed in just 4 short days, co-captained by the dominant female duo Sara DeCuir and Diana DiBuccio,\nThe R.A.T.S.\nwere ready, willing, and able to come out on top in this massive 52-team war.\nCap.\nSara DeCuir\nCap.\nDiana DiBuccio\nMike Edwards\nDerek Carty [not pictured]\nAlison Bertsch\nMike Butler\nSascha Basista\nJack Mess\nLenny Herrera\nJoey Smalls*.\n*\nReplaced Grant Cornero, who was unable to attend due to a conflicting work schedule\n.\nThe first round match-up turned out to be a show-stealer. It wasn't easy however as one-by-one,\nThe R.A.T.S.\nwere disposed of, leaving Sascha Basista fighting against a pack of wolves - alone. But just when things looked grim, the dodging specialties in young Basista began to come out, with all ears and eyes positioned on Court 2. With the crowd solidly behind him, Sascha fended off a good number of opponents before going down. Much credit deserved to the young lion who was greeted by a well-deserved ovation upon returning to the stands.\nWith one loss already recorded, winning this next match would decide the fate of\nThe R.A.T.S.\nUnfortuantely, Round 2 mirrored that of their first encounter, as within 3 minutes, Derek Carty and Mike Butler were all that remained of the red and black attack. Once Derek went down, it was all up to Butler who has proven time and again to be a top dog. After a gutsy effort, Butler was taken out by the relentless onslaught of his opponents.\nA terrific, fearless showing for\nThe R.A.T.S.\nas a team that faced adversity before gametime made an impact the only way they know how. None of the team members have anything to be ashamed of.\nThe O.R.P. Knights\nAn all-star team, co-captained by Ryan McCrorey and Mike \"Sputz\" Krott, with one purpose ... to win.\nCap.\nRyan McCrorey\nCap.\nMike \"Sputz\" Krott\nChris Burke\nJustin Pierce\nKevin Adams\nKevin Fitzpatrick\nJohn Tronolone\nChris Adams\nKevin Megill Jr.\nTom Adams\nSmaller boundries, softer painball-sized dodge balls, among pages and pages of rules unaccustomed to the weekly dodgeball fan created heavy turmoil before the getgo. But despite being taken out of their element, the\nO.R.P. Knights\nwere nothing short of dominant.\nThe initial round witnessed an impressive showing from one Tom Adams, eliminating 40% of his opposition, a game that eventually ended with a lucky footshot from John Tronolone. The\nO.R.P. Knights\nwere moving up the ladder of success.\nOne after another, the\nKnights\nlooked unstoppable, defeating the tourny's best sqauds. Though eliminations came fast and furious, through it all, the group remained strong. The brackets became increasingly smaller, with the\nKnights\nstill on the board.\nCome the fourth and fifth rounds, the butterflies remained, each match becoming more crucial than the last. But somehow, especially with expertise of the legendary Chris Adams, the\nKnights\ncontinued their winning ways.\nIt came down to the nitty-gritty in Game 6, but the\nO.R.P. Knights\nprevailed. They had guaranteed themselves an overall third place victory on the evening. But the chaos was far from over ...\nThe finals of the winners-bracket was perhaps the most emotionally draining game of the night. The\nKnights\nhad yet to lose a single match and winning this 7th game would have secured their spot in the ultimate final round. Facing the powerful and agile team\nSkillz that Thrillz\n, the\nKnights\nwould go on to suffer their first defeat. Because of the crushing defeat, the\nKnights\nbattled the winners of the losers-bracket, with the opportunity of a rematch in the ultimate finals against\nSkillz that Thrillz\n. This game didn't come without a fight though, as Chris Adams remained with two nasty, hungry opponents. But the experience of the 24 year-old proved the deciding factor, as Chris capped Game 8 and sent the\nO.R.P. Knights\nstraight to the finals of the entire tournament.\nThe Finals:\nThe 7-1\nO.R.P. Knights\nvs. The 8-0\nSkillz that Thrillz\nThe\nKnights\nwere in a must-win situation, with a 1st place victory by way of defeating\nSkillz that Thrillz\nin two consecutive matches.\nSkillz that Thrillz\nhad already defeated the determined\nKnights\n, and certainly had the upper hand going into the finale.\nIn what was another outstanding, chaotic match-up,\nSkillz that Thrillz\ndefeated the popular\nO.R.P. Knights\ntaking home the gold. Congratulations are certainly in order to the standout team, as their 1st place win didn't come without a fight.\nBut what an effort by the\nKnights\ntaking\n2nd place\nout of an astounding 52 teams. Heading into the tournament, few would have thought the success of the\nKnights\nwould have reached the heights it did.\nThe frowns of 1st place failure were turned upside down by the wild cheering squad and the overall effort and desire by the players themselves. If not for the support of friends and family in attendance, things may have been different.\nThe celebration of the well-deserved 2nd place victory concluded with a classic: Applebee's half-price appetizers.\nThe Cheering Section!\nIn support for both teams was a rowdy cheering section comprised of Lauren Stopa, Valerie Winston, Meredith Lewis, Rob Avakian, Melissa Kerr, and Lauren Winston. A special thanks to each, looking on for the entire duration of the tournament.\nBoth teams themselves also feuled the fun, applauding the efforts of each other and other adversaries.\nThanks!\nAgain, thanks go out to the cheering sqaud who made the event as fun and entertaining as possible.\nWithout question, both \"Sputz\" and Ryan McCrorey deserve thanks as their company, Ahern Printing, sponsored the\nO.R.P. Knights\n. The admissions fee as well as the uniforms were paid for by Ahern.\nAnd also, thanks to everyone who captured pictures or took video.\nUnquestionably, one of the most amazing nights in the one year-plus history of dodgeball!\n>>\nPictures\n:\nhttp://monmouth.facebook.com/album.php?aid=2019639&id=28801477\n(Must have Facebook account)\n**Credit: Mike Edwards\n>>\nVideos\n:\nhttp://www.youtube.com/view_play_list?p=FFEB6D7D8A8519E0\n**Credit: Mike Edwards\n>>\nOcean County Observer Newspaper Article\n:\nhttp://www.ocobserver.com/apps/pbcs.dll/article?AID=/20070204/NEWS01/702040333/1002",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>\"I don't even know where to begin really. A surreal night, one unlike any other. This tournament brought out feelings in me only comparable to the ten-events. After all was said and done, you come away with more than just a trophy, but friends for the rest of your life. For 5 hours, life's roadblocks cease to exist.\"</i><br/><b>- JOHN TRONOLONE</b><br/><br/>-- 52 teams, 1 goal: win the first-ever Toms River Tournament. Double Elimination!<br/>Pretty simple right? WRONG.<br/><br/>The chills run up your spine, the hair on your neck stands up, the adrenaline pumps ...<br/>You're probably getting those very feelings just thinking about it.<br/><br/><u><b>The R.A.T.S.</b></u><br/>Formed in just 4 short days, co-captained by the dominant female duo Sara DeCuir and Diana DiBuccio, <i>The R.A.T.S.</i> were ready, willing, and able to come out on top in this massive 52-team war. <br/><i>Cap.</i> Sara DeCuir<br/><i>Cap.</i> Diana DiBuccio<br/>Mike Edwards<br/>Derek Carty [not pictured]<br/>Alison Bertsch<br/>Mike Butler<br/>Sascha Basista<br/>Jack Mess<br/>Lenny Herrera<br/>Joey Smalls*.<br/><br/>*<i>Replaced Grant Cornero, who was unable to attend due to a conflicting work schedule</i>.<br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT3.jpg\"/></a></center><br/>The first round match-up turned out to be a show-stealer. It wasn't easy however as one-by-one, <i>The R.A.T.S.</i> were disposed of, leaving Sascha Basista fighting against a pack of wolves - alone. But just when things looked grim, the dodging specialties in young Basista began to come out, with all ears and eyes positioned on Court 2. With the crowd solidly behind him, Sascha fended off a good number of opponents before going down. Much credit deserved to the young lion who was greeted by a well-deserved ovation upon returning to the stands.<br/><br/>With one loss already recorded, winning this next match would decide the fate of <i>The R.A.T.S.</i> Unfortuantely, Round 2 mirrored that of their first encounter, as within 3 minutes, Derek Carty and Mike Butler were all that remained of the red and black attack. Once Derek went down, it was all up to Butler who has proven time and again to be a top dog. After a gutsy effort, Butler was taken out by the relentless onslaught of his opponents. <br/><br/>A terrific, fearless showing for <i>The R.A.T.S.</i> as a team that faced adversity before gametime made an impact the only way they know how. None of the team members have anything to be ashamed of. <br/><br/><u><b>The O.R.P. Knights</b></u><br/>An all-star team, co-captained by Ryan McCrorey and Mike \"Sputz\" Krott, with one purpose ... to win.<br/><i>Cap.</i> Ryan McCrorey<br/><i>Cap.</i> Mike \"Sputz\" Krott<br/>Chris Burke<br/>Justin Pierce<br/>Kevin Adams<br/>Kevin Fitzpatrick<br/>John Tronolone<br/>Chris Adams<br/>Kevin Megill Jr.<br/>Tom Adams<br/><br/>Smaller boundries, softer painball-sized dodge balls, among pages and pages of rules unaccustomed to the weekly dodgeball fan created heavy turmoil before the getgo. But despite being taken out of their element, the <i>O.R.P. Knights</i> were nothing short of dominant. <br/><br/>The initial round witnessed an impressive showing from one Tom Adams, eliminating 40% of his opposition, a game that eventually ended with a lucky footshot from John Tronolone. The <i>O.R.P. Knights</i> were moving up the ladder of success.<br/><br/>One after another, the <i>Knights</i> looked unstoppable, defeating the tourny's best sqauds. Though eliminations came fast and furious, through it all, the group remained strong. The brackets became increasingly smaller, with the <i>Knights</i> still on the board.<br/><br/>Come the fourth and fifth rounds, the butterflies remained, each match becoming more crucial than the last. But somehow, especially with expertise of the legendary Chris Adams, the <i>Knights</i> continued their winning ways.<br/><br/>It came down to the nitty-gritty in Game 6, but the <i>O.R.P. Knights</i> prevailed. They had guaranteed themselves an overall third place victory on the evening. But the chaos was far from over ...<br/><br/>The finals of the winners-bracket was perhaps the most emotionally draining game of the night. The <i>Knights</i> had yet to lose a single match and winning this 7th game would have secured their spot in the ultimate final round. Facing the powerful and agile team <i>Skillz that Thrillz</i>, the <i>Knights</i> would go on to suffer their first defeat. Because of the crushing defeat, the <i>Knights</i> battled the winners of the losers-bracket, with the opportunity of a rematch in the ultimate finals against <i>Skillz that Thrillz</i>. This game didn't come without a fight though, as Chris Adams remained with two nasty, hungry opponents. But the experience of the 24 year-old proved the deciding factor, as Chris capped Game 8 and sent the <i>O.R.P. Knights</i> straight to the finals of the entire tournament.<br/><br/><b>The Finals:</b> The 7-1 <i>O.R.P. Knights</i> vs. The 8-0 <i>Skillz that Thrillz</i><br/>The <i>Knights</i> were in a must-win situation, with a 1st place victory by way of defeating <i>Skillz that Thrillz</i> in two consecutive matches. <i>Skillz that Thrillz</i> had already defeated the determined <i>Knights</i>, and certainly had the upper hand going into the finale. <br/><br/>In what was another outstanding, chaotic match-up, <i>Skillz that Thrillz</i> defeated the popular <i>O.R.P. Knights</i> taking home the gold. Congratulations are certainly in order to the standout team, as their 1st place win didn't come without a fight.<br/><br/>But what an effort by the <i>Knights</i> taking <b>2nd place</b> out of an astounding 52 teams. Heading into the tournament, few would have thought the success of the <i>Knights</i> would have reached the heights it did. <br/><br/>The frowns of 1st place failure were turned upside down by the wild cheering squad and the overall effort and desire by the players themselves. If not for the support of friends and family in attendance, things may have been different.<br/><br/>The celebration of the well-deserved 2nd place victory concluded with a classic: Applebee's half-price appetizers.<br/><br/><center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT2.jpg\"/></a></center><br/><u><b>The Cheering Section!</b></u><br/>In support for both teams was a rowdy cheering section comprised of Lauren Stopa, Valerie Winston, Meredith Lewis, Rob Avakian, Melissa Kerr, and Lauren Winston. A special thanks to each, looking on for the entire duration of the tournament.<br/><br/>Both teams themselves also feuled the fun, applauding the efforts of each other and other adversaries.<br/><br/><u><b>Thanks!</b></u><br/>Again, thanks go out to the cheering sqaud who made the event as fun and entertaining as possible.<br/><br/>Without question, both \"Sputz\" and Ryan McCrorey deserve thanks as their company, Ahern Printing, sponsored the <i>O.R.P. Knights</i>. The admissions fee as well as the uniforms were paid for by Ahern.<br/><br/>And also, thanks to everyone who captured pictures or took video.<br/><br/><center><h4>Unquestionably, one of the most amazing nights in the one year-plus history of dodgeball!</h4><br/><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket - Video and Image Hosting\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT1.jpg\"/></a></center><br/>&gt;&gt; <u>Pictures</u>: <a href=\"http://monmouth.facebook.com/album.php?aid=2019639&amp;id=28801477\" rel=\"nofollow\" target=\"_blank\">http://monmouth.facebook.com/album.php?aid=2019639&amp;id=28801477</a> (Must have Facebook account)<br/>**Credit: Mike Edwards<br/><br/>&gt;&gt; <u>Videos</u>: <a href=\"http://www.youtube.com/view_play_list?p=FFEB6D7D8A8519E0\" rel=\"nofollow\" target=\"_blank\">http://www.youtube.com/view_play_list?p=FFEB6D7D8A8519E0</a><br/>**Credit: Mike Edwards<br/><br/>&gt;&gt; <u>Ocean County Observer Newspaper Article</u>: <a href=\"http://www.ocobserver.com/apps/pbcs.dll/article?AID=/20070204/NEWS01/702040333/1002\" rel=\"nofollow\" target=\"_blank\">http://www.ocobserver.com/apps/pbcs.dll/article?AID=/20070204/NEWS01/702040333/1002</a> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT3.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT2.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DBT1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}