{
  "id": 54418,
  "url": "https://dodgeball.livejournal.com/54418.html",
  "title": ">>> POWER Preview",
  "date": "",
  "body_text": "It's a match unexpected to the weekly dodgeball fan. Two of the brightest, most gifted stars go head to head in a true classic.\nOn one side, returning from hiatus, is the ever agile and crazy\nMike Edwards\n, who has been a main player since his debut in August 2006. On the other, perhaps the most feared of all competitors due to the tremendous velocity in each throw, the one and only\nKevin Megill\n. To those that love this sport, this one will surely not disappoint.\nEDWARDS\nFor 21 year-old Mike Edwards, dodgeball has been nothing short of a success for the high-flyin' dodger. Beginning with his debut at DODGEBALL 47, heads turned and ears opened as perhaps the newest main-eventer had arrived. Week after week and month after month, his career has only gotten better becoming one of the most recognized names in the history of the game. For Mike, DODGEBALL 80 is another chance to stamp his name in the record books by defeating the undefeated captain himself, Kevin Megill.\nFast Fact!\nEdwards has not missed a ten event since his debut. This will be his fourth season finale event overall; his first time in the captains chair.\nMEGILL\nThis man strikes fear in the eyes of his opponents. Known greatly for his uncanny power, Kevin Megill rose quickly among the ranks following his debut at DODGEBALL DAY 2. After a long hiatus in late 2005 and early 2006, he returned with a vengeance taking on all comers. It was then he secured his name as one of the all time greats, proving to be an unstoppable force. His captains record is as impressive as they come, earning an unmatched 3 and 0 record. If the past serves as any indication, he may be walking out of DODGEBALL 80 with his hand raised in victory.\nFast Fact!\nMegill's captains record consists of two singles victories and one team battle. He defeated Steve Adams and John Tronolone at events TWENTY-SIX and 30 resectively. Last week's dominance may come as no surprise as he, along with partner Chris Adams, absloutely slaughtered the duo of Juan Londono and John Tronolone.\nTwo contrasting styles meet for the first time ever at the finale of Season 8.\nLegends will collide come March 17.\nPOWER MUSIC\nThere is nothing like live, energetic music to kick things up a notch. Those that can remember the playlist at DODGEBALL 70 will be in for a treat this coming Saturday.\nA similar compilation with bands like Rage Against the Machine, 311, Aerosmith, and the Red Hot Chili Peppers will come together with artists such as Will Smith, Bruce Springsteen, and Jay Z. There is no better way to liven up the crowd than with music fit for everyone.\n\"All My Life\"\nby the Foo Fighters is the official theme song for\nDODGEBALL 80\n.\n____________________________\nDon't think the previews are finished yet. Be sure to check back during the week for more information on this milestone event.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/D80D1.jpg\"/></a></center><br/>It's a match unexpected to the weekly dodgeball fan. Two of the brightest, most gifted stars go head to head in a true classic. <br/><br/>On one side, returning from hiatus, is the ever agile and crazy <b>Mike Edwards</b>, who has been a main player since his debut in August 2006. On the other, perhaps the most feared of all competitors due to the tremendous velocity in each throw, the one and only <b>Kevin Megill</b>. To those that love this sport, this one will surely not disappoint.<br/><br/><u><b>EDWARDS</b></u><br/>For 21 year-old Mike Edwards, dodgeball has been nothing short of a success for the high-flyin' dodger. Beginning with his debut at DODGEBALL 47, heads turned and ears opened as perhaps the newest main-eventer had arrived. Week after week and month after month, his career has only gotten better becoming one of the most recognized names in the history of the game. For Mike, DODGEBALL 80 is another chance to stamp his name in the record books by defeating the undefeated captain himself, Kevin Megill.<br/><br/><b>Fast Fact!</b> Edwards has not missed a ten event since his debut. This will be his fourth season finale event overall; his first time in the captains chair.<br/><br/><u><b>MEGILL</b></u><br/>This man strikes fear in the eyes of his opponents. Known greatly for his uncanny power, Kevin Megill rose quickly among the ranks following his debut at DODGEBALL DAY 2. After a long hiatus in late 2005 and early 2006, he returned with a vengeance taking on all comers. It was then he secured his name as one of the all time greats, proving to be an unstoppable force. His captains record is as impressive as they come, earning an unmatched 3 and 0 record. If the past serves as any indication, he may be walking out of DODGEBALL 80 with his hand raised in victory.<br/><br/><b>Fast Fact!</b> Megill's captains record consists of two singles victories and one team battle. He defeated Steve Adams and John Tronolone at events TWENTY-SIX and 30 resectively. Last week's dominance may come as no surprise as he, along with partner Chris Adams, absloutely slaughtered the duo of Juan Londono and John Tronolone.<br/><br/>Two contrasting styles meet for the first time ever at the finale of Season 8.<br/>Legends will collide come March 17.<br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball80F.jpg\"/></a><br/><h4>POWER MUSIC</h4></center>There is nothing like live, energetic music to kick things up a notch. Those that can remember the playlist at DODGEBALL 70 will be in for a treat this coming Saturday.<br/><br/>A similar compilation with bands like Rage Against the Machine, 311, Aerosmith, and the Red Hot Chili Peppers will come together with artists such as Will Smith, Bruce Springsteen, and Jay Z. There is no better way to liven up the crowd than with music fit for everyone.<br/><br/><i>\"All My Life\"</i> by the Foo Fighters is the official theme song for <b>DODGEBALL 80</b>.<br/><center>____________________________</center><br/>Don't think the previews are finished yet. Be sure to check back during the week for more information on this milestone event. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/D80D1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball80F.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}