{
  "id": 55635,
  "url": "https://dodgeball.livejournal.com/55635.html",
  "title": ">>> PIE in the EYE",
  "date": "",
  "body_text": "The 16th\nWet War\nwill long be remembered not only for the first hour's constant downpour, but also the heated verbal conflicts between opponents. So much was on the line and neither side had any plans on quitting. Stars came from all over the state for this 81st dodgeball extravaganza and no one was leaving without their weekly dose of dodgeball action. And as the picture shows, for four of dodgeball's most elite superstars, staying clean became the primary goal.\nTwo feuds rolled into one gigantic match created one of the most insane and competitive dodgeball atmospheres of all-time. Members of the two most recognized families in the history of the game looked to conquer perhaps their biggest rivals when\nValerie Winston\nand\nKevin Adams\nsquared-off against the agile and powerful combination of\nLenny Herrera\nand\nJohn Tronolone\n. The stakes couldn't have been any higher as one team would leave creamed ... literally. What a way to kick off Season 9 with the  first-ever\nCREAMation Rules\nmatch!\nQuick Match Results\nIt was a brutal outing for Lenny and John. Not only were they drenched from head to toe, but they had lost the first four consecutive games of LXXXI. The score looked grim for the hungry duo, but neither man was ready to give up on the opportunity to literally cream their rival team. Would the next game see a turn-around?\nThere would be no shut-out victory for Team VK, having been beaten in the 5th game of this historical series; Team LJ was finally on the board. But Game 5 proved to be nothing more than a fluke as Team VK went on to win the next two games, taking a huge lead in this all-or-nothing confrontation.\nThough Team LJ picked up Games 8 and 9, it was a little too late for any retaliation.\nCo-captains Kevin Adams & Valerie Winston had defeated Co-captains John Tronolone & Lenny Herrera, 6 - 3, in the first-ever\nCREAMation Rules\nmatch at DODGEBALL LXXXI.\nAnd of course as per the pre-match stipulation, the losers paid the ultimate price; a pie in the eye!\nExclusive DODGEBALL LXXXI \"CREAMation\" Video!\n\"DODGEBALL LXXXI was truly a spectacular event. The weather was wild, the competition was fierce, and the ending was unforgettable. Nothing will ever top the experience of 'creamating' Lenny in the face.\"\n- KEVIN ADAMS\nMoments & Stars\n: Ray Marzarella's consistant blocking and overall longevity, Sascha Basista's wicked sliding-dodge, the returning Ryan Letsche's all-around performance, the athletic stars from Seton Hall, Valerie Winston pelted in the ear by Tom Adams\nOnline Exclusive!\nHerrera/Tronolone vs. Adams/Winston\nwas actually planned a good 3 weeks in advance, obviously agreed upon by all the participants. In the final week leading up to the showdown, Lenny, John, and Kevin all agreed to add pudding to the pies. Valerie however voted against this and thus the idea was scrapped.\nAnd of course ... the LXXXI Records\n> Attendance: 31\n> Biggest Return: Wesley Hebrew (Last appearance at DODGEBALL LIX)\n> New Players: (6) Tom Holowka, Matt Ruggeri, Jason Cosma, Chris Dutra, Melissa Green, Phil Lewis\n- This is the first attendance over 30 since DODGEBALL 71 in early January.\n- DODGEBALL LXXXI was\nWet War XVI\nas well as the second consecutive\nWet War\n. It was the inaugural event of the Spring 2007 season.\n- DODGEBALL LXXXI hosted the first-ever\nCREAMation Rules\nmatch where the losing team captains would be hit in the face with a whipped cream filled pie. It was contested under traditional rules for the entire duration [ending at 10:36pm].\n- Kevin Adams became only the second captain in history to win 5 matches, tying the record with his older brother Chris. Kevin is also the first player to win two team battles, having also won at DODGEBALL 50. John Tronolone became the second player to captain a team 9 times, tying this record with Chris Adams. In the process, he became the first competitor to lose his 6th match. After LXXXI, Kevin is 5-2-0, Valerie is 3-2-2, Lenny is 3-3-1, and John is 3-6-0.\n- And on a final note, DODGEBALL LXXXI fell on The Undertaker's birthday; John Tronolone's favorite WWE wrestler.\nThanks!\nThanks to one Lenny Herrera for the use of his camera to catch the aftermath footage. Alison Bertsch is also thanked as she did the camera work during the\nCREAMations\nthemselves.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/P3240187a.jpg\"/></a></center><br/>The 16th <i>Wet War</i> will long be remembered not only for the first hour's constant downpour, but also the heated verbal conflicts between opponents. So much was on the line and neither side had any plans on quitting. Stars came from all over the state for this 81st dodgeball extravaganza and no one was leaving without their weekly dose of dodgeball action. And as the picture shows, for four of dodgeball's most elite superstars, staying clean became the primary goal. <br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball81C.jpg\"/></a></center><br/>Two feuds rolled into one gigantic match created one of the most insane and competitive dodgeball atmospheres of all-time. Members of the two most recognized families in the history of the game looked to conquer perhaps their biggest rivals when <b>Valerie Winston</b> and <b>Kevin Adams</b> squared-off against the agile and powerful combination of <b>Lenny Herrera</b> and <b>John Tronolone</b>. The stakes couldn't have been any higher as one team would leave creamed ... literally. What a way to kick off Season 9 with the  first-ever <i>CREAMation Rules</i> match!<br/><br/><u>Quick Match Results</u><br/>It was a brutal outing for Lenny and John. Not only were they drenched from head to toe, but they had lost the first four consecutive games of LXXXI. The score looked grim for the hungry duo, but neither man was ready to give up on the opportunity to literally cream their rival team. Would the next game see a turn-around?<br/><br/>There would be no shut-out victory for Team VK, having been beaten in the 5th game of this historical series; Team LJ was finally on the board. But Game 5 proved to be nothing more than a fluke as Team VK went on to win the next two games, taking a huge lead in this all-or-nothing confrontation.<br/><br/>Though Team LJ picked up Games 8 and 9, it was a little too late for any retaliation.<br/><br/>Co-captains Kevin Adams &amp; Valerie Winston had defeated Co-captains John Tronolone &amp; Lenny Herrera, 6 - 3, in the first-ever <i>CREAMation Rules</i> match at DODGEBALL LXXXI.<br/><br/>And of course as per the pre-match stipulation, the losers paid the ultimate price; a pie in the eye!<center><h5>Exclusive DODGEBALL LXXXI \"CREAMation\" Video!</h5><iframe allowfullscreen=\"\" class=\"lj_embedcontent\" frameborder=\"0\" height=\"389\" name=\"embed_434169_5\" src=\"https://l.lj-toys.com/?auth_token=sessionless%3A1770591600%3Aembedcontent%3A434169%265%26%26%3A1f4c0ff94274769def738e1667d19a01abcb52b5&amp;moduleid=5&amp;preview=&amp;journalid=434169&amp;noads=\" width=\"430\"></iframe></center><br/><i>\"DODGEBALL LXXXI was truly a spectacular event. The weather was wild, the competition was fierce, and the ending was unforgettable. Nothing will ever top the experience of 'creamating' Lenny in the face.\"</i><br/><b>- KEVIN ADAMS </b><br/><br/><b>Moments &amp; Stars</b>: Ray Marzarella's consistant blocking and overall longevity, Sascha Basista's wicked sliding-dodge, the returning Ryan Letsche's all-around performance, the athletic stars from Seton Hall, Valerie Winston pelted in the ear by Tom Adams<br/><br/><b>Online Exclusive!</b><br/><i>Herrera/Tronolone vs. Adams/Winston</i> was actually planned a good 3 weeks in advance, obviously agreed upon by all the participants. In the final week leading up to the showdown, Lenny, John, and Kevin all agreed to add pudding to the pies. Valerie however voted against this and thus the idea was scrapped.<br/><br/><u>And of course ... the LXXXI Records</u><br/>&gt; Attendance: 31<br/>&gt; Biggest Return: Wesley Hebrew (Last appearance at DODGEBALL LIX)<br/>&gt; New Players: (6) Tom Holowka, Matt Ruggeri, Jason Cosma, Chris Dutra, Melissa Green, Phil Lewis<br/><br/>- This is the first attendance over 30 since DODGEBALL 71 in early January.<br/>- DODGEBALL LXXXI was <i>Wet War XVI</i> as well as the second consecutive <i>Wet War</i>. It was the inaugural event of the Spring 2007 season.<br/>- DODGEBALL LXXXI hosted the first-ever <i>CREAMation Rules</i> match where the losing team captains would be hit in the face with a whipped cream filled pie. It was contested under traditional rules for the entire duration [ending at 10:36pm].<br/>- Kevin Adams became only the second captain in history to win 5 matches, tying the record with his older brother Chris. Kevin is also the first player to win two team battles, having also won at DODGEBALL 50. John Tronolone became the second player to captain a team 9 times, tying this record with Chris Adams. In the process, he became the first competitor to lose his 6th match. After LXXXI, Kevin is 5-2-0, Valerie is 3-2-2, Lenny is 3-3-1, and John is 3-6-0.<br/>- And on a final note, DODGEBALL LXXXI fell on The Undertaker's birthday; John Tronolone's favorite WWE wrestler.<br/><br/><u>Thanks!</u><br/>Thanks to one Lenny Herrera for the use of his camera to catch the aftermath footage. Alison Bertsch is also thanked as she did the camera work during the <i>CREAMations</i> themselves. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/P3240187a.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball81C.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}