{
  "id": 57726,
  "url": "https://dodgeball.livejournal.com/57726.html",
  "title": ">>> BRING on the CAKE!",
  "date": "",
  "body_text": "Time to take a stroll down memory lane ...\nDODGEBALL 78 (3.3.07)\nIt was one of the best kept secrets, at least for one participant that is.\nLauren Stopa, with some added assistance from Diana DiBuccio, orchestrated one of the biggest surprises in dodgeball history. At the center of the secret was one Justin Pierce, whose birthday fell just days following the March 3 event. Little did he know that his peers would join in celebrating his 23rd birthday.\nWith the court colorfully decorated, DODGEBALL 78 was creatively controlled by \"The Piercer\" himself, choosing gametypes, stipulations, and even the captains. In perhaps one of the most unlikely of bouts, Juan Londono defeated Chris Adams, contested under\nPick Your Poison\nrules.\nDODGEBALL 79 (3.10.07)\nLike the week before, the 79th dodgeball extravaganza was a celebration of the life and times of one of the sport's finest, this time for powerhouse Chris Adams. The 25-year old was thrilled with the opportunity to run the show, but at the same time seeked the ultimate revenge.\nChris devised one of the most brilliant gametypes in a 2-court, \"four-square\" type battle known as\nBoxBall Dodgeball\n. Chris chose himself and Juan Londono as the rival captains. But what looked to be a standard rematch from DODGEBALL 78 turned into an epic team encounter. Juan was given John Tronolone as his co-captain while Chris chose the one and only Kevin Megill.\nDODGEBALL 79 will\nalways\nbe remembered as the absolute biggest slaughter ever recorded, as the legendary duo of Adams and Megill came out with their hands raised in victory. Never before had there been such a massacre of 17 to 0.\nPresent Day\nDODGEBALL 85 (4.28.07)\n\"Catching Machine\" award winners look to conquer all!\nLike their predecessors,\nMike \"Sputz\" Krott\nand\nLenny Herrera\nwill have full booking power over this 85th spectacular. If the past two birthday gatherings serve as any indication, DODGEBALL 85 will be as unpredictable as they come. You can bet anything and everything will happen.\n*In the unlikely event that neither show up, both Lenny and \"Sputz\" can still call all the shots even if it's via a telephone conversation.*",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>Time to take a stroll down memory lane ...</i><br/><br/><b>DODGEBALL 78 (3.3.07)</b><br/>It was one of the best kept secrets, at least for one participant that is.<br/><br/>Lauren Stopa, with some added assistance from Diana DiBuccio, orchestrated one of the biggest surprises in dodgeball history. At the center of the secret was one Justin Pierce, whose birthday fell just days following the March 3 event. Little did he know that his peers would join in celebrating his 23rd birthday.<br/><br/>With the court colorfully decorated, DODGEBALL 78 was creatively controlled by \"The Piercer\" himself, choosing gametypes, stipulations, and even the captains. In perhaps one of the most unlikely of bouts, Juan Londono defeated Chris Adams, contested under <i>Pick Your Poison</i> rules. <br/><br/><b>DODGEBALL 79 (3.10.07)</b><br/>Like the week before, the 79th dodgeball extravaganza was a celebration of the life and times of one of the sport's finest, this time for powerhouse Chris Adams. The 25-year old was thrilled with the opportunity to run the show, but at the same time seeked the ultimate revenge.<br/><br/>Chris devised one of the most brilliant gametypes in a 2-court, \"four-square\" type battle known as <i>BoxBall Dodgeball</i>. Chris chose himself and Juan Londono as the rival captains. But what looked to be a standard rematch from DODGEBALL 78 turned into an epic team encounter. Juan was given John Tronolone as his co-captain while Chris chose the one and only Kevin Megill.<br/><br/>DODGEBALL 79 will <i>always</i> be remembered as the absolute biggest slaughter ever recorded, as the legendary duo of Adams and Megill came out with their hands raised in victory. Never before had there been such a massacre of 17 to 0.<br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/D85LogoC1.jpg\"/></a></center><br/><b>Present Day<br/>DODGEBALL 85 (4.28.07)</b><br/>\"Catching Machine\" award winners look to conquer all!<br/><br/>Like their predecessors, <b>Mike \"Sputz\" Krott</b> and <b>Lenny Herrera</b> will have full booking power over this 85th spectacular. If the past two birthday gatherings serve as any indication, DODGEBALL 85 will be as unpredictable as they come. You can bet anything and everything will happen.<br/><br/><i>*In the unlikely event that neither show up, both Lenny and \"Sputz\" can still call all the shots even if it's via a telephone conversation.*</i> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/D85LogoC1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}