{
  "id": 58251,
  "url": "https://dodgeball.livejournal.com/58251.html",
  "title": ">>> I 17",
  "date": "",
  "body_text": "What better way to kick off the second half of Season 9 than with this blockbuster. It's\n2005 vs. 2007\nin a match that pits not only two outstanding,\nyoung\nathletes, but two fearless, all-around gifted competitors to\never\ngrace the dodgeball court.\nThe one and only\nKevin Adams\nlooks to take down another 17 year-old sensation in rising headliner\nGrant Cornero\n.\nWhether it was the Ocean Road Park era or the modern-day wars of Wall High School, Kevin Adams has unquestionably left an indelible mark on this sport. A man of \"firsts\" if you will: the first \"Act of Courage\" Award winner, an accolade presented at DODGEBALL 20; participated in\nand\nwon the first officially recognized team battle in history at DODGEBALL 50. If those aren't enough, it wasn't long ago he was \"creamating\" one Lenny Herrera in the first-ever\nCREAMation Rules\nmatch at the inaugural event of Season 9. An overall record of 5 wins and 2 losses, it's a career that never seems to fade. Few, perhaps none, have reached the heights of this megastar.\nFast Fact!\nRemember the days when Kevin nursed a cast on his left wrist? Unbeknownst to a majority of his dodgeball peers, Grant has partaken in the weekly extravaganzas with a broken finger! Ahh, the irony of it all.\nAnyone who has suffered any bodily injury, whether on the court or off it, and still competes, has earned respect and admiration the hard way. Grant is all about no fear, conquering the greats of the game, and cementing his name as an impact player in the process. Veterans and newblood alike have taken notice at this major star who has one hell of an opportunity at DODGEBAL LXXXVI. There isn't anyone better suited for the job than the multi-talented Kevin Adams to go up against.\nWill Kevin's past knowledge and experience lead him to a 6th victory?\nWill Grant rise to the occasion in his tryout match?\nOne of the most unpredictable matches ever!\nDo not miss\n2005 vs. 2007\n!\n**MORE TO COME!**\nCheck\ndodgeball.livejournal.com\nthis Friday as some of the game's brightest speak up and out about this epic encounter.\nDODGEBALL 87\n\"It's time to play the Feud!\" Off-court titans, and sisters, go head to head in one of dodgeball's most unexpected matches of the modern era. The elder\nLiz Nogueira\nfaces\nKathryn Nogueira\ncome May 12.\nDODGEBALL 88\nUnbeaten dodging experts collide! The iconic \"crazy\"\nMike Edwards\nlooks to mirror his performance at DODGEBALL 80 when he takes on the equally impressive and a legend in his own right,\nMike Butler\n. Whose streak ends May 19?\nDODGEBALL 89\nCould it be the most anticipated return to the captains circle? The man, the myth, the legend\nDan Spengeman\nreturns to action for one night only. It's \"QuickSand\" versus a mystery opponent on May 26.\nCheck back next week following the conclusion of DODGEBALL LXXXVI for an earth-shattering announcement regarding DODGEBALL 90!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/86B.jpg\">What better way to kick off the second half of Season 9 than with this blockbuster. It's <i>2005 vs. 2007</i> in a match that pits not only two outstanding, <i>young</i> athletes, but two fearless, all-around gifted competitors to <i>ever</i> grace the dodgeball court. <br/><br/>The one and only <b>Kevin Adams</b> looks to take down another 17 year-old sensation in rising headliner <b>Grant Cornero</b>. <br/><br/>Whether it was the Ocean Road Park era or the modern-day wars of Wall High School, Kevin Adams has unquestionably left an indelible mark on this sport. A man of \"firsts\" if you will: the first \"Act of Courage\" Award winner, an accolade presented at DODGEBALL 20; participated in <i>and</i> won the first officially recognized team battle in history at DODGEBALL 50. If those aren't enough, it wasn't long ago he was \"creamating\" one Lenny Herrera in the first-ever <i>CREAMation Rules</i> match at the inaugural event of Season 9. An overall record of 5 wins and 2 losses, it's a career that never seems to fade. Few, perhaps none, have reached the heights of this megastar. <br/><br/><b>Fast Fact!</b> Remember the days when Kevin nursed a cast on his left wrist? Unbeknownst to a majority of his dodgeball peers, Grant has partaken in the weekly extravaganzas with a broken finger! Ahh, the irony of it all. <br/><br/>Anyone who has suffered any bodily injury, whether on the court or off it, and still competes, has earned respect and admiration the hard way. Grant is all about no fear, conquering the greats of the game, and cementing his name as an impact player in the process. Veterans and newblood alike have taken notice at this major star who has one hell of an opportunity at DODGEBAL LXXXVI. There isn't anyone better suited for the job than the multi-talented Kevin Adams to go up against. <br/><br/><center><big>Will Kevin's past knowledge and experience lead him to a 6th victory? <br/>Will Grant rise to the occasion in his tryout match? <br/><br/>One of the most unpredictable matches ever! <br/>Do not miss <i><strong>2005 vs. 2007</strong></i>!</big> <br/><br/><i><br/>**MORE TO COME!** <br/>Check <u>dodgeball.livejournal.com</u> this Friday as some of the game's brightest speak up and out about this epic encounter.</i> <br/><br/></center><a href=\"http://photobucket.com/\" rel=\"nofollow\" target=\"_blank\"></a><br/><u><p align=\"center\"><img align=\"middle\" alt=\"\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/D90Logo3BRoadTo.jpg\"/></p>DODGEBALL 87</u> <br/>\"It's time to play the Feud!\" Off-court titans, and sisters, go head to head in one of dodgeball's most unexpected matches of the modern era. The elder <b>Liz Nogueira</b> faces <b>Kathryn Nogueira</b> come May 12. <br/><br/><u>DODGEBALL 88</u> <br/>Unbeaten dodging experts collide! The iconic \"crazy\" <b>Mike Edwards</b> looks to mirror his performance at DODGEBALL 80 when he takes on the equally impressive and a legend in his own right, <b>Mike Butler</b>. Whose streak ends May 19? <br/><br/><u>DODGEBALL 89</u> <br/>Could it be the most anticipated return to the captains circle? The man, the myth, the legend <b>Dan Spengeman</b> returns to action for one night only. It's \"QuickSand\" versus a mystery opponent on May 26. <br/><br/><i>Check back next week following the conclusion of DODGEBALL LXXXVI for an earth-shattering announcement regarding DODGEBALL 90!</i> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/86B.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/D90Logo3BRoadTo.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}