{
  "id": 59754,
  "url": "https://dodgeball.livejournal.com/59754.html",
  "title": ">>> HEATWAVE '07",
  "date": "",
  "body_text": "From the onslaughts of\n2005 vs. 2007\nand\nSister vs. Sister\ncomes the\nHeatWave '07\n! Brace yourself for the absolute hottest matches and kick-ass, in-your-face action as only the warriors of Wall High School can deliver. Prepare to sweat, prepare to bleed, all in the midst of combat.\nThink you're ready to face the heat?\nWe'll just have to wait and see.\nWe're kicking things off with the first of three straight main events, all on\nThe Road to 90\n...\nEDWARDS vs. BUTLER\nCrafty dodgers, impact throwers, fearless combatants, and hell,\nR.A.T.S.\nteammates too! But perhaps the one thing that makes these iron men so distinct can be described in one word:\nundefeated\n. Mix all of these ingredients and you've got a recipe for disaster.\nMike EDWARDS\nThe mammouth challenge of the iconic Kevin Megill was one obstacle damn near impossible to overcome. It was Megill who chopped down the giants and slaughtered the weak establishing a flawless 3 and 0 record for himself. This was the kind of monster Mike Edwards was dealt with entering his debut captains showdown. But there is a reason he's an award-winning, respected veteran of today.\nThose that attended the 80th dodgeball extravaganza will likely never forget the happenings and eventual outcome of the heated match-up. In what some may view as an upset simply based on Edwards's inexperience as team general, it was \"The Crazy One\" who emerged with his hand high in the air, signaling his defeat of the one and only powerhouse Kevin Megill. It was a stunning start to a career just taking off.\nMike BUTLER\nOne man's tryout match and the rebirth of the\nRimshot Contest\nadded fuel to April 2007's DODGEBALL 82.\nIn the anticipated 6th\nRimshot Contest\n, the fighting titan Sara DeCuir emerged as the sole survivor, embarking on the so-called \"Butler Campaign\". Sara's past experience and knowledge as team general certainly gave her the edge heading into this big time showdown. But Butler came to win and little would he have expected the damage left on the court.\nAt the end of the night, seven of the total eight games were deservingly awarded to the debuting captain Mike \"M Bizzle\" Butler, a fine start to quite possibly one of the greatest captains career of all-time.\nUNDEFEATED vs. UNDEFEATED\nHeatWave '07\nbegins with a bang as two unmarked records of 1 and 0 clash on\nThe Road to 90\n. The next level of success awaits the presence of both men. But only one will grab the brass ring.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b><img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/88D1.jpg\" vspace=\"2\">From the onslaughts of <i>2005 vs. 2007</i> and <i>Sister vs. Sister</i> comes the <i>HeatWave '07</i>! Brace yourself for the absolute hottest matches and kick-ass, in-your-face action as only the warriors of Wall High School can deliver. Prepare to sweat, prepare to bleed, all in the midst of combat. <i>Think you're ready to face the heat?</i> We'll just have to wait and see.</img></b> <br/><br/>We're kicking things off with the first of three straight main events, all on <b>The Road to 90</b> ... <br/><br/><center><big><b>EDWARDS vs. BUTLER</b></big></center><br/>Crafty dodgers, impact throwers, fearless combatants, and hell, <i>R.A.T.S.</i> teammates too! But perhaps the one thing that makes these iron men so distinct can be described in one word: <i>undefeated</i>. Mix all of these ingredients and you've got a recipe for disaster. <br/><br/><b>Mike EDWARDS</b> <br/>The mammouth challenge of the iconic Kevin Megill was one obstacle damn near impossible to overcome. It was Megill who chopped down the giants and slaughtered the weak establishing a flawless 3 and 0 record for himself. This was the kind of monster Mike Edwards was dealt with entering his debut captains showdown. But there is a reason he's an award-winning, respected veteran of today. <br/><br/>Those that attended the 80th dodgeball extravaganza will likely never forget the happenings and eventual outcome of the heated match-up. In what some may view as an upset simply based on Edwards's inexperience as team general, it was \"The Crazy One\" who emerged with his hand high in the air, signaling his defeat of the one and only powerhouse Kevin Megill. It was a stunning start to a career just taking off. <br/><br/><b>Mike BUTLER</b> <br/>One man's tryout match and the rebirth of the <i>Rimshot Contest</i> added fuel to April 2007's DODGEBALL 82. <br/><br/>In the anticipated 6th <i>Rimshot Contest</i>, the fighting titan Sara DeCuir emerged as the sole survivor, embarking on the so-called \"Butler Campaign\". Sara's past experience and knowledge as team general certainly gave her the edge heading into this big time showdown. But Butler came to win and little would he have expected the damage left on the court. <br/><br/>At the end of the night, seven of the total eight games were deservingly awarded to the debuting captain Mike \"M Bizzle\" Butler, a fine start to quite possibly one of the greatest captains career of all-time. <br/><br/><center><b><big>UNDEFEATED vs. UNDEFEATED</big></b></center><br/><i>HeatWave '07</i> begins with a bang as two unmarked records of 1 and 0 clash on <i>The Road to 90</i>. The next level of success awaits the presence of both men. But only one will grab the brass ring. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/88D1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}