{
  "id": 60084,
  "url": "https://dodgeball.livejournal.com/60084.html",
  "title": ">>> BOUND For GLORY",
  "date": "",
  "body_text": "HeatWave '07\n, where the most acclaimed and celebrated athletes to ever grace the dodgeball battle grounds clash in several unique, spine-tingling confrontations. Still think you can face the heat?\nEDWARDS vs. BUTLER\nEven in the midst of the damdest\nWet War\n, the flames of this epic encounter were blistering hot. Undefeated, legendary warriors of the time - one bound for glory, the other burned.\nOne could just feel the heat of the unforgiving, high-powered bulletballs ricocheting off the bodies of these brave souls. From DeCuir's \"friendly-fire\" faceshot to unconfirmed reports of a broken finger, DODGEBALL 88 will stand the test of time as one of the most barbaric massacres of the year.\nThe match as a whole lived up to the expectations in every aspect. Rival armies Team EDWARDS and Team BUTLER traded victories during the malignant three-hour melee, completing eleven games by night's end. A mere point decided the fate of one unbeaten superstar.\nEdwards's wins\n: 1, 2, 6, 7, 8, 9\nButler's wins\n: 3, 4, 5, 10, 11\nWho truly knows what the outcome would have been had\nPrison Ball\nnot factored in. Nevertheless, this highly-contested bout will get stampted into the record books, with the Edwards name in the win column.\nThe unmarked captains career of one Mike Butler has come to halt. Mike Edwards takes home the gold in the first of the Triple Main Event.\n\"This was one of the most fun 'Wet Wars' to date, partly because of the comfortable weather. Although we were all saturated, both teams kept the action going strong all night. After May 19, you're more likely to confuse Butler and Edwards because both played like champions.\"\n- CHRIS ADAMS\nMoments & Stars\n: Sara DeCuir in the line of \"friendly-fire\" from Diana DiBuccio; Ryan McCrorey's exceptionally high jumps while imprisoned; The \"no-fear\" debut of Jonathan Edwards\nRecords of 88\n> Attendance: 22\n> Notable Returns: Mark Entwistle (Last appearance at DODGEBALL SIXTY-IX); Kurt Gassner (Last appearance at DODGEBALL 71)\n> New Players: (2) Jodi Holt, Jonathan Edwards\n- DODGEBALL 88 was held on the front courts of Wall High School for the first time since DODGEBALL EIGHTY-THREE in mid-April.\nPrison Ball\nwas brought in at the start of Game 2.\n- DODGEBALL 88 was the unprecedented 20th\nWet War\n, the fifth of Season 9, and the second consecutive. The other\nWet Wars\nwere LXXXI, EIGHTY-THREE, 85, and 87.\n- In part one of the \"Triple Main Event\", Mike Edwards beat Mike Butler, improving his undefeated streak. Edwards is 2-0-0; Butler is 1-1-0.\n- Due to a conflicting work schedule, Kevin Fitzpatrick was unable to attend DODGEBALL 88. He had participated in an astounding 29 straight events, his last absence at DODGEBALL LVIII late last September.\nInjury Update from DODGEBALL 88\nUnconfirmed reports indicate that one Kevin Adams may have suffered a broken right pinky finger, the same injury which plagued the sport last summer. We hope to have an update as soon as information becomes available. On behalf of everyone associated with dodgeball, we wish Kevin the best of luck and hope to see him back on the court in no time.\nDODGEBALL 89\nThe legendary off-court personality of\nDan Spengeman\nmakes his triumphant return this coming Saturday night. Awaiting in the shadows is another award-winning competitor, the fearless high-flyer\nDerek Carty\n. Two recognized names from Season 1 meet in this never-before-seen blockbuster on\nThe Road to 90\n.\nDODGEBALL 90\nThe countdown continues to the biggest match of the year when\nTom Adams\nbattles\nJustin Pierce\non June 2. And this one doesn't end here ...",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"1\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/88A.jpg\" vspace=\"1\"> <br/><i><b>HeatWave '07</b>, where the most acclaimed and celebrated athletes to ever grace the dodgeball battle grounds clash in several unique, spine-tingling confrontations. Still think you can face the heat?</i> <br/><br/><big><b>EDWARDS vs. BUTLER</b></big> <br/>Even in the midst of the damdest <i>Wet War</i>, the flames of this epic encounter were blistering hot. Undefeated, legendary warriors of the time - one bound for glory, the other burned. <br/><br/>One could just feel the heat of the unforgiving, high-powered bulletballs ricocheting off the bodies of these brave souls. From DeCuir's \"friendly-fire\" faceshot to unconfirmed reports of a broken finger, DODGEBALL 88 will stand the test of time as one of the most barbaric massacres of the year. <br/><br/>The match as a whole lived up to the expectations in every aspect. Rival armies Team EDWARDS and Team BUTLER traded victories during the malignant three-hour melee, completing eleven games by night's end. A mere point decided the fate of one unbeaten superstar. <br/><br/><u>Edwards's wins</u>: 1, 2, 6, 7, 8, 9 <br/><u>Butler's wins</u>: 3, 4, 5, 10, 11 <br/><br/>Who truly knows what the outcome would have been had <i>Prison Ball</i> not factored in. Nevertheless, this highly-contested bout will get stampted into the record books, with the Edwards name in the win column.<br/><br/>The unmarked captains career of one Mike Butler has come to halt. Mike Edwards takes home the gold in the first of the Triple Main Event. <br/><br/><i>\"This was one of the most fun 'Wet Wars' to date, partly because of the comfortable weather. Although we were all saturated, both teams kept the action going strong all night. After May 19, you're more likely to confuse Butler and Edwards because both played like champions.\"</i> <br/><b>- CHRIS ADAMS</b> <br/><br/><b>Moments &amp; Stars</b>: Sara DeCuir in the line of \"friendly-fire\" from Diana DiBuccio; Ryan McCrorey's exceptionally high jumps while imprisoned; The \"no-fear\" debut of Jonathan Edwards <br/><br/><big><b>Records of 88</b></big> <br/>&gt; Attendance: 22 <br/>&gt; Notable Returns: Mark Entwistle (Last appearance at DODGEBALL SIXTY-IX); Kurt Gassner (Last appearance at DODGEBALL 71) <br/>&gt; New Players: (2) Jodi Holt, Jonathan Edwards <br/><br/>- DODGEBALL 88 was held on the front courts of Wall High School for the first time since DODGEBALL EIGHTY-THREE in mid-April. <i>Prison Ball</i> was brought in at the start of Game 2. <br/>- DODGEBALL 88 was the unprecedented 20th <i>Wet War</i>, the fifth of Season 9, and the second consecutive. The other <i>Wet Wars</i> were LXXXI, EIGHTY-THREE, 85, and 87. <br/>- In part one of the \"Triple Main Event\", Mike Edwards beat Mike Butler, improving his undefeated streak. Edwards is 2-0-0; Butler is 1-1-0. <br/>- Due to a conflicting work schedule, Kevin Fitzpatrick was unable to attend DODGEBALL 88. He had participated in an astounding 29 straight events, his last absence at DODGEBALL LVIII late last September. <br/><br/><b>Injury Update from DODGEBALL 88</b> <br/>Unconfirmed reports indicate that one Kevin Adams may have suffered a broken right pinky finger, the same injury which plagued the sport last summer. We hope to have an update as soon as information becomes available. On behalf of everyone associated with dodgeball, we wish Kevin the best of luck and hope to see him back on the court in no time. <br/><br/><big><b><img align=\"left\" alt=\"\" hspace=\"1\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/D90Logo3ARoadTo.jpg\" vspace=\"1\"/>DODGEBALL 89</b></big> <br/>The legendary off-court personality of <b>Dan Spengeman</b> makes his triumphant return this coming Saturday night. Awaiting in the shadows is another award-winning competitor, the fearless high-flyer <b>Derek Carty</b>. Two recognized names from Season 1 meet in this never-before-seen blockbuster on <i><b>The Road to 90</b></i>. <br/><br/><big><b>DODGEBALL 90</b></big> <br/>The countdown continues to the biggest match of the year when <b>Tom Adams</b> battles <b>Justin Pierce</b> on June 2. And this one doesn't end here ... </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/88A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/D90Logo3ARoadTo.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}