{
  "id": 60201,
  "url": "https://dodgeball.livejournal.com/60201.html",
  "title": ">>> Out of RETIREMENT",
  "date": "",
  "body_text": "HeatWave '07\nis rockin' with yet another spine-tingling encounter. Best be sure to check this one out come May 26.\nThe second of the Triple Main Event ...\nMay 2006\nThe one and only Joe Kelly was at the absolute top of his game, conquering the greats of the game one right after the other. This competitive era, often called the 2nd Golden Age of dodgeball, shattered long-standing records and truly brought out the best in every player. One year later, it's only fitting to duplicate, or attempt to anyways, the enormous success of last year's mayhem. The finale event of the month will be quite the show-stealing extravaganza as two of the most recognized, and certainly talented stars come out of retirement in a match lost in time.\nMay 2007\nThe long-awaited return of the iconic\nDan Spengeman\nhas been the talk of the town with questions having remained unanswered.\nWhat ever happened to the dodging and blocking extraordinaire?\nSince his horrendous finger incident at DODGEBALL 43 last June, few have seen or even heard from the legendary figure. Sure he's made an appearance from time to time, but he never got back into the swing of things. This up coming 89th spectacular brings the multi-time award winner back onto the court he helped create, even if it's just this once. But another earth-shattering announcement came just weeks later ...\nAt the back court brawl known as DODGEBALL 87, the dodgeball world was stunned by the news that athletic superstar\nDerek Carty\nwould also return to the dance, facing \"QuickSand\" Dan in one ultimate and perhaps forgotten match. The fearless and unpredictable high-flyer Carty is more than ready for the challenge as Season 1 icons share the spotlight.\nCaptains History of Spengeman\nThe wily veteran has an impressive record heading into this never-before-seen clash. An overall standing of 2-1-0, that one loss came by way of a team attraction at DODGEBALL LX. In singles competition, \"Quick Sand\" remains unbeaten.\nCaptains History of Carty\nDerek will certainly be looking to turn his luck around with hopes of ending his miserable streak of consecutive losses. Perhaps no one has suffered as much as he, going 0 and 4 during his entire dodgeball career. The agile veteran has everything to gain heading into this match-up.\nDan Spengeman vs. Derek Carty\nThe final stop on\nThe Road to 90\n________________________________________\n________________\nInjury Update from DODGEBALL 88\nFor those who haven't heard, superstar Kevin Adams's right pinky finger is fortunately not broken. But he did tear some ligaments, an injury that will require six months of healing time. Again, we wish the legend a speedy recovery. He has already made it known that he will not be missing any time away from the court, proving his great resiliency and heart.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>HeatWave '07</i> is rockin' with yet another spine-tingling encounter. Best be sure to check this one out come May 26.<br/><i>The second of the Triple Main Event ...</i><br/><br/><big><b>May 2006</b></big> <br/>The one and only Joe Kelly was at the absolute top of his game, conquering the greats of the game one right after the other. This competitive era, often called the 2nd Golden Age of dodgeball, shattered long-standing records and truly brought out the best in every player. One year later, it's only fitting to duplicate, or attempt to anyways, the enormous success of last year's mayhem. The finale event of the month will be quite the show-stealing extravaganza as two of the most recognized, and certainly talented stars come out of retirement in a match lost in time. <br/><br/><big><img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/89A1.jpg\" vspace=\"2\"><b>May 2007</b></img></big><br/>The long-awaited return of the iconic <b>Dan Spengeman</b> has been the talk of the town with questions having remained unanswered. <i>What ever happened to the dodging and blocking extraordinaire?</i> Since his horrendous finger incident at DODGEBALL 43 last June, few have seen or even heard from the legendary figure. Sure he's made an appearance from time to time, but he never got back into the swing of things. This up coming 89th spectacular brings the multi-time award winner back onto the court he helped create, even if it's just this once. But another earth-shattering announcement came just weeks later ...<br/><br/>At the back court brawl known as DODGEBALL 87, the dodgeball world was stunned by the news that athletic superstar <b>Derek Carty</b> would also return to the dance, facing \"QuickSand\" Dan in one ultimate and perhaps forgotten match. The fearless and unpredictable high-flyer Carty is more than ready for the challenge as Season 1 icons share the spotlight.<br/><br/><u>Captains History of Spengeman</u><br/>The wily veteran has an impressive record heading into this never-before-seen clash. An overall standing of 2-1-0, that one loss came by way of a team attraction at DODGEBALL LX. In singles competition, \"Quick Sand\" remains unbeaten.<br/><br/><u>Captains History of Carty</u><br/>Derek will certainly be looking to turn his luck around with hopes of ending his miserable streak of consecutive losses. Perhaps no one has suffered as much as he, going 0 and 4 during his entire dodgeball career. The agile veteran has everything to gain heading into this match-up.<br/><br/><center><b><big>Dan Spengeman vs. Derek Carty</big></b><br/>The final stop on <i><b>The Road to 90</b></i><br/>________________________________________<wbr/>________________</center><br/><u><i>Injury Update from DODGEBALL 88</i></u><br/>For those who haven't heard, superstar Kevin Adams's right pinky finger is fortunately not broken. But he did tear some ligaments, an injury that will require six months of healing time. Again, we wish the legend a speedy recovery. He has already made it known that he will not be missing any time away from the court, proving his great resiliency and heart. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/89A1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}