{
  "id": 62737,
  "url": "https://dodgeball.livejournal.com/62737.html",
  "title": ">>> OH NO You Didn't GIRLFRIEND!",
  "date": "",
  "body_text": "From the surprise singles and the double gathering comes an unprecedented\nQuadruple Birthday Celebration\n! Just when things couldn't have gotten any more chaotic, you've got four of the most dominant female warriors of all-time running the show.\nLAUREN STOPA\nNot even a severe knee injury is keeping this superstar on the sidelines. The woman responsible for ushering in the \"birthday events\", Stopa changed the course of history as we know it. Remember Pierce's surprise party at DODGEBALL 78? It was all her and now she stands in the very spotlight she created. Get ready.\nDIANA DIBUCCIO\nA mainstay since the inception, what could the tough as nails icon have up her sleeve? Rumors are circulating that she may be out for revenge against arch nemisis Justin Pierce, who's certainly flying high after the most unbelievably successful two weeks ever. But maybe \"The Dribbler\" looks to move on. After all, it was Pierce who given the pleasure of\nCREAMating\nthe big mouth. Whatever the case, its' safe to say expect the unexpected.\nMELISSA KERR\nWithout a doubt, one of the most gifted competitors ever. The titan, the giant killer if you will, may throw the biggest curveball of them all. Will \"Killer Kerr\" keep things simple? Looking back, she has yet to lead a team into battle - could this be her break? Or does she look to break those standing in her way? The waiting game ends June 16.\nVALERIE WINSTON\nShe's\nCREAMated\nher best friend, decimated her \"precious\" sister on countless occasions, and we're just getting started. The secret sideline throw? Yep, Valerie can be held responsible. Just like her sneaky style on the court, this framer may be the wild card at DODGEBALL 92. Who in the hell knows what surprises and shockers she's hiding.\n________________________________________\n____________________________\nDODGEBALL 93\nThe second\nDODGEBALL 100 Captains Drawing\n! More information will become available following the conclusion of DODGEBALL 92. Captains for this event are still in the works.\nDODGEBALL 94\nIt's a thrilling DODGEBALL 84 rematch when painball specialist\nRay Marzarella\nfaces reckless dodger\nSascha Basista\n. Their first encounter ended in a tie. Will this next produce a clearcut winner?\nDODGEBALL 95\nThe highly-anticipated return bout from DODGEBALL 80! The feared legend\nKevin Megill\ngoes one on one with the man who ended his perfect record, \"The Crazy One\"\nMike Edwards\n. Keep in mind though, this time Edwards enters undefeated. Will Megill turn the tables on this historic feud?\n.....\nDODGEBALL 100\nThe phenomenon comes August 18. Mark it down, spread the word.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>From the surprise singles and the double gathering comes an unprecedented <u>Quadruple Birthday Celebration</u>! Just when things couldn't have gotten any more chaotic, you've got four of the most dominant female warriors of all-time running the show.</i> <br/><br/><img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/92F1.jpg\" vspace=\"2\"><b>LAUREN STOPA</b> <br/>Not even a severe knee injury is keeping this superstar on the sidelines. The woman responsible for ushering in the \"birthday events\", Stopa changed the course of history as we know it. Remember Pierce's surprise party at DODGEBALL 78? It was all her and now she stands in the very spotlight she created. Get ready. <br/><br/><b>DIANA DIBUCCIO</b> <br/>A mainstay since the inception, what could the tough as nails icon have up her sleeve? Rumors are circulating that she may be out for revenge against arch nemisis Justin Pierce, who's certainly flying high after the most unbelievably successful two weeks ever. But maybe \"The Dribbler\" looks to move on. After all, it was Pierce who given the pleasure of <i>CREAMating</i> the big mouth. Whatever the case, its' safe to say expect the unexpected. <br/><br/><b>MELISSA KERR</b> <br/>Without a doubt, one of the most gifted competitors ever. The titan, the giant killer if you will, may throw the biggest curveball of them all. Will \"Killer Kerr\" keep things simple? Looking back, she has yet to lead a team into battle - could this be her break? Or does she look to break those standing in her way? The waiting game ends June 16. <br/><br/><b>VALERIE WINSTON</b> <br/>She's <i>CREAMated</i> her best friend, decimated her \"precious\" sister on countless occasions, and we're just getting started. The secret sideline throw? Yep, Valerie can be held responsible. Just like her sneaky style on the court, this framer may be the wild card at DODGEBALL 92. Who in the hell knows what surprises and shockers she's hiding. <br/><center>________________________________________<wbr/>____________________________</center> <br/><big><i>DODGEBALL 93</i></big><br/>The second <b>DODGEBALL 100 Captains Drawing</b>! More information will become available following the conclusion of DODGEBALL 92. Captains for this event are still in the works.<br/><br/><big><i>DODGEBALL 94</i></big><br/>It's a thrilling DODGEBALL 84 rematch when painball specialist <b>Ray Marzarella</b> faces reckless dodger <b>Sascha Basista</b>. Their first encounter ended in a tie. Will this next produce a clearcut winner?<br/><br/><big><i>DODGEBALL 95</i></big><br/>The highly-anticipated return bout from DODGEBALL 80! The feared legend <b>Kevin Megill</b> goes one on one with the man who ended his perfect record, \"The Crazy One\" <b>Mike Edwards</b>. Keep in mind though, this time Edwards enters undefeated. Will Megill turn the tables on this historic feud?<br/><br/>.....<br/><br/><big><i>DODGEBALL 100</i></big><br/>The phenomenon comes August 18. Mark it down, spread the word. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/92F1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}