{
  "id": 64532,
  "url": "https://dodgeball.livejournal.com/64532.html",
  "title": ">>> UNFORGIVEN",
  "date": "",
  "body_text": "The Killer Instinct - Whose heart, whose soul was blackest? Could the imposing southpaw even things up? Or would the crazed maniac pile on another victory?\nWe told you it would get ugly. Two contrasting styles locked horns, each with the same drive and desire to succeed.\nKevin Megill vs. Mike Edwards\n; the rematch the world awaited! There was no remorse, no mercy on the supposed \"luckiest day of the year\" as warriors felt the wrath of one of the most barbaric confrontations in all of dodgeball.\nQuick Match Summary\nWith men the caliber of Megill and Edwards, it was obvious even before the action kicked off that this would come down to the wire.\nBoth squads traded victories for the entire three-hour duration of DODGEBALL 95, in what was a rare \"east side only\" encounter. The score deadlocked at 2, the fifth and eventual final game was thought to break the tie. But it just wasn't meant to be as the lights had shut off at the standard 10:30 mark, signaling the end of one of the most methodical, strategically played events in the history of the game.\nThe action many a time was at a stand still for the simple fact that no one wanted to make that one crucial, tactical error, costing the game and possible match. But what a showdown. The DODGEBALL 80 return bout,\nKevin Megill vs. Mike Edwards II\n, delivered bringing out the absolute best in every competitor.\nKevin Megill fought Mike Edwards to a 2 to 2 Draw. It is very safe to say that a third match will take place sometime down the road. When that will happen remains a mystery.\n________________________________________\n_______________\nThe Final Moments of Game 5: What do you think would have happened?\nTeam EDWARDS would have pulled off the win.\nMegill and Turner would have eventually hit the rim.\nToo close to call.\nMoments & Stars\n: Lauren Stopa and Pam D'Luhy's many eliminations; the tennis post \"eliminating\" one Juan Londono; Alison Bertsch on the receiving end of some nasty bulletball shots\nOnline Exclusive!\nThe original plans for DODGEBALL 95 put rivals Chris Adams and Kevin Fitzpatrick as team co-captains against the unlikely combo of Kevin Megill and Mike Edwards, in a match billed as\nDODGEBALL 70 vs. DODGEBALL 80\n.\nThe idea was nixed however and two singles matches emerged, one just witnessed in part two of the historic Megill/Edwards feud and the other, a\nCREAMation Rules\nencounter scheduled for DODGEBALL 101 between, you guessed it, Chris Adams and Kevin Fitzpatrick.\n________________________________________\n_______________\nRECORDS &\nDODGEBALL 96\n> Attendance: 24\n> Notable Return: Kristen Driscoll (Last appearance at DODGEBALL 85)\n> New Players: (1) Rob Nieratko\n- DODGEBALL 95 was held on the one year anniversary of DODGEBALL 47.\n- The\nLetsche Rims\nserved as team regenerators for the sixth straight week.\n- Every victory was won on the \"east side\", with only four games completed in all. Game 5 was in progress when the lights went out.\n- The DODGEBALL 80 rematch between Mike Edwards and Kevin Megill ended in a rare tie; only the second singles tie in the past nine months (the other being\nSascha vs. Ray\nfrom DODGEBALL 84). Both competitors' records remain impressive as Edwards stands at 2-0-1 while Megill is 4-1-1.\nRob Avakian vs. The World!\nThe suicidal legend himself enters only his second captains match. His opponent will have go through all comers in the returning\nHit the Human\npregame! Check back during the week for all the details on this unique battle.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball95B.jpg\" vspace=\"2\"><i>The Killer Instinct - Whose heart, whose soul was blackest? Could the imposing southpaw even things up? Or would the crazed maniac pile on another victory?</i><br/><br/>We told you it would get ugly. Two contrasting styles locked horns, each with the same drive and desire to succeed. <i>Kevin Megill vs. Mike Edwards</i>; the rematch the world awaited! There was no remorse, no mercy on the supposed \"luckiest day of the year\" as warriors felt the wrath of one of the most barbaric confrontations in all of dodgeball.<br/><br/><u><i>Quick Match Summary</i></u><br/>With men the caliber of Megill and Edwards, it was obvious even before the action kicked off that this would come down to the wire.<br/><br/>Both squads traded victories for the entire three-hour duration of DODGEBALL 95, in what was a rare \"east side only\" encounter. The score deadlocked at 2, the fifth and eventual final game was thought to break the tie. But it just wasn't meant to be as the lights had shut off at the standard 10:30 mark, signaling the end of one of the most methodical, strategically played events in the history of the game.<br/><br/>The action many a time was at a stand still for the simple fact that no one wanted to make that one crucial, tactical error, costing the game and possible match. But what a showdown. The DODGEBALL 80 return bout, <i>Kevin Megill vs. Mike Edwards II</i>, delivered bringing out the absolute best in every competitor.<br/><br/>Kevin Megill fought Mike Edwards to a 2 to 2 Draw. It is very safe to say that a third match will take place sometime down the road. When that will happen remains a mystery. <br/><center>________________________________________<wbr/>_______________<br/><br/><form action=\"http://poll.pollhost.com/vote.cgi\" method=\"post\"><table bgcolor=\"#000000\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"150\"><tr><td colspan=\"2\"><font color=\"#FF0000\" face=\"Arial\" size=\"-1\"><b>The Final Moments of Game 5: What do you think would have happened?</b></font></td></tr><tr><td width=\"5\"><input name=\"answer\" type=\"radio\" value=\"1\"/></td><td><font color=\"#FF0000\" face=\"Arial\" size=\"-1\">Team EDWARDS would have pulled off the win.</font></td></tr><tr><td width=\"5\"><input name=\"answer\" type=\"radio\" value=\"2\"/></td><td><font color=\"#FF0000\" face=\"Arial\" size=\"-1\">Megill and Turner would have eventually hit the rim.</font></td></tr><tr><td width=\"5\"><input name=\"answer\" type=\"radio\" value=\"3\"/></td><td><font color=\"#FF0000\" face=\"Arial\" size=\"-1\">Too close to call.</font></td></tr><tr><td colspan=\"2\"><input name=\"config\" type=\"hidden\" value=\"V1dFQ29vd25lcgkxMTgzOTcwNjEzCTAwMDAwMAlGRjAwMDAJQXJpYWwJT3Jhbmdl\"/><center><input type=\"submit\" value=\"Vote\"/>  <input name=\"view\" type=\"submit\" value=\"View\"/></center></td></tr><tr><td align=\"right\" bgcolor=\"#FFFFFF\" colspan=\"2\"><font color=\"#000000\" face=\"Arial\" size=\"-2\"><a href=\"http://www.pollhost.com/\" rel=\"nofollow\" target=\"_blank\"><font color=\"#000099\"></font></a></font></td></tr></table></form></center><br/><b>Moments &amp; Stars</b>: Lauren Stopa and Pam D'Luhy's many eliminations; the tennis post \"eliminating\" one Juan Londono; Alison Bertsch on the receiving end of some nasty bulletball shots <br/><br/><i><b>Online Exclusive!</b></i><br/>The original plans for DODGEBALL 95 put rivals Chris Adams and Kevin Fitzpatrick as team co-captains against the unlikely combo of Kevin Megill and Mike Edwards, in a match billed as <i>DODGEBALL 70 vs. DODGEBALL 80</i>. <br/><br/>The idea was nixed however and two singles matches emerged, one just witnessed in part two of the historic Megill/Edwards feud and the other, a <i>CREAMation Rules</i> encounter scheduled for DODGEBALL 101 between, you guessed it, Chris Adams and Kevin Fitzpatrick.<br/><center>________________________________________<wbr/>_______________</center><br/><big><b>RECORDS &amp; <i>DODGEBALL 96</i></b></big> <br/>&gt; Attendance: 24 <br/>&gt; Notable Return: Kristen Driscoll (Last appearance at DODGEBALL 85) <br/>&gt; New Players: (1) Rob Nieratko <br/><br/>- DODGEBALL 95 was held on the one year anniversary of DODGEBALL 47.<br/>- The <i>Letsche Rims</i> served as team regenerators for the sixth straight week. <br/>- Every victory was won on the \"east side\", with only four games completed in all. Game 5 was in progress when the lights went out.<br/>- The DODGEBALL 80 rematch between Mike Edwards and Kevin Megill ended in a rare tie; only the second singles tie in the past nine months (the other being <i>Sascha vs. Ray</i> from DODGEBALL 84). Both competitors' records remain impressive as Edwards stands at 2-0-1 while Megill is 4-1-1. <br/><br/><big><u>Rob Avakian vs. The World!</u></big><br/>The suicidal legend himself enters only his second captains match. His opponent will have go through all comers in the returning <i>Hit the Human</i> pregame! Check back during the week for all the details on this unique battle. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball95B.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}