{
  "id": 64937,
  "url": "https://dodgeball.livejournal.com/64937.html",
  "title": ">>> DEAD on Arrival",
  "date": "",
  "body_text": "ROB AVAKIAN and the Return of the\nHIT THE HUMAN\nPregame!\nYou all know what the\nRimshot Contest\nis right? Good. Now, instead of one of those bug infested trash cans or even the colorful, wooden Letsche targets, just take the one thing that's on the receiving end of the most punishment in all of dodgeball: a fellow human being!\nIt's the return of perhaps the most forgotten mini-game ever - the\nHit the Human\npregame contest! The winner will do battle against a man who has built one hell of a reputation for himself, the legendary\nRob Avakian\n! Which gutsy competitor will be battered and bruised even before the action kicks off? And more importantly, will Avakian go on to defeat his unnamed opponent? A must-see event, and it all goes down this Saturday night,\nJuly 14\n! And that's not all!\nDODGEBALL 100 Captains Drawing\nIt's the revelation of the fourth and possible fifth captains to see who will headline DODGEBALL 100 on\nAugust 18\n. Already, the centennial summer spectacular is shaping up to be the biggest and best as icons Justin Pierce, Kevin Adams, and Kevin Fitzpatrick have all won prior drawings. In this next random selection, the remaining \"Top 21\" will have another chance to enter the spotlight they helped create.\nAnd just in case you've forgotten, the \"Top 21\" consists of the following participants:\nAlison Bertsch, Chris Adams, Dan Spengeman, Derek Carty, Diana DiBuccio, John Tronolone, Justin Pierce*, Kevin Adams*, Kevin Fitzpatrick*, Kevin Megill, Lauren Freda, Lauren Winston, Lenny Herrera, Mike Krott, Rob Avakian, Ryan Letsche, Ryan McCrorey, Sara DeCuir, Steve Adams, Tom Adams, Valerie Winston.\nDo not forget though, you\nmust\nattend DODGEBALL 96 for this once in a lifetime opportunity.\n________________________________________\n__________________\nDODGEBALL 100 Promotional Video Release\nAn awesome piece of work put together by Dan Spengeman and John Tronolone.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/96B.jpg\" vspace=\"2\"><big><b>ROB AVAKIAN and the Return of the <i>HIT THE HUMAN</i> Pregame!</b></big><br/>You all know what the <i>Rimshot Contest</i> is right? Good. Now, instead of one of those bug infested trash cans or even the colorful, wooden Letsche targets, just take the one thing that's on the receiving end of the most punishment in all of dodgeball: a fellow human being!<br/><br/>It's the return of perhaps the most forgotten mini-game ever - the <i>Hit the Human</i> pregame contest! The winner will do battle against a man who has built one hell of a reputation for himself, the legendary <b>Rob Avakian</b>! Which gutsy competitor will be battered and bruised even before the action kicks off? And more importantly, will Avakian go on to defeat his unnamed opponent? A must-see event, and it all goes down this Saturday night, <u>July 14</u>! And that's not all!<br/><br/><big><b>DODGEBALL 100 Captains Drawing</b></big><br/>It's the revelation of the fourth and possible fifth captains to see who will headline DODGEBALL 100 on <u>August 18</u>. Already, the centennial summer spectacular is shaping up to be the biggest and best as icons Justin Pierce, Kevin Adams, and Kevin Fitzpatrick have all won prior drawings. In this next random selection, the remaining \"Top 21\" will have another chance to enter the spotlight they helped create. <br/><br/>And just in case you've forgotten, the \"Top 21\" consists of the following participants: <i>Alison Bertsch, Chris Adams, Dan Spengeman, Derek Carty, Diana DiBuccio, John Tronolone, Justin Pierce*, Kevin Adams*, Kevin Fitzpatrick*, Kevin Megill, Lauren Freda, Lauren Winston, Lenny Herrera, Mike Krott, Rob Avakian, Ryan Letsche, Ryan McCrorey, Sara DeCuir, Steve Adams, Tom Adams, Valerie Winston.</i><br/><br/>Do not forget though, you <u>must</u> attend DODGEBALL 96 for this once in a lifetime opportunity.<br/><center><br/>________________________________________<wbr/>__________________<br/><br/><br/><big><big><b>DODGEBALL 100 Promotional Video Release</b></big></big> <br/><br/><iframe allowfullscreen=\"\" class=\"lj_embedcontent\" frameborder=\"0\" height=\"361\" name=\"embed_434169_8\" src=\"https://l.lj-toys.com/?auth_token=sessionless%3A1770591600%3Aembedcontent%3A434169%268%26%26%3Ac556839f4cf73f01d1b2f5c1b223009d11a63df6&amp;moduleid=8&amp;preview=&amp;journalid=434169&amp;noads=\" width=\"448\"></iframe><br/><br/><i>An awesome piece of work put together by Dan Spengeman and John Tronolone.</i></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/96B.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}