{
  "id": 65183,
  "url": "https://dodgeball.livejournal.com/65183.html",
  "title": ">>> Name OF THE Game",
  "date": "",
  "body_text": "HTH Contest #2\nParticipants: Juan Londono, Lauren Stopa, Lauren Winston, Mike Edwards, Mike \"Sputz\" Krott, Ray Marzarella, Ryan Letsche, Valerie Winston.\nThe charismatic Juan Londono nailed victim Justin Pierce after two successful and rather quick rounds, defeating all comers in the second pregame of its kind and moving on to the main event spot of DODGEBALL 96.\nAVAKIAN vs. LONDONO\nThe powerhouses Megill and Tronolone, the titans Kerr, Bertsch, and DiBuccio, and of course the captains, Rob Avakian and Juan Londono. A mid-summer showdown, one of energy, excitement, and dare (I) say \"skillz that thrillz\". This was simply amazing.\nOne of the closest bouts ever recorded, the\nAvakian/Londono\nencounter will unquestionably rank among the best for a number of reasons. First and foremost, the captains were seemingly unstoppable, each proving why they are to be taken seriously. The suicidal, yet agile Rob Avakian put on a dodging clinic while his resilient counterpart possessed the super-glue hands, suckering in enemies into his tricks, catching anything and everything. And that's just the start of it.\nIf Rob and Juan weren't at the frontlines, you can bet powerful new sensation Louie Kossman and the legendary catching machine Mike \"Sputz\" Krott sure as hell were. It was these two warriors that closed out arguably the most thrilling last seconds of any event, as the inexperienced Kossmann eliminated the award-winning icon to earn Team AVAKIAN the match-winning kill.\nBetween Mike Edwards' relentless attempts at catching, the double-team tactics of Lauren Stopa and Valerie Winston, and of course the blocking specialties of\nPondScum\nmember Ray Marzarella, those that came, saw, and experienced DODGEBALL 96 were a part of something magical. You had to see it to believe it.\nRob Avakian defeated\nHit the Human\ncontest winner Juan Londono, 4 to 3, at the 96th dodgeball extravaganza.\nDODGEBALL 100 Captains Drawing Results\nNo doubt, the biggest of them all. Look at the names already -\nKevin Fitzpatrick\n,\nJustin Pierce\n,\nKevin Adams\n, and that's only half! The next competitor in the main event of the greatest spectacle in the historical run of dodgeball is none other than the man who started it all,\nJohn Tronolone\n. Certainly a hard-earned personal victory for the powerful and agile legend.\nMoments & Stars\n: Five-star performances from captains Juan Londono and Rob Avakian; Diana DiBuccio's rather hysterical string of bad breaks and unlucky eliminations; John Tronolone's three rimshots on the night; the incredible finale of Game 7.\nRECORDS\n> Attendance: 23\n> Notable Return: Rob Pellecchia (Last appearance at DODGEBALL 85)\n> New Players: (1) Tom Deluca\n- DODGEBALL 96 played host to just the second\nHit the Human\npregame contest, a simple variation of the popular\nRimshot Contest\n. The volunteer \"victim\" was Justin Pierce, who also served as the first \"victim\" in the dreaded pregame at DODGEBALL LVIII.\n- Rob Avakian picked up the victory against\nHTH\nwinner Juan Londono in perhaps the closest battle in history, 4 games to 3. This was Rob's second time in the captain's chair with a standing record of 1-1-0. Juan has already been in four captains wars since debuting at DODGEBALL 73. This loss puts him at 2-2-0.\n- And yet again, the colorful\nLetsche Rims\nserved as team regenerators.\n________________________________________\n_________\nDODGEBALL 97\nThe\nKnights\nlook to prove their dominance once again. The highly anticipated\nWALL vs. ALL 2\nhits Wall High School July 21.\nDODGEBALL 98\nThe\nWild Card\nMatch coming July 28! Four warriors with absolutely nothing in common pair up in a unique two versus two showdown:\nDan Turner\n,\nLauren Winston\n,\nWesley Hebrew\n,\nJuan Londono\n. What the hell?\nDODGEBALL 99\nArguably ... arguably the greatest female against arguably the greatest male. Two powerhouses, two legends,\nAlison Bertsch\nmeets\nTom Adams\non the one year anniversary of DODGEBALL 50, August 4.\nDODGEBALL 100\nIt all goes down August 18. My God.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/96HTH.jpg\" vspace=\"3\"><u>HTH Contest #2</u><br/>Participants: Juan Londono, Lauren Stopa, Lauren Winston, Mike Edwards, Mike \"Sputz\" Krott, Ray Marzarella, Ryan Letsche, Valerie Winston.<br/><br/>The charismatic Juan Londono nailed victim Justin Pierce after two successful and rather quick rounds, defeating all comers in the second pregame of its kind and moving on to the main event spot of DODGEBALL 96. <br/><br/><big><b>AVAKIAN vs. LONDONO</b></big><br/>The powerhouses Megill and Tronolone, the titans Kerr, Bertsch, and DiBuccio, and of course the captains, Rob Avakian and Juan Londono. A mid-summer showdown, one of energy, excitement, and dare (I) say \"skillz that thrillz\". This was simply amazing.<br/><br/>One of the closest bouts ever recorded, the <i>Avakian/Londono</i> encounter will unquestionably rank among the best for a number of reasons. First and foremost, the captains were seemingly unstoppable, each proving why they are to be taken seriously. The suicidal, yet agile Rob Avakian put on a dodging clinic while his resilient counterpart possessed the super-glue hands, suckering in enemies into his tricks, catching anything and everything. And that's just the start of it.<br/><br/>If Rob and Juan weren't at the frontlines, you can bet powerful new sensation Louie Kossman and the legendary catching machine Mike \"Sputz\" Krott sure as hell were. It was these two warriors that closed out arguably the most thrilling last seconds of any event, as the inexperienced Kossmann eliminated the award-winning icon to earn Team AVAKIAN the match-winning kill. <br/><br/>Between Mike Edwards' relentless attempts at catching, the double-team tactics of Lauren Stopa and Valerie Winston, and of course the blocking specialties of <i>PondScum</i> member Ray Marzarella, those that came, saw, and experienced DODGEBALL 96 were a part of something magical. You had to see it to believe it.<br/><br/>Rob Avakian defeated <i>Hit the Human</i> contest winner Juan Londono, 4 to 3, at the 96th dodgeball extravaganza. <br/><br/><big><b>DODGEBALL 100 Captains Drawing Results</b></big><br/>No doubt, the biggest of them all. Look at the names already - <u>Kevin Fitzpatrick</u>, <u>Justin Pierce</u>, <u>Kevin Adams</u>, and that's only half! The next competitor in the main event of the greatest spectacle in the historical run of dodgeball is none other than the man who started it all, <u>John Tronolone</u>. Certainly a hard-earned personal victory for the powerful and agile legend.<br/><br/><b>Moments &amp; Stars</b>: Five-star performances from captains Juan Londono and Rob Avakian; Diana DiBuccio's rather hysterical string of bad breaks and unlucky eliminations; John Tronolone's three rimshots on the night; the incredible finale of Game 7.<br/><br/><big><b>RECORDS</b></big><br/>&gt; Attendance: 23<br/>&gt; Notable Return: Rob Pellecchia (Last appearance at DODGEBALL 85)<br/>&gt; New Players: (1) Tom Deluca<br/><br/>- DODGEBALL 96 played host to just the second <i>Hit the Human</i> pregame contest, a simple variation of the popular <i>Rimshot Contest</i>. The volunteer \"victim\" was Justin Pierce, who also served as the first \"victim\" in the dreaded pregame at DODGEBALL LVIII.<br/>- Rob Avakian picked up the victory against <i>HTH</i> winner Juan Londono in perhaps the closest battle in history, 4 games to 3. This was Rob's second time in the captain's chair with a standing record of 1-1-0. Juan has already been in four captains wars since debuting at DODGEBALL 73. This loss puts him at 2-2-0.<br/>- And yet again, the colorful <i>Letsche Rims</i> served as team regenerators.<br/><center>________________________________________<wbr/>_________</center><br/><img align=\"left\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/100A4abbbb.jpg\" vspace=\"3\"/><i><big>DODGEBALL 97</big></i><br/>The <i>Knights</i> look to prove their dominance once again. The highly anticipated <b>WALL vs. ALL 2</b> hits Wall High School July 21.<br/><br/><i><big>DODGEBALL 98</big></i><br/>The <i>Wild Card</i> Match coming July 28! Four warriors with absolutely nothing in common pair up in a unique two versus two showdown: <b>Dan Turner</b>, <b>Lauren Winston</b>, <b>Wesley Hebrew</b>, <b>Juan Londono</b>. What the hell? <br/><br/><i><big>DODGEBALL 99</big></i><br/>Arguably ... arguably the greatest female against arguably the greatest male. Two powerhouses, two legends, <b>Alison Bertsch</b> meets <b>Tom Adams</b> on the one year anniversary of DODGEBALL 50, August 4.<br/><br/><i><big>DODGEBALL 100</big></i><br/>It all goes down August 18. My God. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/96HTH.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/100A4abbbb.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}