{
  "id": 65562,
  "url": "https://dodgeball.livejournal.com/65562.html",
  "title": ">>> The KNIGHTMARE",
  "date": "",
  "body_text": "WALL v. ALL 2\nNo more talking - just a non-stop, heart-pounding dodgeball explosion of epic proportions. The hometown heroes Team WALL prepared for the second wave of unwelcomed visitors known as Team ALL.\nJudging by the events that transpired at\nDODGEBALL 93\n, it was clear right from the getgo that the \"misfits\" had no alternative but to formulate a good sound strategy and more importantly, the numbers to pull through. The fearless\nKnights\nneeded all of ten participants last time around, and somehow still managed to pick up what was on paper an upset victory.\nBut the tables had turned for this second clash as the numbers game favored the hometown boys. Though not by a large margin, still, their incredible victory from the previous war proved their overall dominance, overcoming what looked to be a longshot. But along came this heated return war, and the momentum gained from DODGEBALL 93 was savagely used to plow through Team ALL like a plague from hell.\nIn the ultra-competitive return bout, Team WALL not surprisingly vanquished Team ALL 5 to 0. It could be argued that Team ALL was well on their way to a single game victory, but the lights had shut off signaling the end of quite possibly the most physical confrontation ever witnessed. Regardless of the inconclusive Game 6, the\nKnights\nreigned supreme at DODGEBALL 97.\nThe YEARBOOK\nTwelve total players made up Team ALL 2. Returning to competition included those from Ocean Township, Manasquan, Allentown, Monsignor Donovan, Neptune, and Monmouth Regional.\nFourteen\nKnights\ncomprised this second formation of Team WALL.\nMoments & Stars\n: Chris Grasso's exceptional dodging abilities; the numbing ear/faceshot on John Tronolone delivered by Tom Adams; the terrific Game 4 showing from Dan Turner\nRECORDS\n> Attendance: 26\n> Notable Returns: Lenny Herrera (Last appearance at DODGEBALL 87); Dan Karen (Last appearance at DODGEBALL 87)\n> New Players: Andrew Cecchetti, Sean Irons\n- DODGEBALL 97 played host to the\nWALL v. ALL 2\n. Team WALL, much like the first encounter at DODGEBALL 93 came out victorious.\n- A rarity yet again, there were no captains scheduled for the event.\n- The\nLetsche Rims\nwere used for the eigth straight event.\n________________________________________\n___________________\nLess than one month.\nYou heard right ...\nDODGEBALL 98\nThe most random of warriors thrown together to create one \"wild\" event! It's the\nWild Card Match\nwhen\nJuan Londono\nteams with\nWesley Hebrew\nto face\nDan Turner\nand\nLauren Winston\n!\nDODGEBALL 99\nIcons collide when\nAlison Bertsch\ngoes one-on-one with\nTom Adams\n! PLUS, the revelation of the final two DODGEBALL 100 captains! Just wait until you hear what's in store!\nDODGEBALL 100\nThe F*ckin' Big One. This is the moment\nwe've\nbeen waiting for. An event only dreamt about some eons ago will become a reality. The determination, the desire, the pegeantry, the celebration is coming\nAugust 18\n.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b><big>WALL v. ALL 2</big></b> <br/>No more talking - just a non-stop, heart-pounding dodgeball explosion of epic proportions. The hometown heroes Team WALL prepared for the second wave of unwelcomed visitors known as Team ALL.<br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/97B.jpg\" vspace=\"2\"><br/>Judging by the events that transpired at <a href=\"http://dodgeball.livejournal.com\" target=\"_blank\">DODGEBALL 93</a>, it was clear right from the getgo that the \"misfits\" had no alternative but to formulate a good sound strategy and more importantly, the numbers to pull through. The fearless <i>Knights</i> needed all of ten participants last time around, and somehow still managed to pick up what was on paper an upset victory.<br/><br/>But the tables had turned for this second clash as the numbers game favored the hometown boys. Though not by a large margin, still, their incredible victory from the previous war proved their overall dominance, overcoming what looked to be a longshot. But along came this heated return war, and the momentum gained from DODGEBALL 93 was savagely used to plow through Team ALL like a plague from hell. <br/><br/>In the ultra-competitive return bout, Team WALL not surprisingly vanquished Team ALL 5 to 0. It could be argued that Team ALL was well on their way to a single game victory, but the lights had shut off signaling the end of quite possibly the most physical confrontation ever witnessed. Regardless of the inconclusive Game 6, the <i>Knights</i> reigned supreme at DODGEBALL 97.<br/><br/><b>The YEARBOOK</b> <br/>Twelve total players made up Team ALL 2. Returning to competition included those from Ocean Township, Manasquan, Allentown, Monsignor Donovan, Neptune, and Monmouth Regional. <br/><br/>Fourteen <i>Knights</i> comprised this second formation of Team WALL.<br/><br/><b>Moments &amp; Stars</b>: Chris Grasso's exceptional dodging abilities; the numbing ear/faceshot on John Tronolone delivered by Tom Adams; the terrific Game 4 showing from Dan Turner <br/><br/><big><b>RECORDS</b></big> <br/>&gt; Attendance: 26 <br/>&gt; Notable Returns: Lenny Herrera (Last appearance at DODGEBALL 87); Dan Karen (Last appearance at DODGEBALL 87) <br/>&gt; New Players: Andrew Cecchetti, Sean Irons <br/><br/>- DODGEBALL 97 played host to the <b><i>WALL v. ALL 2</i></b>. Team WALL, much like the first encounter at DODGEBALL 93 came out victorious. <br/>- A rarity yet again, there were no captains scheduled for the event.<br/>- The <i>Letsche Rims</i> were used for the eigth straight event.<br/><center>________________________________________<wbr/>___________________</center><br/><h3><i><img align=\"left\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/100A4abbbb.jpg\" vspace=\"2\"/>Less than one month.<br/>You heard right ...</i></h3><i><big>DODGEBALL 98</big></i><br/>The most random of warriors thrown together to create one \"wild\" event! It's the <i>Wild Card Match</i> when <b>Juan Londono</b> teams with <b>Wesley Hebrew</b> to face <b>Dan Turner</b> and <b>Lauren Winston</b>!<br/><br/><i><big>DODGEBALL 99</big></i><br/>Icons collide when <b>Alison Bertsch</b> goes one-on-one with <b>Tom Adams</b>! PLUS, the revelation of the final two DODGEBALL 100 captains! Just wait until you hear what's in store!<br/><br/><i><big>DODGEBALL 100</big></i><br/>The F*ckin' Big One. This is the moment <u>we've</u> been waiting for. An event only dreamt about some eons ago will become a reality. The determination, the desire, the pegeantry, the celebration is coming <u>August 18</u>. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/97B.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/100A4abbbb.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}