{
  "id": 65912,
  "url": "https://dodgeball.livejournal.com/65912.html",
  "title": ">>> DEUCES WILD",
  "date": "",
  "body_text": "This is just plain ... odd.\nAnd you're going to hear it again and again – four warriors with absolutely nothing in common somehow ended up in the same contest! If one looks at the history of captains battles, it's clear most had a purpose. But this one? Not a chance. A DAY 1 titan, a controversial\nPondScum\nfounder, a comedic daredevil, and a former Captains Champion; it's not called the\nWild Card\nMatch for nothing!\nLAUREN WINSTON & DAN TURNER\nYou can almost laugh at this pair. But without a doubt, an unexpected alliance of dodgeball's finest.\nThis is a tremendous opportunity for the youngest Winston sister as she has gone winless in every attempt to defeat the fierce men of the game. Come DODGEBALL 98 and with a man by her side, she has a chance to take down not one, but two on the very same night.\nHer ally will certainly stop at nothing to come out victorious. One of the brains behind the\nInvasion of LX3\nwill indeed have to coexist with the female titan in order to come out on top. Can the inter-gender duo raise their arms high and proud?\nJUAN LONDONO & WESLEY HEBREW\nAnd just when you thought the laughter had ceased.\nLondono, a resilient and sometimes suicidal warrior is set to main event his record-breaking third team war. Will his experience be the key to success at this 98th spectacular?\nIt's about duplication for the so-called \"Pyramid Builder\" Wesley Hebrew. It was he who ended one Lenny Herrera's impressive streak last summer, capturing the Captains Title for the first and only time of his career. With Londono as his partner in crime, can the unpredictable combo defeat their rivals?\n-------- The\nWild Card\nMatch only at DODGEBALL 98! --------",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/98D.jpg\" vspace=\"2\"><b>This is just plain ... odd.</b> <br/><br/>And you're going to hear it again and again – four warriors with absolutely nothing in common somehow ended up in the same contest! If one looks at the history of captains battles, it's clear most had a purpose. But this one? Not a chance. A DAY 1 titan, a controversial <i>PondScum</i> founder, a comedic daredevil, and a former Captains Champion; it's not called the <i>Wild Card</i> Match for nothing!<br/><br/><b><big>LAUREN WINSTON &amp; DAN TURNER</big></b><br/><i>You can almost laugh at this pair. But without a doubt, an unexpected alliance of dodgeball's finest.</i><br/><br/>This is a tremendous opportunity for the youngest Winston sister as she has gone winless in every attempt to defeat the fierce men of the game. Come DODGEBALL 98 and with a man by her side, she has a chance to take down not one, but two on the very same night. <br/><br/>Her ally will certainly stop at nothing to come out victorious. One of the brains behind the <i>Invasion of LX3</i> will indeed have to coexist with the female titan in order to come out on top. Can the inter-gender duo raise their arms high and proud?<br/><br/><b><big>JUAN LONDONO &amp; WESLEY HEBREW</big></b><br/><i>And just when you thought the laughter had ceased.</i> <br/><br/>Londono, a resilient and sometimes suicidal warrior is set to main event his record-breaking third team war. Will his experience be the key to success at this 98th spectacular?<br/><br/>It's about duplication for the so-called \"Pyramid Builder\" Wesley Hebrew. It was he who ended one Lenny Herrera's impressive streak last summer, capturing the Captains Title for the first and only time of his career. With Londono as his partner in crime, can the unpredictable combo defeat their rivals?<br/><br/><center><big>-------- The <u>Wild Card</u> Match only at DODGEBALL 98! --------</big></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/98D.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}