{
  "id": 66125,
  "url": "https://dodgeball.livejournal.com/66125.html",
  "title": ">>> CALORIE Burner",
  "date": "",
  "body_text": "The\nWild Card\nMatch\nLauren Winston & Dan Turner v. Wesley Hebrew & Juan Londono\nIt's all in the name: The\nWild\nCard\nMatch. Two pairs of dodgeball's finest had no alternative but to coexist in an all-or-nothing war for team supremacy!\n\"I felt like I needed to step up my game in the abscense of some of the veterans (tonight) and left my blood, sweat, and tears on the court. My blood came from a diving catch, I was caked in sweat all night from running around like a madman, and my tears came from laughing so hard at the antics and quotes of Diana, Juan, etc. and from just plain having fun.\"\n- RAY MARZARELLA\nThe iconic\nPondScum\nmember is just one of many outstanding superstars who were a part of yet another action-packed showdown. The intense rivalry between veterans Mike Edwards and Kevin Megill reached new heights, each scoring crucial, game-saving eliminations on the other. Plus, a feud nearly two years in the making certainly escalated as powerhouses Kevin Fitzpatrick and John Tronolone were back at each others' throats, perhaps giving those witnesses a tiny preview of what's in store for the summer sizzler DODGEBALL 100.\nYou've got Butler patiently awaiting on the side, the reckless Basista on the ground at every launched bulletball, and Diana DiBuccio screaming her usual absurd phrases could have only produced an insanely fun and \"wild\" DODGEBALL 98.\nProps are definitely deserving to the captains as well as one point seperated the winners from the losers. The oddball duo of former Captains Champion Wesley Hebrew and the \"Cockroach\" Juan Londono gained the fourth and final victory to seal the deal.\nDODGEBALL 98: Hebrew/Londono defeat Winston/Turner, 4 to 3.\nMoments & Stars\n: Ray Marzarella's incredible diving catch; the showdowns between Megill and Edwards, DiBuccio/V. Winston and Londono, and Fitzpatrick/Tronolone; Diana DiBuccio's various \"calorie questions\" to Sascha Basista\nRECORDS\n> Attendance: 22\n> Notable Return: Simon Poalillo (Last appearance at DODGEBALL 89)\n> New Players: Brian Irons, Keith Hebrew\n- DODGEBALL 98 was 10th straight event played on the back courts of Wall High School.\n- The combination of Wesley Hebrew and Juan Londono emerged victorious by a mere point. This was the team battle debut for Wesley, Lauren, and Dan while it was Juan's record-breaking third.\n- In one of dodgeball's rarest occurrences, not one Adams brother was present.\n________________________________________\n______________\nDODGEBALL NINETY-NINE: August 4\nCan you believe it? The final event before \"the big one\" and what a night it is going to be! In the main event, Season 1 icons meet in an epic intergender encounter when\nTom Adams\ntakes on\nAlison Bertsch\n. PLUS, the two remaining DODGEBALL 100 captains positions will be filled by night's end.\nDODGEBALL 100: August 18\nThe chills just have to be running up your spine already. In less than three weeks, the pinnacle of dodgeball will finally take place at the renown Wall High School battlegrounds.\nKevin Fitzpatrick\n,\nJustin Pierce\n,\nJohn Tronolone\n, and\nKevin Adams\nare scheduled to headline this once in a lifetime extravaganza.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/98D.jpg\" vspace=\"2\"><big><b>The <i>Wild Card</i> Match</b></big> <br/><i>Lauren Winston &amp; Dan Turner v. Wesley Hebrew &amp; Juan Londono</i> <br/>It's all in the name: The <i><u>Wild</u> Card</i> Match. Two pairs of dodgeball's finest had no alternative but to coexist in an all-or-nothing war for team supremacy!<br/><br/><i>\"I felt like I needed to step up my game in the abscense of some of the veterans (tonight) and left my blood, sweat, and tears on the court. My blood came from a diving catch, I was caked in sweat all night from running around like a madman, and my tears came from laughing so hard at the antics and quotes of Diana, Juan, etc. and from just plain having fun.\"</i><br/><b>- RAY MARZARELLA</b><br/><br/>The iconic <i>PondScum</i> member is just one of many outstanding superstars who were a part of yet another action-packed showdown. The intense rivalry between veterans Mike Edwards and Kevin Megill reached new heights, each scoring crucial, game-saving eliminations on the other. Plus, a feud nearly two years in the making certainly escalated as powerhouses Kevin Fitzpatrick and John Tronolone were back at each others' throats, perhaps giving those witnesses a tiny preview of what's in store for the summer sizzler DODGEBALL 100.<br/><br/>You've got Butler patiently awaiting on the side, the reckless Basista on the ground at every launched bulletball, and Diana DiBuccio screaming her usual absurd phrases could have only produced an insanely fun and \"wild\" DODGEBALL 98.<br/><br/>Props are definitely deserving to the captains as well as one point seperated the winners from the losers. The oddball duo of former Captains Champion Wesley Hebrew and the \"Cockroach\" Juan Londono gained the fourth and final victory to seal the deal. <br/><br/>DODGEBALL 98: Hebrew/Londono defeat Winston/Turner, 4 to 3.<br/><br/><b>Moments &amp; Stars</b>: Ray Marzarella's incredible diving catch; the showdowns between Megill and Edwards, DiBuccio/V. Winston and Londono, and Fitzpatrick/Tronolone; Diana DiBuccio's various \"calorie questions\" to Sascha Basista<br/><br/><big><b>RECORDS</b></big><br/>&gt; Attendance: 22<br/>&gt; Notable Return: Simon Poalillo (Last appearance at DODGEBALL 89)<br/>&gt; New Players: Brian Irons, Keith Hebrew<br/><br/>- DODGEBALL 98 was 10th straight event played on the back courts of Wall High School.<br/>- The combination of Wesley Hebrew and Juan Londono emerged victorious by a mere point. This was the team battle debut for Wesley, Lauren, and Dan while it was Juan's record-breaking third. <br/>- In one of dodgeball's rarest occurrences, not one Adams brother was present.<br/><center>________________________________________<wbr/>______________</center><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball99Aaa.jpg\" vspace=\"2\"/><big><i><u>DODGEBALL NINETY-NINE: August 4</u></i></big><br/>Can you believe it? The final event before \"the big one\" and what a night it is going to be! In the main event, Season 1 icons meet in an epic intergender encounter when <b>Tom Adams</b> takes on <b>Alison Bertsch</b>. PLUS, the two remaining DODGEBALL 100 captains positions will be filled by night's end. <br/><br/><big><i><u>DODGEBALL 100: August 18</u></i></big><br/>The chills just have to be running up your spine already. In less than three weeks, the pinnacle of dodgeball will finally take place at the renown Wall High School battlegrounds. <b>Kevin Fitzpatrick</b>, <b>Justin Pierce</b>, <b>John Tronolone</b>, and <b>Kevin Adams</b> are scheduled to headline this once in a lifetime extravaganza. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/98D.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball99Aaa.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}