{
  "id": 66883,
  "url": "https://dodgeball.livejournal.com/66883.html",
  "title": ">>> Tough and TIPSY",
  "date": "",
  "body_text": "DODGEBALL 100 Captains: The Final Two\n\"The Piercer\", an Adams brother, powerhouse \"Fitz\", and the self-proclaimed \"Creation\". Four of the best ever in the same bout with two open slots remaining! DODGEBALL NINETY-NINE put the questions to rest.\nJoining the four icons will be none other than \"The Crazy One\"\nMike Edwards\n, having won the fifth random captains drawing. The final captain came by way of the\nLast Chance Rimshot Contest\n, eventually won by now record-setting three-time contest winner, the legendary\nRyan Letsche\n. Congratulations to these two warriors for earning their way into the biggest match in the history of dodgeball.\nBERTSCH vs. ADAMS\nWho ever said the captain was the sharpest knife in the drawer!\nTalk about a curveball being thrown, Team ADAMS was dealt with a rather unusual, but certainly histerical situation. The birthday boy just hours shy of his 21st had already begun the celebration of his life showing up drunk out of his mind, constantly blurting insults and arguing about \"debatable\" calls. But for his female counterpart, the titan Alison Bertsch, the act would not distract her from dismantaling, or attempting to anyways, her opposition.\nFive vicious games for nearly three hours, non-stop, with no one wanting to call it quits. Alison herself is living proof this sport is where only the strong survive, as she was on the receiving end of some stinging shots all over her body, not once making a fuss. Plus, with the inclusion of three nutshots and a report of a broken finger, seems like the aging sport as a whole breathes new life each and every week. And would you have it any other way, especially just two short weeks before the big dance? It's this kind of intense competition coupled with the longterm friendships that have brought the sport to this point. A steller performance from both squads at DODGEBALL NINETY-NINE ...\n... Tom Adams defeated Alison Bertsch, 3 games to 2.\nMoments & Stars\n: Mike Butler, Juan Londono, and John Tronolone all receiving nutshots; Tom Adams's priceless comments, complaints, and plays; Ryan Letsche defeating Lauren Stopa and Mike \"Sputz\" Krott in the finals of the\nLast Chance Rimshot Contest\nInjury Update\nIn an unfortunate situation at this 99th showdown, \"Cockroach\" Juan Londono may have suffered the sport's plaguing pinky finger injury. Juan immediately felt the pain after blocking a rocketed bulletball with a painball. Here at\ndodgeball.livejournal.com\nwe hope to have an update on this situation and can only wish Juan the best.\nRECORDS\n> Attendance: 24\n> Notable Return: Justin Wolf (Last appearance at DODGEBALL LVII)\n> New Players: (1) Brad Burton\n- Ryan Letsche became the first three-time\nRimshot Contest\nwinner, earning the sixth and final spot in the DODGEBALL 100 main event.\n- Alison Bertsch suffered her fourth captains loss whereas Tom moves up the rankings earning this fourth victory overall.\n- DODGEBALL NINETY-NINE fell on or at least near several important dates:\n... Dan Spengeman's 25th birthday\n... the day after Dan Karen's 26th birthday\n... the day before Alison Bertsch's 24th birthday as well as Tom Adams's 21st birthday (the idea behind the captains battle)\n... the one year anniversary of DODGEBALL 50 which hosted the the inaugural\nRimshot Contest\nComing August 18\nThis is without a doubt the single, biggest night in the history of the game and it would be a sin for those who helped create and preserve the sport not to attend. So whether you debuted under the bright lights of Ocean Road Park or battled on the tennis courts of Wall High School, you will not want to miss this.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball99small.jpg\" vspace=\"2\"><big><b>DODGEBALL 100 Captains: The Final Two</b></big><br/>\"The Piercer\", an Adams brother, powerhouse \"Fitz\", and the self-proclaimed \"Creation\". Four of the best ever in the same bout with two open slots remaining! DODGEBALL NINETY-NINE put the questions to rest.<br/><br/>Joining the four icons will be none other than \"The Crazy One\" <b>Mike Edwards</b>, having won the fifth random captains drawing. The final captain came by way of the <i>Last Chance Rimshot Contest</i>, eventually won by now record-setting three-time contest winner, the legendary <b>Ryan Letsche</b>. Congratulations to these two warriors for earning their way into the biggest match in the history of dodgeball. <br/><br/><big><b>BERTSCH vs. ADAMS</b></big><br/><i>Who ever said the captain was the sharpest knife in the drawer!</i><br/><br/>Talk about a curveball being thrown, Team ADAMS was dealt with a rather unusual, but certainly histerical situation. The birthday boy just hours shy of his 21st had already begun the celebration of his life showing up drunk out of his mind, constantly blurting insults and arguing about \"debatable\" calls. But for his female counterpart, the titan Alison Bertsch, the act would not distract her from dismantaling, or attempting to anyways, her opposition.<br/><br/>Five vicious games for nearly three hours, non-stop, with no one wanting to call it quits. Alison herself is living proof this sport is where only the strong survive, as she was on the receiving end of some stinging shots all over her body, not once making a fuss. Plus, with the inclusion of three nutshots and a report of a broken finger, seems like the aging sport as a whole breathes new life each and every week. And would you have it any other way, especially just two short weeks before the big dance? It's this kind of intense competition coupled with the longterm friendships that have brought the sport to this point. A steller performance from both squads at DODGEBALL NINETY-NINE ...<br/><br/>... Tom Adams defeated Alison Bertsch, 3 games to 2.<br/><br/><b>Moments &amp; Stars</b>: Mike Butler, Juan Londono, and John Tronolone all receiving nutshots; Tom Adams's priceless comments, complaints, and plays; Ryan Letsche defeating Lauren Stopa and Mike \"Sputz\" Krott in the finals of the <i>Last Chance Rimshot Contest</i><br/><br/><b>Injury Update</b><br/>In an unfortunate situation at this 99th showdown, \"Cockroach\" Juan Londono may have suffered the sport's plaguing pinky finger injury. Juan immediately felt the pain after blocking a rocketed bulletball with a painball. Here at <i>dodgeball.livejournal.com</i> we hope to have an update on this situation and can only wish Juan the best.<br/><br/><big><b>RECORDS</b></big><br/>&gt; Attendance: 24<br/>&gt; Notable Return: Justin Wolf (Last appearance at DODGEBALL LVII)<br/>&gt; New Players: (1) Brad Burton<br/><br/>- Ryan Letsche became the first three-time <i>Rimshot Contest</i> winner, earning the sixth and final spot in the DODGEBALL 100 main event.<br/>- Alison Bertsch suffered her fourth captains loss whereas Tom moves up the rankings earning this fourth victory overall. <br/>- DODGEBALL NINETY-NINE fell on or at least near several important dates: <br/>... Dan Spengeman's 25th birthday <br/>... the day after Dan Karen's 26th birthday<br/>... the day before Alison Bertsch's 24th birthday as well as Tom Adams's 21st birthday (the idea behind the captains battle) <br/>... the one year anniversary of DODGEBALL 50 which hosted the the inaugural <i>Rimshot Contest</i><br/><br/><center><i><big><big><big><b>Coming August 18</b></big></big></big></i><b><br/><br/><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball100E.jpg\"/></a></b></center><br/><br/><big><big><i>This is without a doubt the single, biggest night in the history of the game and it would be a sin for those who helped create and preserve the sport not to attend. So whether you debuted under the bright lights of Ocean Road Park or battled on the tennis courts of Wall High School, you will not want to miss this.</i></big></big> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball99small.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball100E.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}