{
  "id": 67091,
  "url": "https://dodgeball.livejournal.com/67091.html",
  "title": ">>> MAKE Me FAMOUS!",
  "date": "",
  "body_text": "Alright, so this is the one. The untold story to be told in less than two weeks! For nearly two years, about 300 hours of play, the sport has reached its defining moment in the careers and lives of all those involved. You thought DODGEBALL 20 was the\nClimaXX\n? If there was ever or will ever be a pinnacle or peak, no one could doubt it's the forthcoming summer centennial.\nOH Tracks!\nAn event of this magnitude deserves only the best, whether it's colorful streamers, creative promotional posters, and certainly the energetic music compilation.\nOH Tracks!\n, one hundred record-topping songs from artists of all genres. You'll hear smash hits from the Foo Fighters, Audioslave, and Green Day to the club favorites of yesterday and today; La Bouche, Jay Z, the Wiseguys just to name a few. Throw in some Nonpoint, P.O.D., New Jersey's own Bon Jovi and Sprinsteen, man, this is one collection every single attendee will come to love and enjoy.\nAnd being this is the 100th extravaganza, one theme song just wouldn't do a justice. So included in\nOH Tracks!\nwill be not one, not two, not even three, but\nfour\nofficial theme songs of DODGEBALL 100! Each will kick off a new set of 25 songs ...\n1.\nPuddle of Mudd \"Famous\" (Song #1)\n2.\nVelvet Revolver \"She Builds Quick Machines\" (Song #25)\n3.\nChevelle \"Saturdays\" (Song #50)\n4.\nGuns N' Roses \"Paradise City\" (Song #75)\nSix Way Dance\nThis has been the talk of the town. Literally and figuratively, the biggest showdown in the history of the game. Six of the sport's most recognized athletes will share the spotlight:\nJustin Pierce\n: Won the first of two drawings at\nDODGEBALL 90\n.\nKevin Adams\n: Won the second of two drawings at DODGEBALL 90.\nKevin Fitzpatrick\n: Won a third drawing at\nDODGEBALL 93:\nWall vs. All\n.\nJohn Tronolone\n: Won a fourth drawing at\nDODGEBALL 96\n.\nMike Edwards\n: Won a fifth drawing at\nDODGEBALL NINETY-NINE\n.\nRyan Letsche\n: Won the\nLast Chance Rimshot Contest\nat DODGEBALL NINETY-NINE.\nWith a main event this large and the competitors beyond legendary status, what in the hell could possibly happen? Be sure to check back right here at\ndodgeball.livejournal.com\nfor more on this colossal match-up.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>Alright, so this is the one. The untold story to be told in less than two weeks! For nearly two years, about 300 hours of play, the sport has reached its defining moment in the careers and lives of all those involved. You thought DODGEBALL 20 was the <i>ClimaXX</i>? If there was ever or will ever be a pinnacle or peak, no one could doubt it's the forthcoming summer centennial.</i> <br/><br/><big><b><i>OH Tracks!</i></b></big><br/>An event of this magnitude deserves only the best, whether it's colorful streamers, creative promotional posters, and certainly the energetic music compilation. <i>OH Tracks!</i>, one hundred record-topping songs from artists of all genres. You'll hear smash hits from the Foo Fighters, Audioslave, and Green Day to the club favorites of yesterday and today; La Bouche, Jay Z, the Wiseguys just to name a few. Throw in some Nonpoint, P.O.D., New Jersey's own Bon Jovi and Sprinsteen, man, this is one collection every single attendee will come to love and enjoy. <br/><br/>And being this is the 100th extravaganza, one theme song just wouldn't do a justice. So included in <i>OH Tracks!</i> will be not one, not two, not even three, but <i>four</i> official theme songs of DODGEBALL 100! Each will kick off a new set of 25 songs ...<br/><br/><b>1.</b> Puddle of Mudd \"Famous\" (Song #1)<br/><b>2.</b> Velvet Revolver \"She Builds Quick Machines\" (Song #25)<br/><b>3.</b> Chevelle \"Saturdays\" (Song #50)<br/><b>4.</b> Guns N' Roses \"Paradise City\" (Song #75)<br/><br/><big><b><i>Six Way Dance</i></b></big><br/>This has been the talk of the town. Literally and figuratively, the biggest showdown in the history of the game. Six of the sport's most recognized athletes will share the spotlight:<br/><br/><b><i>Justin Pierce</i></b>: Won the first of two drawings at <a href=\"http://dodgeball.livejournal.com/2007/06/03/\" target=\"_blank\">DODGEBALL 90</a>.<br/><b><i>Kevin Adams</i></b>: Won the second of two drawings at DODGEBALL 90.<br/><b><i>Kevin Fitzpatrick</i></b>: Won a third drawing at <a href=\"http://dodgeball.livejournal.com/2007/06/24/\" target=\"_blank\">DODGEBALL 93: <i>Wall vs. All</i></a>.<br/><b><i>John Tronolone</i></b>: Won a fourth drawing at <a href=\"http://dodgeball.livejournal.com/2007/07/16/\" target=\"_blank\">DODGEBALL 96</a>.<br/><b><i>Mike Edwards</i></b>: Won a fifth drawing at <a href=\"http://dodgeball.livejournal.com/2007/08/06/\" target=\"_blank\">DODGEBALL NINETY-NINE</a>.<br/><b><i>Ryan Letsche</i></b>: Won the <i>Last Chance Rimshot Contest</i> at DODGEBALL NINETY-NINE.<br/><br/>With a main event this large and the competitors beyond legendary status, what in the hell could possibly happen? Be sure to check back right here at <i>dodgeball.livejournal.com</i> for more on this colossal match-up. </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}