{
  "id": 70425,
  "url": "https://dodgeball.livejournal.com/70425.html",
  "title": ">>> The RIVER WAR 2",
  "date": "",
  "body_text": "The DuckTape Mafia\nWould this newly formed squad rise above in this second state-wide competition?\n\"I love the great energy coming from all members, even when our 'lives' were on the line in the second game. Something like that can't be replaced. Thank you all!\"\n- DIANA DIBUCCIO\nWhat an absolutely gutsy performance by the\nMafia\n. The iconic team led by Diana DiBuccio may have come up short in their quest, but boy did they ever prove their heart, desire, and certainly unlimited talents true.\nDuckTape Mafia\nconsisted of Captain Diana DiBuccio, Ray Marzarella, Travis Mills, Rob Avakian, Dan Turner, Lauren Stopa, Rob Pellecchia, Kristen Driscoll, Sascha Basista, and Mike \"Sputz\" Krott.\nThe O.R.P. Knights\nWas their second place victory from February a fluke? Are the\nKnights\nnothing more than a one-hit wonder?\nAfter a rough first loss to the\nWild Stallions\n, the\nKnights\nregained their composure and focus defeating some of the biggest and the baddest the tourny had seen, all in succession. Few will ever forget the trio of Adams taking down an equally athletic threesome in the tourny's first sudden death tie-breaker. Then came the anticipated rematch from February's final, and again it came down to the wire. The dominating\nSkills that Thrillz\nwere red hot once again, eliminating the\nKnights\nfrom competition for the second straight tourny.\nCongrats are certainly in order to this ten-man army for earning a solid 5th place position out of 37.\nO.R.P. Knights\nconsisted of Captain Chris Adams, Justin Pierce, Mike Butler, Tom Adams, Kevin Fitzpatrick, Mike Edwards, Kevin Adams, John Tronolone, Justin Wolf, and team sponsor Kevin Megill.\n________________________________________\n_________________\nIt's about time! The passionate legend\nChris Adams\nfinally goes toe to toe against long-time nemisis, the equally imposing icon himself\nKevin Fitzpatrick\n. This is a rivalry that has spanned every era of the sport; the orginal Ocean Road Park run, the \"Ice Age\" of 2006, and most definitely last year's\nDay Days\n, culminating in an unforgettable match at DODGEBALL 70.\nWill \"Fitz\" be able to mirror his success from last December?\nOr will the eldest Adams tie this memorable series up at 1 apiece?\nAnd one must not forget that this match-up will be contested under\nCREAMation Rules\n! It doesn't get any sweeter!\nCheck back during the week for the final preview as well as information regarding the DODGEBALL 108\nSecret Selection\nvoting procedure.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><b>The DuckTape Mafia</b></big><br/>Would this newly formed squad rise above in this second state-wide competition? <br/><br/><i>\"I love the great energy coming from all members, even when our 'lives' were on the line in the second game. Something like that can't be replaced. Thank you all!\"</i><br/><b>- DIANA DIBUCCIO</b><br/><br/>What an absolutely gutsy performance by the <i>Mafia</i>. The iconic team led by Diana DiBuccio may have come up short in their quest, but boy did they ever prove their heart, desire, and certainly unlimited talents true. <br/><br/><i><u>DuckTape Mafia</u></i> consisted of Captain Diana DiBuccio, Ray Marzarella, Travis Mills, Rob Avakian, Dan Turner, Lauren Stopa, Rob Pellecchia, Kristen Driscoll, Sascha Basista, and Mike \"Sputz\" Krott.<br/><br/><big><b>The O.R.P. Knights</b></big><br/>Was their second place victory from February a fluke? Are the <i>Knights</i> nothing more than a one-hit wonder? <br/><br/>After a rough first loss to the <i>Wild Stallions</i>, the <i>Knights</i> regained their composure and focus defeating some of the biggest and the baddest the tourny had seen, all in succession. Few will ever forget the trio of Adams taking down an equally athletic threesome in the tourny's first sudden death tie-breaker. Then came the anticipated rematch from February's final, and again it came down to the wire. The dominating <i>Skills that Thrillz</i> were red hot once again, eliminating the <i>Knights</i> from competition for the second straight tourny.<br/><br/>Congrats are certainly in order to this ten-man army for earning a solid 5th place position out of 37.<br/><br/><i><u>O.R.P. Knights</u></i> consisted of Captain Chris Adams, Justin Pierce, Mike Butler, Tom Adams, Kevin Fitzpatrick, Mike Edwards, Kevin Adams, John Tronolone, Justin Wolf, and team sponsor Kevin Megill.<br/><br/><center>________________________________________<wbr/>_________________<br/><br/><br/><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105D1.jpg\"/></a></center><br/>It's about time! The passionate legend <b>Chris Adams</b> finally goes toe to toe against long-time nemisis, the equally imposing icon himself <b>Kevin Fitzpatrick</b>. This is a rivalry that has spanned every era of the sport; the orginal Ocean Road Park run, the \"Ice Age\" of 2006, and most definitely last year's <i>Day Days</i>, culminating in an unforgettable match at DODGEBALL 70.<br/><br/>Will \"Fitz\" be able to mirror his success from last December?<br/>Or will the eldest Adams tie this memorable series up at 1 apiece?<br/><br/>And one must not forget that this match-up will be contested under <i><b>CREAMation Rules</b></i>! It doesn't get any sweeter!<br/><br/>Check back during the week for the final preview as well as information regarding the DODGEBALL 108 <i>Secret Selection</i> voting procedure. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105D1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}