{
  "id": 70761,
  "url": "https://dodgeball.livejournal.com/70761.html",
  "title": ">>> ICING on the Cake",
  "date": "",
  "body_text": "DODGEBALL 108's\nSecret Selection\nThe people hold the greatest power! It’s called the\nSecret Selection\n, where competitors have the opportunity to take control of the game, choosing one of three possible gametypes via a single vote.\nThe rare, unpredictable\nFour Team Tournament\nis the first on the ballad. Next, the unorthodox showdown created by the legendary Chris Adams,\nBoxBall Dodgeball\n. And then of course the standard, yet ultra-intense\nClassic Two Team Match-up\n. Three terrific choices, but only one will headline the 108th dodgeball extravaganza.\nVoting for DODGEBALL 108's\nSecret Selection\nwill begin at DODGEBALL 105 and continue for the next two weeks.\nADAMS, FITZPATRICK,\nCREAMation 3\nThis colossal encounter needs no fancy taglines. Undoubtedly, one of the most anticipated matches not only of the year, but in the entire 25-month history of the sport itself. The superpowers finally collide in their long-awaited return bout from\nDODGEBALL 70\n, and this time\nCREAMation Rules\nare in effect.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105C2.jpg\" vspace=\"2\"><big><b>DODGEBALL 108's <i>Secret Selection</i></b></big> <br/>The people hold the greatest power! It’s called the <i>Secret Selection</i>, where competitors have the opportunity to take control of the game, choosing one of three possible gametypes via a single vote. <br/><br/>The rare, unpredictable <b>Four Team Tournament</b> is the first on the ballad. Next, the unorthodox showdown created by the legendary Chris Adams, <b>BoxBall Dodgeball</b>. And then of course the standard, yet ultra-intense <b>Classic Two Team Match-up</b>. Three terrific choices, but only one will headline the 108th dodgeball extravaganza. <br/><br/>Voting for DODGEBALL 108's <i>Secret Selection</i> will begin at DODGEBALL 105 and continue for the next two weeks. <br/><br/><b><big>ADAMS, FITZPATRICK, <i>CREAMation 3</i></big></b> <br/>This colossal encounter needs no fancy taglines. Undoubtedly, one of the most anticipated matches not only of the year, but in the entire 25-month history of the sport itself. The superpowers finally collide in their long-awaited return bout from <a href=\"http://dodgeball.livejournal.com/2007/01/02\" target=\"_blank\">DODGEBALL 70</a>, and this time <i>CREAMation Rules</i> are in effect. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105C2.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}