{
  "id": 70933,
  "url": "https://dodgeball.livejournal.com/70933.html",
  "title": ">>> Blinded by the WHITE",
  "date": "",
  "body_text": "As the iconic Adams put it ever so accurately,\n\"weeks of hype, months of brainstorming, the moment we've all been waiting for! Well, most of us were waiting for. You should've been there!\"\nWithout a doubt, one of the nastiest confrontations in all of dodgeball history! Superpowers indeed collided when the incomparable, powerful\nKevin Fitzpatrick\nfaced off against arch rival, the equally destructive\nChris Adams\nin their long-awaited return bout from DODGEBALL 70. It was \"Fitz\" who had defeated the elder Adams at the massive December slaughter and there wasn't any doubt he would stop at nothing to inflict the same physical and mental anguish this time around. Add in the\nCREAMation Rules\nstipulation, and you have quite possibly the biggest match-up of the year!\nBut unlike the 70th extravaganza, the competition for the now-unforgettable DODGEBALL 105 was an obstacle damn near impossible to overcome, and not just for Adams, but for Fitzpatrick as well. Both parties with full teams in tact played to the absolute best of their abilities.\nJuan Londono proved to be one of Fitzpatrick's most valuable assets, earning two game-winning kills on the night. The ladies like the Winston Sisters and the loud-mouthed Diana DiBuccio also stepped into the forefront and were taking down much of their opposition with ease. But Team ADAMS had acquired some all-stars of its own. Ryan Letsche must have poored glue on his red hot hands, snatching everything in his path, while the self-proclaimed \"Creation\" John Tronolone scored three game-saving team regenerations. By the end of eight full games, the score was deadlocked at four apiece!\nWith time quickly winding down, the final decision came by way of a\nSudden Death\none versus one captains confrontation; no allies, no rims, just mano-e-mano, Adams against Fitzpatrick. But while in the midst of the back court madness, the bright Wall High School lights powered off at the normal 10:30 mark, trapping the 20-plus in attendance in an era of uncertainty! After heavy debate, it was reluctantly agreed upon that the single man showdown would continue on the front courts, with vehicle headlights and that good ole lamppost providing much needed light.\nThe nail-biting, nearly four minute collision would indeed come to a screeching halt when the legendary Adams launched a bulletball into his nemisis's hip.\nAt DODGEBALL 105,\nChris Adams\ndefeated\nKevin Fitzpatrick\n, by winning a\nSudden Death\nshowdown to break the 4 to 4 tie.\n*Official records will read \"4 (1) - 4\".\nOnline Exclusive!\nThe\nAdams/Fitzpatrick\nclash at DODGEBALL 105 was planned nearly three months ahead. Chris easily accepted the match-up, as did \"Fitz\" the night of DODGEBALL 90. The original date was set for August 25 at DODGEBALL 101, but as some may remember, a scheduling conflict prevented these two from going at it.\nMoments & Stars\n: Ryan Letsche's incredible string of catches; John Tronolone's last man standing Game 2 eliminations, rimshot included; the Tom Adams \"schwag\"\nThe 105th RECORDS\n> Attendance: 24\n> Notable Returns: Jim Butler (Last appearance at DODGEBALL LX3); Kristen Driscoll (Last appearance at DODGEBALL 95)\n> New Players: (2) Tricia Conway, Caledonia Guzzi\n- DODGEBALL 105 played host to a number of dodgeball \"firsts\":\n... first\nCREAMation\nsingles match.\n... first\nCREAMation\nto not take place on a season kicker as the first two were featured matches for DODGEBALL LXXXI and DODGEBALL 91.\n... first event where both the Back and Front courts were used.\n... first one-on-one,\nSudden Death\ntie-breaker.\n- Chris Adams captained a team for a record-tying tenth time. Kevin Fitzpatrick was in the captain's chair for the sixth time. Chris is now 6-4-0 and \"Fitz\" is 3-3-0.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nDODGEBALL 106\nCan the fearless dodging extraordinaire\nAvakian\nmake it 2 and 0?\nWill the daredevil\nLondono\nextract a measure of revenge?\nPLUS, the biggest announcement of the season when the\nDODGEBALL 110\nmega-sized main event will be unveiled live in front of the world!\nAll this and more at DODGEBALL 106 on\nOctober 6\n!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> As the iconic Adams put it ever so accurately, <i>\"weeks of hype, months of brainstorming, the moment we've all been waiting for! Well, most of us were waiting for. You should've been there!\"</i><br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105D.jpg\" vspace=\"2\">Without a doubt, one of the nastiest confrontations in all of dodgeball history! Superpowers indeed collided when the incomparable, powerful <b>Kevin Fitzpatrick</b> faced off against arch rival, the equally destructive <b>Chris Adams</b> in their long-awaited return bout from DODGEBALL 70. It was \"Fitz\" who had defeated the elder Adams at the massive December slaughter and there wasn't any doubt he would stop at nothing to inflict the same physical and mental anguish this time around. Add in the <i>CREAMation Rules</i> stipulation, and you have quite possibly the biggest match-up of the year!<br/><br/>But unlike the 70th extravaganza, the competition for the now-unforgettable DODGEBALL 105 was an obstacle damn near impossible to overcome, and not just for Adams, but for Fitzpatrick as well. Both parties with full teams in tact played to the absolute best of their abilities. <br/><br/>Juan Londono proved to be one of Fitzpatrick's most valuable assets, earning two game-winning kills on the night. The ladies like the Winston Sisters and the loud-mouthed Diana DiBuccio also stepped into the forefront and were taking down much of their opposition with ease. But Team ADAMS had acquired some all-stars of its own. Ryan Letsche must have poored glue on his red hot hands, snatching everything in his path, while the self-proclaimed \"Creation\" John Tronolone scored three game-saving team regenerations. By the end of eight full games, the score was deadlocked at four apiece!<br/><br/>With time quickly winding down, the final decision came by way of a <i>Sudden Death</i> one versus one captains confrontation; no allies, no rims, just mano-e-mano, Adams against Fitzpatrick. But while in the midst of the back court madness, the bright Wall High School lights powered off at the normal 10:30 mark, trapping the 20-plus in attendance in an era of uncertainty! After heavy debate, it was reluctantly agreed upon that the single man showdown would continue on the front courts, with vehicle headlights and that good ole lamppost providing much needed light.<br/><br/>The nail-biting, nearly four minute collision would indeed come to a screeching halt when the legendary Adams launched a bulletball into his nemisis's hip.<br/><center><iframe allowfullscreen=\"\" class=\"lj_embedcontent\" frameborder=\"0\" height=\"361\" name=\"embed_434169_10\" src=\"https://l.lj-toys.com/?auth_token=sessionless%3A1770591600%3Aembedcontent%3A434169%2610%26%26%3A7f49f7f82d7fe5a120a41cffbf5acb3cd2095d8e&amp;moduleid=10&amp;preview=&amp;journalid=434169&amp;noads=\" width=\"448\"></iframe></center> At DODGEBALL 105, <b>Chris Adams</b> defeated <b>Kevin Fitzpatrick</b>, by winning a <i>Sudden Death</i> showdown to break the 4 to 4 tie.<br/><i>*Official records will read \"4 (1) - 4\".</i><br/><br/><b><i>Online Exclusive!</i></b><br/>The <i>Adams/Fitzpatrick</i> clash at DODGEBALL 105 was planned nearly three months ahead. Chris easily accepted the match-up, as did \"Fitz\" the night of DODGEBALL 90. The original date was set for August 25 at DODGEBALL 101, but as some may remember, a scheduling conflict prevented these two from going at it.<br/><br/><b>Moments &amp; Stars</b>: Ryan Letsche's incredible string of catches; John Tronolone's last man standing Game 2 eliminations, rimshot included; the Tom Adams \"schwag\"<br/><br/><big><b>The 105th RECORDS</b></big> <br/>&gt; Attendance: 24 <br/>&gt; Notable Returns: Jim Butler (Last appearance at DODGEBALL LX3); Kristen Driscoll (Last appearance at DODGEBALL 95) <br/>&gt; New Players: (2) Tricia Conway, Caledonia Guzzi <br/><br/>- DODGEBALL 105 played host to a number of dodgeball \"firsts\":<br/>... first <i>CREAMation</i> singles match.<br/>... first <i>CREAMation</i> to not take place on a season kicker as the first two were featured matches for DODGEBALL LXXXI and DODGEBALL 91.<br/>... first event where both the Back and Front courts were used.<br/>... first one-on-one, <i>Sudden Death</i> tie-breaker.<br/><br/>- Chris Adams captained a team for a record-tying tenth time. Kevin Fitzpatrick was in the captain's chair for the sixth time. Chris is now 6-4-0 and \"Fitz\" is 3-3-0.<br/><br/><center><big>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</big></center><br/><i><u>DODGEBALL 106</u></i><br/>Can the fearless dodging extraordinaire <b>Avakian</b> make it 2 and 0?<br/>Will the daredevil <b>Londono</b> extract a measure of revenge?<br/><br/>PLUS, the biggest announcement of the season when the <b>DODGEBALL 110</b> mega-sized main event will be unveiled live in front of the world! <br/><br/>All this and more at DODGEBALL 106 on <u>October 6</u>! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball105D.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}