{
  "id": 71180,
  "url": "https://dodgeball.livejournal.com/71180.html",
  "title": ">>> BENNY and JENNY Ain't Got Nothing on Us!",
  "date": "",
  "body_text": "A \"secret\" yet to be revealed, a long-awaited, eagerly anticipated announcement, and two reckless warriors collide once more. Talk about a mighty fine looking line-up, this is it right here!\nDODGEBALL 108\nSecret Selection\nVotes have been tallied thus far and may \"the writer\" say things are looking rather interesting for the forthcoming 108th extravaganza.\nPlayers have the opportunity to choose from one of three gametypes they'd wish to partake in at the October 20th bash: the\nFour Team Tournament\n, the likes of which have not been seen in nearly a year; the chaotic, unorthodox\nBoxBall Dodgeball\n, created by the legendary Chris Adams; and of course the traditional yet always intensly fun\nClassic Two Team Match-Up\n.\nAgain, those individuals who have yet to cast their vote may do so this weekend. But best be sure to attend DODGEBALL 106 because this will be the final time!\nBIG TIME 110\nWe've seen 'em all ... except this one.\nThose who have patiently waited to hear the mega main event for the season finale spectacular\nDODGEBALL CX\non the 3rd of November will be finally be able to breathe once DODGEBALL 106 is all said and done! Make sure your ears are unplugged immediately following the conclusion of Game 2 for this shocking revelation!\nAVAKIAN, LONDONO, Round 2\nWho in the blue hell would have guessed the reemergence of the dreaded\nHit the Human\npregame contest could and would have created this much anarchy!?\nThe reckless daredevils meet yet again when suicidal dodger\nRob Avakian\ngoes toe to toe with the comedic \"Cockroach\" himself,\nJuan Londono\n.\nTheir first encounter was nothing short of spectacular with a climactical ending only seen in movies or envisioned in the most wild of dreams.\nThere isn't any doubt this return battle will live up the hype.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <i>A \"secret\" yet to be revealed, a long-awaited, eagerly anticipated announcement, and two reckless warriors collide once more. Talk about a mighty fine looking line-up, this is it right here!</i><br/><br/><big><b>DODGEBALL 108 <i>Secret Selection</i></b></big><br/>Votes have been tallied thus far and may \"the writer\" say things are looking rather interesting for the forthcoming 108th extravaganza.<br/><br/>Players have the opportunity to choose from one of three gametypes they'd wish to partake in at the October 20th bash: the <u>Four Team Tournament</u>, the likes of which have not been seen in nearly a year; the chaotic, unorthodox <u>BoxBall Dodgeball</u>, created by the legendary Chris Adams; and of course the traditional yet always intensly fun <u>Classic Two Team Match-Up</u>.<br/><br/>Again, those individuals who have yet to cast their vote may do so this weekend. But best be sure to attend DODGEBALL 106 because this will be the final time!<br/><br/><img align=\"right\" alt=\"\" border=\"1\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/106B.jpg\" vspace=\"3\"><big><b>BIG TIME 110</b></big><br/>We've seen 'em all ... except this one.<br/><br/>Those who have patiently waited to hear the mega main event for the season finale spectacular <b>DODGEBALL CX</b> on the 3rd of November will be finally be able to breathe once DODGEBALL 106 is all said and done! Make sure your ears are unplugged immediately following the conclusion of Game 2 for this shocking revelation!<br/><br/><big><b>AVAKIAN, LONDONO, Round 2</b></big><br/>Who in the blue hell would have guessed the reemergence of the dreaded <i>Hit the Human</i> pregame contest could and would have created this much anarchy!? <br/><br/>The reckless daredevils meet yet again when suicidal dodger <b>Rob Avakian</b> goes toe to toe with the comedic \"Cockroach\" himself, <b>Juan Londono</b>. <a href=\"http://dodgeball.livejournal.com/2007/07/16/\" target=\"_blank\">Their first encounter was nothing short of spectacular with a climactical ending only seen in movies or envisioned in the most wild of dreams. </a> There isn't any doubt this return battle will live up the hype. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/106B.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}