{
  "id": 71678,
  "url": "https://dodgeball.livejournal.com/71678.html",
  "title": ">>> Daredevil DASH",
  "date": "",
  "body_text": "AVAKIAN versus LONDONO: Part 2\nThe magic that was DODGEBALL 96, recreated, relived ten events later. It's just one of those things than can spark so much electricity, perhaps best described as\nunforgettable\n.\nLike their previous engagement, team generals Rob Avakian and Juan Londono proved to the world they possess all of the necessary tools and capabilities in becoming two of the all-time greats. These \"daredevils\" stop at nothing, giving a 100% performance, lighting a flame under the asses of their allies.\nSeason 1 superpower Chris Adams, the seemingly unstoppable, soon-to-be season finale headliner Mike Butler, the speedy \"catch me if you can\" prodigy Rob Pellecchia, combined with the never-say-die attitute and non-stop effort of the captains themselves yielded yet another spectacular event from beginning to end.\nAnd if the ultra-intense competition wasn't enough, the hilarious \"study hall\" moment featuring Kristen Driscoll and \"woman killer\" Kevin Megill would have sent anyone home with a glowing smile.\nResults by Game\nAvakian: 2, 3, 8, 11\nLondono: 1, 4, 5, 6, 7, 9, 10, 12\nA \"magical\" win for the Colombian \"Cockroach\" Londono. His ever-resilient, gutsy performance lead to his defeat of the mighty Rob Avakian, 8 to 4, at DODGEBALL 106. This ties their historic series at 1 apiece. It's safe to say a third, and likely final contest will put an end to this brutal war.\nMoments & Stars\n: Mike Butler taking down every member of Team AVAKIAN to win Game 6; Kristen Driscoll and John Tronolone relaxing on court in a camping chair; the consequence for sitting in camping chair while a game is in progress; the comical double elimination on Rob Avakian and Mike \"Sputz\" just moments after the infamous Driscoll/Megill incident; the \"previews\" between CX headliners Kerr/Krott and Bertsch/Butler\n109, CX Announcements!\nCan you say\ninsane\n!? That's just one choice word to describe the unbelievably phenomenal match-ups in store for the conclusion of this unreal 11th Season!\nFirst, a battle between brains and braun of the sport when wily veteran\nRyan Letsche\ntakes on rookie sensation\nJustin Wolf\nat\nDODGEBALL 109\non October 27!\nThen on the grandest stage of all,\nDODGEBALL CX\n, it will be a never-before-seen clash of couples! The beloved yet destructive combo of\nAlison Bertsch\nand\nMike Butler\nwill collide with the dominant twosome of\nMelissa Kerr\nand\nMike \"Sputz\" Krott\n! The most unexpected, shocking encounter in all of dodgeball history! Catch the drama, experience the excitement, feel the electricity of this blockbuster on November 3!\nRECORDS\n> Attendance: 20\n> Notable Returns: Travis Mills (Last appearance at DODGEBALL LXXXVI); Nate Miernik (Last appearance at DODGEBALL NINETY 4)\n> New Players: (2) Tom Hogarty, Blake Tedeschi\n- It has been 15 events since the last\nWet War\n. DODGEBALL 91, also known as the\nCREAMation 2\nwas the last of these slippery events dating back to mid-June 2007.\n- Juan Londono became only the 5th competitor to reach four wins as captain, earning a record of 4-2-0. Rob Avakian unfortunately suffered his second loss of three total matches, now with a record of 1-2-0.\n- Participants and spectators of DODGEBALL 106 were treated to some delicious free pizza thanks to Luke, trays of snacks by Alison Bertsch, and a bag full of Starbucks goodies thanks to Bob Cornero.\n________________________________________\n____________\nWALL v. ALL: The Final Chapter\nCan\nWALL\nclose the casket for good?\nWill\nALL\nbreathe after all is said and done?\nPlus, the results are in! Which did the warriors choose in the DODGEBALL 108\nSecret Selection\n? Find out live this Saturday night at DODGEBALL CVII.\n...........\nJoin the\nDodgeball TML\n!\nMailing lists, emailing lists, Facebook invites, and now the\nTextMessaging List\n! Diehard veterans of yesterday and today will receive up to date news and headlines regarding the weekly extravanganzas! From matches not yet announced to sidelining injuries, added stipulations, website news, and more! So if you get a text message from\nECDodgeball\n, best be sure to check it out! This is your ticket to stay current on all of the happenings on and off the court!\n*Standard text messaging rates apply. Contact John Tronolone or send a text message back to ECDodgeball to cancel.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" border=\"1\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/106B.jpg\" vspace=\"2\"><big><b>AVAKIAN versus LONDONO: Part 2</b></big><br/>The magic that was DODGEBALL 96, recreated, relived ten events later. It's just one of those things than can spark so much electricity, perhaps best described as <i>unforgettable</i>.<br/><br/>Like their previous engagement, team generals Rob Avakian and Juan Londono proved to the world they possess all of the necessary tools and capabilities in becoming two of the all-time greats. These \"daredevils\" stop at nothing, giving a 100% performance, lighting a flame under the asses of their allies.<br/><br/>Season 1 superpower Chris Adams, the seemingly unstoppable, soon-to-be season finale headliner Mike Butler, the speedy \"catch me if you can\" prodigy Rob Pellecchia, combined with the never-say-die attitute and non-stop effort of the captains themselves yielded yet another spectacular event from beginning to end. <br/><br/>And if the ultra-intense competition wasn't enough, the hilarious \"study hall\" moment featuring Kristen Driscoll and \"woman killer\" Kevin Megill would have sent anyone home with a glowing smile. <br/><br/><u>Results by Game</u><br/>Avakian: 2, 3, 8, 11<br/>Londono: 1, 4, 5, 6, 7, 9, 10, 12<br/><br/>A \"magical\" win for the Colombian \"Cockroach\" Londono. His ever-resilient, gutsy performance lead to his defeat of the mighty Rob Avakian, 8 to 4, at DODGEBALL 106. This ties their historic series at 1 apiece. It's safe to say a third, and likely final contest will put an end to this brutal war.<br/><br/><b>Moments &amp; Stars</b>: Mike Butler taking down every member of Team AVAKIAN to win Game 6; Kristen Driscoll and John Tronolone relaxing on court in a camping chair; the consequence for sitting in camping chair while a game is in progress; the comical double elimination on Rob Avakian and Mike \"Sputz\" just moments after the infamous Driscoll/Megill incident; the \"previews\" between CX headliners Kerr/Krott and Bertsch/Butler<br/><br/><img align=\"right\" alt=\"\" border=\"3\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWD1.jpg\" vspace=\"2\"/><b><big>109, CX Announcements!</big></b><br/>Can you say <i>insane</i>!? That's just one choice word to describe the unbelievably phenomenal match-ups in store for the conclusion of this unreal 11th Season!<br/><br/>First, a battle between brains and braun of the sport when wily veteran <b>Ryan Letsche</b> takes on rookie sensation <b>Justin Wolf</b> at <u>DODGEBALL 109</u> on October 27!<br/><br/>Then on the grandest stage of all, <u>DODGEBALL CX</u>, it will be a never-before-seen clash of couples! The beloved yet destructive combo of <b>Alison Bertsch</b> and <b>Mike Butler</b> will collide with the dominant twosome of <b>Melissa Kerr</b> and <b>Mike \"Sputz\" Krott</b>! The most unexpected, shocking encounter in all of dodgeball history! Catch the drama, experience the excitement, feel the electricity of this blockbuster on November 3!<br/><br/><big><b>RECORDS</b></big> <br/>&gt; Attendance: 20 <br/>&gt; Notable Returns: Travis Mills (Last appearance at DODGEBALL LXXXVI); Nate Miernik (Last appearance at DODGEBALL NINETY 4) <br/>&gt; New Players: (2) Tom Hogarty, Blake Tedeschi <br/><br/>- It has been 15 events since the last <i>Wet War</i>. DODGEBALL 91, also known as the <i>CREAMation 2</i> was the last of these slippery events dating back to mid-June 2007.<br/>- Juan Londono became only the 5th competitor to reach four wins as captain, earning a record of 4-2-0. Rob Avakian unfortunately suffered his second loss of three total matches, now with a record of 1-2-0. <br/>- Participants and spectators of DODGEBALL 106 were treated to some delicious free pizza thanks to Luke, trays of snacks by Alison Bertsch, and a bag full of Starbucks goodies thanks to Bob Cornero.<br/><center>________________________________________<wbr/>____________</center><br/><img align=\"right\" alt=\"\" border=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/107AA1.jpg\" vspace=\"2\"/><br/><br/><big>WALL v. ALL: The Final Chapter</big><br/>Can <b>WALL</b> close the casket for good?<br/>Will <b>ALL</b> breathe after all is said and done?<br/><br/>Plus, the results are in! Which did the warriors choose in the DODGEBALL 108 <b>Secret Selection</b>? Find out live this Saturday night at DODGEBALL CVII.<br/><br/><br/>...........<br/><br/><br/><big>Join the <b>Dodgeball TML</b>!</big><br/><i>Mailing lists, emailing lists, Facebook invites, and now the <b>TextMessaging List</b>! Diehard veterans of yesterday and today will receive up to date news and headlines regarding the weekly extravanganzas! From matches not yet announced to sidelining injuries, added stipulations, website news, and more! So if you get a text message from <b>ECDodgeball</b>, best be sure to check it out! This is your ticket to stay current on all of the happenings on and off the court!<br/><br/>*Standard text messaging rates apply. Contact John Tronolone or send a text message back to ECDodgeball to cancel.</i> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/106B.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWD1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/107AA1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}