{
  "id": 72142,
  "url": "https://dodgeball.livejournal.com/72142.html",
  "title": ">>> \"ALL\" OR NOTHING",
  "date": "",
  "body_text": "The Final Chapter ... ?\nThe seemingly interminable reign of chaos and mass destruction was one obstacle damn near impossible for\nTeam ALL\nto overcome. The resourceful group of misfits had this one last breathe to defy the odds.\nTeam WALL\n, the ruthless army united by a common bond, seeked to close the coffin door and nail it shut.\nIf\nDOVER Taken OVER 2\nwas any indication, always be on alert for the \"band of brothers\"; that's right, the Adams Brothers. This near-invincible trio lead the initial assualt like a pack of wolves preying on their helpless, defenseless victims. The score, not surprisingly read 2 to 0.\nGame 3 was a slightly different story however as the strategic, methodical string of grabs by one Kevin Megill temporarily saved the \"misfits\" from the ultimate embarrassment. But to no avail, Team WALL devoured their \"never-say-die\" opposition to remain on top, taking a comfortable 3 to 1 lead.\nThat's when the boxing gloves came off ...\nThe absolutely fearless, athletically-blessed Grant Cornero, the sneaky \"Cockroach\" Juan Londono, the sitting duck (literally!) Mike \"Sputz\" Krott had taken all the punishment one could handle or allow. Crafty dodging maneuvers, hot hands, rocket-launched bulletballs slowly but surely produced positive results. The nail-biting, mano-e-mano showdown between Season 1 icons Chris Adams and John Tronolone arguably proved to be the pivotal turning point, yielding the first tie score since the inaugural\nWALL v. ALL\nclash at\nDODGEBALL 93\n. But the hometown heroes weren't finished just yet.\nFeuled by rage, WALL would resiliently rebound from the consecutive setbacks, regaining the lead by one. But the hunger and drive remained ever-so strong for ALL. Loud-mouth DiBuccio's persistent blocks, Avakian's daredevil tactics, and the onslaught from the Butler Brothers ultimately prevailed in the end. Team ALL proud and loud, raised their hands in victory closing out both the eighth and ninth battles.\nAn emotionally charged 12-on-12 clash between brains, brawn, and everything inbetween; indeed it was\nAll or Nothing\n. The underdogs narrowly escaped defeat against the hometown bad-asses Team WALL, 5 to 4, in truly one of the most physically scarring, mentally draining encounters ever witnessed. This is one long to be remembered.\nEvery warrior put on one hell of a performance at this 107th spectacular. Rimshot king Ryan Letsche, speedy Rob Pellecchia, \"The Big Kat\" Zach Katz, among others should all be applauded for their endless effort.\nFlash Results by Game:\n1, 2, 4, 7 (WALL); 3, 5, 6, 8, 9 (ALL)\nMoments & Stars\n: Chris Adams pelting Juan Londono in the neck; Mike \"Sputz\" Krott's successful string of catches while kneeling; Kevin Megill's game-winning catches during Game 3; Chris Adams's \"grandpa\" shoes and socks\nThe YEARBOOK\nTeam ALL was comprised of competitors from the following schools: Manasquan, Allentown, M.A.S.T., Red Bank Catholic, Neptune, Pt. Pleasant Boro, and Monmouth Regional.\nDODGEBALL 108:\nSecret Selection\nThe results are in and by a single vote, the world will experience\nBoxBall Dodgeball\nfor just the second time in the history of the game.\nVoting Percentages:\n44% ~ BoxBall Dodgeball\n40% ~ Four Team Tournament\n16% ~ Classic Two Team Match-Up\nRECORDS of CVII\n> Attendance: 24\n> Notable Returns: Michelle Mullins (Last appearance at DODGEBALL 90); Rob Nieratko (Last appearance at DODGEBALL 95)\n> New Players: (1) Mike Maoirino\n- DODGEBALL CVII was the first event since DODGEBALL 101 to exclude captains.\n- DODGEBALL CVII hosted the third encounter between rival factions\nTeam WALL\nand\nTeam ALL\n.\nTeam WALL\nemerged victorious in the first two battles.\nHOW COULD YOU FORGET ...\nDODGEBALL 108: October 20, 2007\nThe return of the Chris Adams-created\nBoxBall Dodgeball\n!\n(Take a look back at the first and only BoxBall Dodgeball extravaganza,\nDODGEBALL 79\n. Be sure to check back later in the week for news and updates concerning this most unique event.)\nDODGEBALL 109: October 27, 2007\nRyan Letsche\nversus\nJustin Wolf\n- two of the best one-on-one.\nDODGEBALL CX: November 3, 2007\nThe first-ever \"couples clash\" pitting pairs of the most destructive forces on opposite sides!\nWho would have thought?\nCatching phenom\nMike \"Sputz\" Krott\nteams with the ultra-athletic\nMelissa Kerr\nto take on the sensational\nMike Butler\nand powerful female titan\nAlison Bertsch\n! A never-before-seen encounter and it can only happen at DODGEBALL CX!\n.....\nIt won't get much better than this.\nTreat yourself to these classics.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" border=\"4\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/107C1.jpg\" vspace=\"3\"><big><i><big><b>The Final Chapter ... ?</b></big></i></big><br/><i>The seemingly interminable reign of chaos and mass destruction was one obstacle damn near impossible for <b>Team ALL</b> to overcome. The resourceful group of misfits had this one last breathe to defy the odds. <b>Team WALL</b>, the ruthless army united by a common bond, seeked to close the coffin door and nail it shut.</i><br/><br/>If <i>DOVER Taken OVER 2</i> was any indication, always be on alert for the \"band of brothers\"; that's right, the Adams Brothers. This near-invincible trio lead the initial assualt like a pack of wolves preying on their helpless, defenseless victims. The score, not surprisingly read 2 to 0.<br/><br/>Game 3 was a slightly different story however as the strategic, methodical string of grabs by one Kevin Megill temporarily saved the \"misfits\" from the ultimate embarrassment. But to no avail, Team WALL devoured their \"never-say-die\" opposition to remain on top, taking a comfortable 3 to 1 lead.<br/><br/>That's when the boxing gloves came off ...<br/><br/>The absolutely fearless, athletically-blessed Grant Cornero, the sneaky \"Cockroach\" Juan Londono, the sitting duck (literally!) Mike \"Sputz\" Krott had taken all the punishment one could handle or allow. Crafty dodging maneuvers, hot hands, rocket-launched bulletballs slowly but surely produced positive results. The nail-biting, mano-e-mano showdown between Season 1 icons Chris Adams and John Tronolone arguably proved to be the pivotal turning point, yielding the first tie score since the inaugural <i>WALL v. ALL</i> clash at <a href=\"http://dodgeball.livejournal.com/2007/06/24/\" target=\"_blank\">DODGEBALL 93</a>. But the hometown heroes weren't finished just yet.<br/><br/>Feuled by rage, WALL would resiliently rebound from the consecutive setbacks, regaining the lead by one. But the hunger and drive remained ever-so strong for ALL. Loud-mouth DiBuccio's persistent blocks, Avakian's daredevil tactics, and the onslaught from the Butler Brothers ultimately prevailed in the end. Team ALL proud and loud, raised their hands in victory closing out both the eighth and ninth battles.<br/><br/>An emotionally charged 12-on-12 clash between brains, brawn, and everything inbetween; indeed it was <i>All or Nothing</i>. The underdogs narrowly escaped defeat against the hometown bad-asses Team WALL, 5 to 4, in truly one of the most physically scarring, mentally draining encounters ever witnessed. This is one long to be remembered.<br/><br/>Every warrior put on one hell of a performance at this 107th spectacular. Rimshot king Ryan Letsche, speedy Rob Pellecchia, \"The Big Kat\" Zach Katz, among others should all be applauded for their endless effort.<br/><br/><u>Flash Results by Game:</u> 1, 2, 4, 7 (WALL); 3, 5, 6, 8, 9 (ALL)<br/><br/><b>Moments &amp; Stars</b>: Chris Adams pelting Juan Londono in the neck; Mike \"Sputz\" Krott's successful string of catches while kneeling; Kevin Megill's game-winning catches during Game 3; Chris Adams's \"grandpa\" shoes and socks<br/><br/><b>The YEARBOOK</b><br/>Team ALL was comprised of competitors from the following schools: Manasquan, Allentown, M.A.S.T., Red Bank Catholic, Neptune, Pt. Pleasant Boro, and Monmouth Regional.<br/><br/><big><b>DODGEBALL 108: <i>Secret Selection</i></b></big><br/>The results are in and by a single vote, the world will experience <b>BoxBall Dodgeball</b> for just the second time in the history of the game.<br/><br/><u>Voting Percentages:</u><br/>44% ~ BoxBall Dodgeball<br/>40% ~ Four Team Tournament<br/>16% ~ Classic Two Team Match-Up<br/><br/><big><b>RECORDS of CVII</b></big><br/>&gt; Attendance: 24<br/>&gt; Notable Returns: Michelle Mullins (Last appearance at DODGEBALL 90); Rob Nieratko (Last appearance at DODGEBALL 95)<br/>&gt; New Players: (1) Mike Maoirino<br/><br/>- DODGEBALL CVII was the first event since DODGEBALL 101 to exclude captains.<br/>- DODGEBALL CVII hosted the third encounter between rival factions <i>Team WALL</i> and <i>Team ALL</i>. <i>Team WALL</i> emerged victorious in the first two battles.<br/><br/><img align=\"left\" alt=\"\" border=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWE1.jpg\" vspace=\"3\"/><center><big><big><big>HOW COULD YOU FORGET ...</big></big></big></center><br/><big><i>DODGEBALL 108: October 20, 2007</i></big><br/>The return of the Chris Adams-created <b>BoxBall Dodgeball</b>!<br/><br/><i>(Take a look back at the first and only BoxBall Dodgeball extravaganza, <a href=\"http://dodgeball.livejournal.com/2007/03/11/\" target=\"_blank\"><u>DODGEBALL 79</u></a>. Be sure to check back later in the week for news and updates concerning this most unique event.)</i><br/><br/><big><i>DODGEBALL 109: October 27, 2007</i></big><br/><b>Ryan Letsche</b> versus <b>Justin Wolf</b> - two of the best one-on-one.<br/><br/><big><i>DODGEBALL CX: November 3, 2007</i></big><br/>The first-ever \"couples clash\" pitting pairs of the most destructive forces on opposite sides! <i>Who would have thought?</i> Catching phenom <b>Mike \"Sputz\" Krott</b> teams with the ultra-athletic <b>Melissa Kerr</b> to take on the sensational <b>Mike Butler</b> and powerful female titan <b>Alison Bertsch</b>! A never-before-seen encounter and it can only happen at DODGEBALL CX!<br/><br/>.....<br/><br/><big>It won't get much better than this.<br/>Treat yourself to these classics.</big> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/107C1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWE1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}