{
  "id": 72223,
  "url": "https://dodgeball.livejournal.com/72223.html",
  "title": ">>> The PEOPLE'S Court",
  "date": "",
  "body_text": "BoxBall Dodgeball wins the\nSecret Selection\n:\nFeatured Match for 108th Extravaganza\nUnique? Unorthodox? The makings for a real classic without a doubt! The legendary Season 1 main eventer\nChris Adams\nbrings you the behind-the-scenes story of the birthday celebration few could ever forget, DODGEBALL 79. It was the eldest Adams who was deservingly awarded complete creative control over the March event, and what a truly unforgettable afternoon it turned out to be ...\n.......\nJourney with me through time, back about seven months to March 10, 2007.  I, Chris Adams, turned 25 and this old man was given full responsibility (and privilege) to create his own dodgeball event, rules, and teams.  Hell, even game type.\nWith an idea or two brewing in my mind in the days leading to the event, my mind was somewhat set as to what this event,\nDODGEBALL 79\n, might look like.  And as I approached the back tennis courts at Wall High School, I slowed my pace and glanced around to see all my friends.  I saw them and the decorations they'd set up, and gifts they'd brought.  One decoration caught my eye, particularly:  the streamers strewn across the entire inside perimeter of the courts.  I began to wonder if maybe I could get away with pretending I had something planned from the start... something that didn't suck, anyway, and spanned the entire tennis courts much like the streamers.  So on a whim, speaking aloud as the thoughts came to my mind, I gathered everyone around and explained the rules for what I had thought of thirty seconds prior:\nBoxBall Dodgeball\n.\nThe object of this game type is to utilize two full tennis courts; in other words, the entire area of the back courts at the High School.  With only the blue perimeter adjacent to the fence as the out-of-bounds area, four halves of the court are \"fair game\" to use.  Each team is split into two parts, and each part occupies the opposite side of the opposite court.  Confused yet?\nTake a look at the diagram.  The balls are in the middle of both courts, at the point the four half-teams intersect.  Now you run back to your half-court, and what now?  You're part of Team One and you have two groups of Team Two surrounding you... sucks, huh?  But then, each half of Team Two is surrounded by you and your allies, diagonally across from you.  So everyone in this game is\nsurrounded\nby enemies, but everyone in this game is also\nsurrounding\nenemies.\n.......\nThere is only one Chris Adams that's for sure. The iconic figure himself put his thoughts together in literally a matter of seconds and produced one of the most thrilling, action-packed extravaganzas in the over two-year history of the game.\nSo you're probably wondering how exactly teams will be selected? Well, in lieu of captains, the\nDodgeball Draft\nmakes only its second appearance to help solve this problem!\nYou do not want to miss DODGEBALL 108 live,\nonly at Wall High School.\n*For the history of the\nDodgeball Draft\n, check out\nDODGEBALL 101\n.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/BoxBallDiagram2.jpg\" vspace=\"3\"><big><big>BoxBall Dodgeball wins the <i>Secret Selection</i>:</big><br/><b><i>Featured Match for 108th Extravaganza</i></b></big><br/><i>Unique? Unorthodox? The makings for a real classic without a doubt! The legendary Season 1 main eventer <b>Chris Adams</b> brings you the behind-the-scenes story of the birthday celebration few could ever forget, DODGEBALL 79. It was the eldest Adams who was deservingly awarded complete creative control over the March event, and what a truly unforgettable afternoon it turned out to be ...</i><br/><br/>.......<br/><br/>Journey with me through time, back about seven months to March 10, 2007.  I, Chris Adams, turned 25 and this old man was given full responsibility (and privilege) to create his own dodgeball event, rules, and teams.  Hell, even game type.<br/><br/>With an idea or two brewing in my mind in the days leading to the event, my mind was somewhat set as to what this event, <a href=\"http://dodgeball.livejournal.com/2007/03/11/\" target=\"_blank\">DODGEBALL 79</a>, might look like.  And as I approached the back tennis courts at Wall High School, I slowed my pace and glanced around to see all my friends.  I saw them and the decorations they'd set up, and gifts they'd brought.  One decoration caught my eye, particularly:  the streamers strewn across the entire inside perimeter of the courts.  I began to wonder if maybe I could get away with pretending I had something planned from the start... something that didn't suck, anyway, and spanned the entire tennis courts much like the streamers.  So on a whim, speaking aloud as the thoughts came to my mind, I gathered everyone around and explained the rules for what I had thought of thirty seconds prior: <i>BoxBall Dodgeball</i>.<br/><br/>The object of this game type is to utilize two full tennis courts; in other words, the entire area of the back courts at the High School.  With only the blue perimeter adjacent to the fence as the out-of-bounds area, four halves of the court are \"fair game\" to use.  Each team is split into two parts, and each part occupies the opposite side of the opposite court.  Confused yet?<br/><br/>Take a look at the diagram.  The balls are in the middle of both courts, at the point the four half-teams intersect.  Now you run back to your half-court, and what now?  You're part of Team One and you have two groups of Team Two surrounding you... sucks, huh?  But then, each half of Team Two is surrounded by you and your allies, diagonally across from you.  So everyone in this game is <b>surrounded</b> by enemies, but everyone in this game is also <b>surrounding</b> enemies.<br/><br/>.......<br/><br/><i>There is only one Chris Adams that's for sure. The iconic figure himself put his thoughts together in literally a matter of seconds and produced one of the most thrilling, action-packed extravaganzas in the over two-year history of the game. <br/><br/>So you're probably wondering how exactly teams will be selected? Well, in lieu of captains, the <b>Dodgeball Draft</b> makes only its second appearance to help solve this problem!</i><br/><br/><center><big>You do not want to miss DODGEBALL 108 live,<br/>only at Wall High School.</big></center><br/><br/><br/><i>*For the history of the <b>Dodgeball Draft</b>, check out <a href=\"http://dodgeball.livejournal.com/2007/08/28/\" target=\"_blank\">DODGEBALL 101<a target=\"_blank\">.</a></a></i> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/BoxBallDiagram2.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}