{
  "id": 72487,
  "url": "https://dodgeball.livejournal.com/72487.html",
  "title": ">>> MASTERPIECE of MAYHEM",
  "date": "",
  "body_text": "These warriors are artists. The court is their canvas. This is going to be a masterpierce of mayhem. Only the best can master the art of survival.\nSecret Selection\nChoice\n:\nBoxBall Dodgeball\nTeams formed via the\nDodgeball Draft\nAn explosive, chaotic war for team glory and personal pride! The warriors of the famed Wall High School battlegrounds layed it all on the line in this rare blockbuster. Full impact bodyshots, lip-enlarging faceshots, concussing headshots ... simply put, it was f*ckin' brutal.\nIt wasn't hard to notice the renewal of the enduring, heated rivalries of then and now.\nDODGEBALL 90\nheadliners Justin Pierce and Tom Adams fought tooth and nail for the entire duration of 108. 2005 mogul Kevin Adams and 2007 sensation Grant Cornero fearessly attempted to out-do the other, reminiscent of their awesome match at\nDODGEBALL LXXXVI\n. Fitzpatrick versus C. Adams, Megill against Edwards, and the upcoming main event Wolf versus Letsche were all too intense to handle.\nTeam ONE took the early advantage, mercilessly slaughtering Team TWO in the first three. But it was all the progress TWO would allow, going on a tear for the rest of the night.\nFlash Results by Game\n: 1, 2, 3, 7 (T1); 4, 5, 6, 8, 9, 10, 11 (T2)\nTeam TWO defeated Team ONE, 7 to 4, in a match that witnessed the return of both\nBoxBall Dodgeball\nand the\nDodgeball Draft\n.\nBlood, Sweat, and Tears\nThe\nBoxBall Dodgeball\nstipulation certainly kept participants on their toes. Just the thought of simul-throws from Tom Adams and Chris Adams or Grant Cornero and Justin Pierce would have knocked down and out adversaries in a heartbeat.\nBecause of this, the game's top competitors, past and present, were met with some of the ugliest, nastiest wounds and battle scars ever witnessed. Lauren Stopa was hit three times in the ear, one of which perpetrated by powerhouse Kevin Fitzpatrick. Tom Adams shed first blood on one John Tronolone with an extreme bulletball shot, busting the self-proclaimed \"Creation's\" lip wide open. Sara DeCuir, Chris Adams, Michelle Mullins, Marc Weber, Kevin Megill, and Ryan McCrorey weren't so lucky either, each at one time or another, on the receiving end of one of the countless blows to the face and head.\nMoments & Stars\n: Lauren Stopa's pinpoint accuracy; Diana DiBuccio's \"last woman standing\" catch from Justin Pierce; the sensational \"last man standing\" Game 6 performance by Justin Wolf; successful dodges by Mike \"Sputz\" Krott\n\"Masterpiece of Mayhem\" RECORDS\n> Attendance: 29\n> Notable Returns: Ryan McCrorey (Last appearance at DODGEBALL 100); Sara DeCuir (Last appearance at DODGEBALL 100)\n> New Players: (2) Marc Weber, Andrea Benson\n- DODGEBALL 108 featured the results from the first-ever\nSecret Selection\n. In the weeks leading up to 108, players got the opportunity to choose from one of three gametypes for this event.\nBoxBall Dodgeball\nwon the vote by a slim margin, and thus returned to the dance for a second time in the sport's history.\n- The absence of the captains brought in the\nDodgeball Draft\nfor just the second time, the first of which came at DODGEBALL 101.\n- Team TWO took home the gold defeating Team ONE 7 to 4.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nDOUBLE MAIN EVENT!\nSeason 11 Finale\nDODGEBALL 109\nTeam WALL\ndivided in more ways than one ... legend\nRyan Letsche\nchallenges upstart\nJustin Wolf\nfor all the marbles on\nOctober 27\n!\nDODGEBALL CX\nThe encounter no one thought possible!\nMike Butler\njoins forces with\nAlison Bertsch\nto collide with the mighty duo of\nMike \"Sputz\" Krott\nand\nMelissa Kerr\n! Who will become \"King and Queen\"? Find out at the Season 11 Finale on\nNovember 3\n.\n*This entry falls on the website's two year anniversary.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" border=\"2\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/108DRAFT.jpg\" vspace=\"2\"><i>These warriors are artists. The court is their canvas. This is going to be a masterpierce of mayhem. Only the best can master the art of survival.</i><br/><br/><big><big><b><i><u>Secret Selection</u></i> Choice: <i>BoxBall Dodgeball</i></b></big><br/>Teams formed via the <i>Dodgeball Draft</i></big> <br/><br/>An explosive, chaotic war for team glory and personal pride! The warriors of the famed Wall High School battlegrounds layed it all on the line in this rare blockbuster. Full impact bodyshots, lip-enlarging faceshots, concussing headshots ... simply put, it was f*ckin' brutal.<br/><br/>It wasn't hard to notice the renewal of the enduring, heated rivalries of then and now. <a href=\"http://dodgeball.livejournal.com/2007/06/03/\" target=\"_blank\">DODGEBALL 90</a> headliners Justin Pierce and Tom Adams fought tooth and nail for the entire duration of 108. 2005 mogul Kevin Adams and 2007 sensation Grant Cornero fearessly attempted to out-do the other, reminiscent of their awesome match at <a href=\"http://dodgeball.livejournal.com/2007/05/06/\" target=\"_blank\">DODGEBALL LXXXVI</a>. Fitzpatrick versus C. Adams, Megill against Edwards, and the upcoming main event Wolf versus Letsche were all too intense to handle.<br/><br/>Team ONE took the early advantage, mercilessly slaughtering Team TWO in the first three. But it was all the progress TWO would allow, going on a tear for the rest of the night.<br/><br/><u>Flash Results by Game</u>: 1, 2, 3, 7 (T1); 4, 5, 6, 8, 9, 10, 11 (T2)<br/><br/>Team TWO defeated Team ONE, 7 to 4, in a match that witnessed the return of both <i>BoxBall Dodgeball</i> and the <i>Dodgeball Draft</i>.<br/><br/><b>Blood, Sweat, and Tears</b><br/>The <i>BoxBall Dodgeball</i> stipulation certainly kept participants on their toes. Just the thought of simul-throws from Tom Adams and Chris Adams or Grant Cornero and Justin Pierce would have knocked down and out adversaries in a heartbeat.<br/><br/>Because of this, the game's top competitors, past and present, were met with some of the ugliest, nastiest wounds and battle scars ever witnessed. Lauren Stopa was hit three times in the ear, one of which perpetrated by powerhouse Kevin Fitzpatrick. Tom Adams shed first blood on one John Tronolone with an extreme bulletball shot, busting the self-proclaimed \"Creation's\" lip wide open. Sara DeCuir, Chris Adams, Michelle Mullins, Marc Weber, Kevin Megill, and Ryan McCrorey weren't so lucky either, each at one time or another, on the receiving end of one of the countless blows to the face and head.<br/><br/><b>Moments &amp; Stars</b>: Lauren Stopa's pinpoint accuracy; Diana DiBuccio's \"last woman standing\" catch from Justin Pierce; the sensational \"last man standing\" Game 6 performance by Justin Wolf; successful dodges by Mike \"Sputz\" Krott<br/><br/><big><b>\"Masterpiece of Mayhem\" RECORDS</b></big><br/>&gt; Attendance: 29<br/>&gt; Notable Returns: Ryan McCrorey (Last appearance at DODGEBALL 100); Sara DeCuir (Last appearance at DODGEBALL 100)<br/>&gt; New Players: (2) Marc Weber, Andrea Benson<br/><br/>- DODGEBALL 108 featured the results from the first-ever <i>Secret Selection</i>. In the weeks leading up to 108, players got the opportunity to choose from one of three gametypes for this event. <i>BoxBall Dodgeball</i> won the vote by a slim margin, and thus returned to the dance for a second time in the sport's history. <br/>- The absence of the captains brought in the <i>Dodgeball Draft</i> for just the second time, the first of which came at DODGEBALL 101.<br/>- Team TWO took home the gold defeating Team ONE 7 to 4.<center><h2> ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</h2></center><img align=\"right\" alt=\"\" border=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DBCXmatchup.jpg\" vspace=\"2\"/><center><big><big><b>DOUBLE MAIN EVENT!</b></big><br/>Season 11 Finale</big></center><br/><big><i>DODGEBALL 109</i></big><br/><i>Team WALL</i> divided in more ways than one ... legend <b>Ryan Letsche</b> challenges upstart <b>Justin Wolf</b> for all the marbles on <u>October 27</u>!<br/><br/><big><i>DODGEBALL CX</i></big><br/>The encounter no one thought possible! <b>Mike Butler</b> joins forces with <b>Alison Bertsch</b> to collide with the mighty duo of <b>Mike \"Sputz\" Krott</b> and <b>Melissa Kerr</b>! Who will become \"King and Queen\"? Find out at the Season 11 Finale on <u>November 3</u>.<br/><br/><br/><br/><i>*This entry falls on the website's two year anniversary.</i> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/108DRAFT.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DBCXmatchup.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}