{
  "id": 73906,
  "url": "https://dodgeball.livejournal.com/73906.html",
  "title": ">>> Harder, Better, Faster, STRONGER III: The Results",
  "date": "",
  "body_text": "Two roads on a collision course each with the will and desire to be the called the best - the \"King and Queen\"!\nThere would be no\nRockPaperScissor\non this special night as each of the four captains -\nBertsch, Butler, Kerr, Krott\n- prior to DODGEBALL CX had mutually agreed on a \"captains-only\" two-on-two showdown to kick things off. The reward wasn't just pride or bragging rights as the sole survivors would not only gain the first\ntwo\nsoldiers for their army, but earn Game 1 of this monumental 110th extravaganza. Plenty was on the line and neither couple could afford to make that one, crucial error.\nIn the pre-game brawl*, catching phenom Mike \"Sputz\" Krott took out powerhouse Alison Bertsch just moments before Melissa \"Killer\" Kerr was harshly eliminated by the quick-witted Mike Butler. The men were all that remained and after some near misses and close calls, Krott fell to Butler ...\nTeam B used the momentum to plow through their gutsy opposition in the early goings of CX. B\n2\nweren't too kind to the \"security\" - it was damn near-impossible to hit prodigy Pellecchia as well as withstand a nasty, impactful bulletball bodyshot from sensation Chris Everett.\nBut the catching phenom had withstood enough and the very attribute that made him a big time player was unleashed like a plague from hell. Along with \"giant killer\" Kerr and dynamite first round choice Kevin Fitzpatrick by his side, rims were smacked, opponents annihilated, turning the tables on this four-hour mastierpierce of carnage and chaos.\nTeam K had a golden opportunity to tie things up in Game 6, but to no avail, the momentum unluckily shifted yet again. B\n2\nwent on a two game tear, jumping ahead by three as the event neared its end. Round 8 would eventually belong to K\n2\n, only to be followed by a sixth and final loss.\nFlash Results by Game\n: 1*, 2, 3, 6, 7, 9 (B\n2\n); 4, 5, 8 (K\n2\n)\nAlison Bertsch\nand\nMike Butler\ndefeated\nMelissa Kerr\nand\nMike \"Sputz\" Krott\n, 6 to 3, in the first ever \"Couples\" Team Attraction in history.\nSeason 11\n~ The return of\nBoxBall Dodgeball\n, the introduction of the\nDodgeball Draft\n, Chris Adams against Kevin Fitzpatrick in the mid-season\nCREAMation 3\n, and the shocking defeat of Team WALL were just some of the highlights over the course of this amazing 11th Season.\n~ Average attendance was an impressive 26.2. The sport witnessed the introduction of an incredible 28 new stars.\n~ Not a single\nWet War\nduring Season 11, spanning from late-August to early-November.\n~ Juan Londono, Chris Adams, John Tronolone, and Diana DiBuccio attended all Season 11 events.\nDODGEBALL CX\n~ Streamer-flags, table cloth flags [thanks to old shower curtain rods], and streamers draped along the fence and tennis courts brightened up the atmosphere.\n~ First pair-pick for Butler/Bertsch:\nJohn Tronolone & Chris Adams\n~ First pair-pick for Krott/Kerr:\nKevin Fitzpatrick & Mike Edwards\n~ Because of daylight savings time, the bright Wall High School lights stayed on an additional full hour - only the warriors were celebrating at Pete and Elda's!\nTraCX\nYet another outstanding music compliation, full of variety and energy. The successor of the popular\nOH Tracks!\nstarted with official theme song \"Stronger\" by Kanye West, kicking-off an awesome four-hours of non-stop, hip-hop, rockin' anthems from all genres; \"Testify\" by Rage Against the Machine, \"The Pretender\" by the Foo Fighters, Flyleaf's \"Fully Alive\", E.M.F.'s \"Unbelievable\", and yes, even the double-trouble Jay Z/Beyonce hit \"Bonnie and Clyde\".\nDODGEBALL CX1 Announcement\nThe fierce bout from\nDODGEBALL LXXXVI\nreturns ... Announced at DODGEBALL CX,\nKevin Adams\nclashes with\nGrant Cornero\nat DODGEBALL CX1 on November 10. Looks like it's going to be a kick-ass Season 12, and that's just the start!\nOnline Exclusives!\nWhen and why did Dan Turner leave? Where in the hell was Kevin Megill?\nCome on, with an overwhelming 39 warriors, how can you not expect sh*t to go down! The good, the bad, and the ugly about \"Big Time 110\":\n~ The uncanny power of newcomer \"red shirt\" Chris Everett.\n~ Kevin Fitzpatrick vicious nutshot on Kevin Adams in the first few minutes of the CX.\n~ \"Killer\" Kerr's dominating Game 5 \"Last Woman Standing\" performance, life-saving rimshot included.\n~ The hilarious Juan Londono-lead charges of \"Freedom!\", \"Duritos!\", and \"Maria!\".\n~ Constant arguments breaking out over debatable eliminations and rimshots.\n~ The one-handed catch by legend Kevin Adams.\n~ The numerous head and faceshots delivered to Melissa Kerr, Jim Butler, Pam D'Luhy, Captain Alison Bertsch, among others.\n~ Rob Pellecchia's crucial Game 6 \"Last Man Standing\" showing.\n~ Double-eliminations on Fitzpatrick/DiBuccio, Maiorino/Basista, Tronolone/T.Adams, E.Bitsko/DiBuccio, among a few others.\n~ Captain \"Sputz\" Krott's fast and furious catches midway through CX.\n~ Valerie Winston's priceless mid-court fall holding one of the streamer-flags.\n~ Captain Mike Butler earning the final kill of the night against the reckless Sascha Basista.\nAn astounding\n39\nparticipated at DODGEBALL CX, tied for the 5th highest attendance along with DODGEBALL 71 and DODGEBALL NINETY 4. Thirty-one men and eight women comprised the awesome turnout.\nDODGEBALL CX welcomed\nsix new stars\nin Elizabeth Bitsko, Jeff Brown, Josh Mieloch, Kyrell Palmer, Tom Cowling, and Chris Everett.\nNotable returns include: Matt Brown (last competed at DB70); Luke Devlin (last competed at DB90); Brent Bitsko (last competed at DB100); Pam D'Luhy (last competed at DB100); Dan Turner (last competed at DB101); Joey Smalls (Last competed at DB104)\nDODGEBALL CX was the fifth season finale held on the back courts of Wall High School. It was the fourth to include the popular\nLetsche Rims\nas form of team regeneration.\nThe official theme song was \"Stronger\" by Kanye West.\nThe only woman to headline a season finale spectacular before DODGEBALL CX was Sara DeCuir at DODGEBALL LX in late-October 2006. She was not present at this Season 11 conclusion however.\nIn the colossal main event, Mike Butler and Alison Bertsch defeated Mike \"Sputz\" Krott and Melissa Kerr, 6 to 3. This match was unique in that it was \"couple vs. couple\", something never witnessed before. Each pair of co-captains wore matching outfits for the occasion. And rather than the usual first pick by way of winning\nRockPaperScissor\n, the captains started the show, two-versus-two, with the winners not only gaining the first\ntwo\nallies, but earning the first point of the night's match. This was the first time in the two year-plus history that teams were formed by picking two players at a time instead of the standard one.\n--\nAlison Bertsch\nmade her ten event captains debut. Her record after CX is 2-4-1.\n--\nMike Butler\nmade his ten event captains debut. His record now stands at 2-1-0.\n--\nMelissa Kerr\ncompeted in her very first captains confrontation.\n--\nMike \"Sputz\" Krott\ncompeted in his very first captains confrontation.\nExcluding DODGEBALL CX newblood, the following competitors made their ten event debut: Marc Weber and Mike Maiorino.\nAnd because of their participation, Kevin Adams and John Tronolone remain as the only two competitors to have partaken in all 11 season finale events.\nStreamers Everywhere!\nThanks!\nto John Tronolone for setting up the various decorations around the court. Ryan Letsche, Kevin Fitzpatrick, and Mike Maiorino also lent a helping hand.\nTraCX\nSoundtrack!\nSpecial\nThanks!\nto Lauren Winston for the use of her iPod and John Tronolone for putting the soundtrack together. Michael Tronolone, Bob Cornero, Alison Bertsch, and Kathryn Nogueira are also thanked for their various contributions towards this awesome playlist.\nNever Duplicated!\nDo you ever ask yourself what you'd be doing without the mayhem and madness that is dodgeball? It's been over two-years and time and time again, you'll hear it ...\nThank You\nto those who have traveled through the times and helped create unforgettable moments and memories for the last 26 months. It's because of you that Saturdays are just so damn fun.\nThe glitz, the glamour, the game that was DODGEBALL CX ... what did you think?\nA ... Now that's dodgeball.\nB ... I liked it.\nC ... Not bad, but still a little disappointed.\nD ... Barely passed.\nE ... Ouch.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWJ1.jpg\" vspace=\"3\"><center><i><b>Two roads on a collision course each with the will and desire to be the called the best - the \"King and Queen\"!</b></i></center><br/><br/><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXmainevent.jpg\"/></a><br/><br/>There would be no <i>RockPaperScissor</i> on this special night as each of the four captains - <b>Bertsch, Butler, Kerr, Krott</b> - prior to DODGEBALL CX had mutually agreed on a \"captains-only\" two-on-two showdown to kick things off. The reward wasn't just pride or bragging rights as the sole survivors would not only gain the first <i>two</i> soldiers for their army, but earn Game 1 of this monumental 110th extravaganza. Plenty was on the line and neither couple could afford to make that one, crucial error.<br/><br/>In the pre-game brawl*, catching phenom Mike \"Sputz\" Krott took out powerhouse Alison Bertsch just moments before Melissa \"Killer\" Kerr was harshly eliminated by the quick-witted Mike Butler. The men were all that remained and after some near misses and close calls, Krott fell to Butler ... <br/><br/>Team B used the momentum to plow through their gutsy opposition in the early goings of CX. B<small>2</small> weren't too kind to the \"security\" - it was damn near-impossible to hit prodigy Pellecchia as well as withstand a nasty, impactful bulletball bodyshot from sensation Chris Everett.<br/><br/>But the catching phenom had withstood enough and the very attribute that made him a big time player was unleashed like a plague from hell. Along with \"giant killer\" Kerr and dynamite first round choice Kevin Fitzpatrick by his side, rims were smacked, opponents annihilated, turning the tables on this four-hour mastierpierce of carnage and chaos.<br/><br/>Team K had a golden opportunity to tie things up in Game 6, but to no avail, the momentum unluckily shifted yet again. B<small>2</small> went on a two game tear, jumping ahead by three as the event neared its end. Round 8 would eventually belong to K<small>2</small>, only to be followed by a sixth and final loss.<br/><br/><u>Flash Results by Game</u>: 1*, 2, 3, 6, 7, 9 (B<small>2</small>); 4, 5, 8 (K<small>2</small>)<br/><br/><b>Alison Bertsch</b> and <b>Mike Butler</b> defeated <b>Melissa Kerr</b> and <b>Mike \"Sputz\" Krott</b>, 6 to 3, in the first ever \"Couples\" Team Attraction in history.<br/><br/><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXfacts.jpg\"/></a><br/><br/><u><big><i>Season 11</i></big></u><br/>~ The return of <i>BoxBall Dodgeball</i>, the introduction of the <i>Dodgeball Draft</i>, Chris Adams against Kevin Fitzpatrick in the mid-season <i>CREAMation 3</i>, and the shocking defeat of Team WALL were just some of the highlights over the course of this amazing 11th Season.<br/>~ Average attendance was an impressive 26.2. The sport witnessed the introduction of an incredible 28 new stars.<br/>~ Not a single <i>Wet War</i> during Season 11, spanning from late-August to early-November.<br/>~ Juan Londono, Chris Adams, John Tronolone, and Diana DiBuccio attended all Season 11 events.<br/><br/><u><big><i>DODGEBALL CX</i></big></u><br/>~ Streamer-flags, table cloth flags [thanks to old shower curtain rods], and streamers draped along the fence and tennis courts brightened up the atmosphere.<br/>~ First pair-pick for Butler/Bertsch: <i>John Tronolone &amp; Chris Adams</i><br/>~ First pair-pick for Krott/Kerr: <i>Kevin Fitzpatrick &amp; Mike Edwards</i><br/>~ Because of daylight savings time, the bright Wall High School lights stayed on an additional full hour - only the warriors were celebrating at Pete and Elda's!<br/><br/><i><big>TraCX</big></i><br/>Yet another outstanding music compliation, full of variety and energy. The successor of the popular <i>OH Tracks!</i> started with official theme song \"Stronger\" by Kanye West, kicking-off an awesome four-hours of non-stop, hip-hop, rockin' anthems from all genres; \"Testify\" by Rage Against the Machine, \"The Pretender\" by the Foo Fighters, Flyleaf's \"Fully Alive\", E.M.F.'s \"Unbelievable\", and yes, even the double-trouble Jay Z/Beyonce hit \"Bonnie and Clyde\".<br/><br/><big><i>DODGEBALL CX1 Announcement</i></big><br/>The fierce bout from <a href=\"http://dodgeball.livejournal.com/2007/05/06/\" target=\"_blank\">DODGEBALL LXXXVI</a> returns ... Announced at DODGEBALL CX, <b>Kevin Adams</b> clashes with <b>Grant Cornero</b> at DODGEBALL CX1 on November 10. Looks like it's going to be a kick-ass Season 12, and that's just the start!<br/><br/><b><i>Online Exclusives!</i></b><br/>When and why did Dan Turner leave? Where in the hell was Kevin Megill?<br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXmoments.jpg\"/></a></center><br/>Come on, with an overwhelming 39 warriors, how can you not expect sh*t to go down! The good, the bad, and the ugly about \"Big Time 110\": <br/>~ The uncanny power of newcomer \"red shirt\" Chris Everett.<br/>~ Kevin Fitzpatrick vicious nutshot on Kevin Adams in the first few minutes of the CX.<br/>~ \"Killer\" Kerr's dominating Game 5 \"Last Woman Standing\" performance, life-saving rimshot included.<br/>~ The hilarious Juan Londono-lead charges of \"Freedom!\", \"Duritos!\", and \"Maria!\".<br/>~ Constant arguments breaking out over debatable eliminations and rimshots.<br/>~ The one-handed catch by legend Kevin Adams.<br/>~ The numerous head and faceshots delivered to Melissa Kerr, Jim Butler, Pam D'Luhy, Captain Alison Bertsch, among others.<br/>~ Rob Pellecchia's crucial Game 6 \"Last Man Standing\" showing.<br/>~ Double-eliminations on Fitzpatrick/DiBuccio, Maiorino/Basista, Tronolone/T.Adams, E.Bitsko/DiBuccio, among a few others.<br/>~ Captain \"Sputz\" Krott's fast and furious catches midway through CX.<br/>~ Valerie Winston's priceless mid-court fall holding one of the streamer-flags.<br/>~ Captain Mike Butler earning the final kill of the night against the reckless Sascha Basista.<br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXrecords.jpg\"/></a></center><br/>An astounding <b>39</b> participated at DODGEBALL CX, tied for the 5th highest attendance along with DODGEBALL 71 and DODGEBALL NINETY 4. Thirty-one men and eight women comprised the awesome turnout. <br/><br/>DODGEBALL CX welcomed <b>six new stars</b> in Elizabeth Bitsko, Jeff Brown, Josh Mieloch, Kyrell Palmer, Tom Cowling, and Chris Everett. <br/><br/>Notable returns include: Matt Brown (last competed at DB70); Luke Devlin (last competed at DB90); Brent Bitsko (last competed at DB100); Pam D'Luhy (last competed at DB100); Dan Turner (last competed at DB101); Joey Smalls (Last competed at DB104) <br/><br/>DODGEBALL CX was the fifth season finale held on the back courts of Wall High School. It was the fourth to include the popular <i>Letsche Rims</i> as form of team regeneration. <br/><br/>The official theme song was \"Stronger\" by Kanye West. <br/><br/>The only woman to headline a season finale spectacular before DODGEBALL CX was Sara DeCuir at DODGEBALL LX in late-October 2006. She was not present at this Season 11 conclusion however.<br/><br/>In the colossal main event, Mike Butler and Alison Bertsch defeated Mike \"Sputz\" Krott and Melissa Kerr, 6 to 3. This match was unique in that it was \"couple vs. couple\", something never witnessed before. Each pair of co-captains wore matching outfits for the occasion. And rather than the usual first pick by way of winning <i>RockPaperScissor</i>, the captains started the show, two-versus-two, with the winners not only gaining the first <i>two</i> allies, but earning the first point of the night's match. This was the first time in the two year-plus history that teams were formed by picking two players at a time instead of the standard one.<br/><br/>-- <b>Alison Bertsch</b> made her ten event captains debut. Her record after CX is 2-4-1. <br/>-- <b>Mike Butler</b> made his ten event captains debut. His record now stands at 2-1-0. <br/>-- <b>Melissa Kerr</b> competed in her very first captains confrontation. <br/>-- <b>Mike \"Sputz\" Krott</b> competed in his very first captains confrontation. <br/><br/>Excluding DODGEBALL CX newblood, the following competitors made their ten event debut: Marc Weber and Mike Maiorino. <br/><br/>And because of their participation, Kevin Adams and John Tronolone remain as the only two competitors to have partaken in all 11 season finale events.<br/><br/><center><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXack.jpg\"/></a></center><br/><u>Streamers Everywhere!</u><br/><i>Thanks!</i> to John Tronolone for setting up the various decorations around the court. Ryan Letsche, Kevin Fitzpatrick, and Mike Maiorino also lent a helping hand.<br/><br/><u><i>TraCX</i> Soundtrack!</u><br/>Special <i>Thanks!</i> to Lauren Winston for the use of her iPod and John Tronolone for putting the soundtrack together. Michael Tronolone, Bob Cornero, Alison Bertsch, and Kathryn Nogueira are also thanked for their various contributions towards this awesome playlist.<br/><br/><u>Never Duplicated!</u><br/>Do you ever ask yourself what you'd be doing without the mayhem and madness that is dodgeball? It's been over two-years and time and time again, you'll hear it ... <i>Thank You</i> to those who have traveled through the times and helped create unforgettable moments and memories for the last 26 months. It's because of you that Saturdays are just so damn fun.<br/><br/><center><br/><form action=\"http://poll.pollhost.com/vote.cgi\" method=\"post\"><table bgcolor=\"#000000\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"150\"><tr><td><font color=\"#CC66FF\" face=\"Comic Sans MS\" size=\"-1\"><b>The glitz, the glamour, the game that was DODGEBALL CX ... what did you think?</b></font></td></tr><tr><td><center><select name=\"answer\"><option value=\"1\">A ... Now that's dodgeball.</option><option value=\"2\">B ... I liked it.</option><option value=\"3\">C ... Not bad, but still a little disappointed.</option><option value=\"4\">D ... Barely passed.</option><option value=\"5\">E ... Ouch.</option></select></center><tr><td colspan=\"2\"><input name=\"config\" type=\"hidden\" value=\"V1dFQ29vd25lcgkxMTk0MzcwMDMzCTAwMDAwMAlDQzY2RkYJQ29taWMgU2FucyBNUwlPcmFuZ2U\"/><center><input type=\"submit\" value=\"Vote\"/>  <input name=\"view\" type=\"submit\" value=\"View\"/></center></td></tr><tr><td align=\"right\" bgcolor=\"#FFFFFF\" colspan=\"2\"><font color=\"#000000\" face=\"Comic Sans MS\" size=\"-2\"><a href=\"http://www.pollhost.com/\" rel=\"nofollow\" target=\"_blank\"><font color=\"#000099\"></font></a></font></td></tr></td></tr></table></form><br/></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/110NEWJ1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXmainevent.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXfacts.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXmoments.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXrecords.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXack.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}