{
  "id": 75447,
  "url": "https://dodgeball.livejournal.com/75447.html",
  "title": ">>> HOME For The HOLIDAY",
  "date": "",
  "body_text": "THANKSGIVING SPECIAL Results!\nWALL v. ALL 4\nThe feverishly awaited fourth installment in a war five arduous months in the making. The alliances have boldly, brashly kicked each others' ass from heaven all the way down to hell, and with no dissolution in sight.\nTeam WALL opened things up with the inaugural victory of this monumental clash. The resiliency and aggressiveness of their never-say-die rivals however was proven mighty and strong - Team ALL racked up two consecutive triumphs grabbing the early edge heading into the second hour. Had it become all too reminiscent of the\nshocking third encounter\n- and a glimpse into the immediate future? Not exactly.\nThings looked bleak following the sudden departures of powerhouse Kevin Megill and later Rob Avakian, both of whom had done their fair share of methodical catching and eliminations. Plus, with the additions of superpower Justin Pierce and the returning Kurt Gassner on WALL, the visitors' offensive was shot down almost immediately. The hometown heroes regained and then stretched the advantage into the late night hours, earning a massive seven by the conclusion of CX3.\nALL's inability to regenerate, coupled with the overwhelming resources and experience of their opposition caused ALL's downfall.\nFlash Results by Game\n: 1, 4, 5, 6, 7, 8, 9 (WALL); 2, 3 (ALL)\nTeam WALL, the \"Indians\" if you will, remain the dominating force in this feud-of-the-year contender.\nWALL defeated ALL, 7 to 2\n.\nMoments & Stars\n: Kevin Fitzpatrick busting Kristen Driscoll's lip due to a vicious bulletball to the face; Bobby Vetrano's magnificant dodges; Kevin Fitzpatrick receiving a nutshot following an accidental deflection by teammate Justin Pierce\nThe YEARBOOK\nMembers of \"Team ALL 4\" came from the following high schools:\nAllentown\n(DiBuccio)\n; M.A.S.T.\n(Cornero)\n; Monmouth Regional\n(Tronolone)\n; Red Bank Catholic\n(Driscoll)\n; Ocean Township\n(Edwards, Spirito, Vetrano)\n; Neptune\n(R. Brown, M. Brown, Butler)\n; Manasquan\n(Avakian, Harley, Krott, Lewis, Londono, Megill, Raspanti, Stopa)\nDODGEBALL CXV Mid-Season Main Event Blockbuster Announcement!\nIt was revealed at this 113th spectacular that on December 8 at\nDODGEBALL CXV\n(115), six of the most recognized names in the colorful history of the game will do battle in a special three-versus-three, \"War to Settle the Scores\" encounter.\nThe deadly alliance of\nJuan Londono\n,\nRay Marzarella\n, and\nKevin Fitzpatrick\nwill join forces to battle an elite trio in\nRob Avakian\n,\nSascha Basista\n, and\nChris Adams\n! Stayed tuned to\ndodgeball.livejournal.com\nin the coming week for all the details concerning this explosive collision!\nRECORDS\n> Attendance: 32\n> Notable Returns: Matt Raspanti (last competed at DB XXV)*; Bobby Vetrano (last competed at DB 71); Kurt Gassner (last competed at DB 88)\n> New Players: (3) Marc Spirito, Margaret Harley, Nick Marabeti\n- DODGEBALL CX3 featured the fourth\nWALL vs. ALL\nencounter. Team WALL captured wins in the first two matches, while Team ALL took the third. Team WALL would regain the advantage in this war, winning 7 to 2 at CX3.\nOnline Exclusive!\nThe brains behind the\nWALL v. ALL\nbattles can be credited to both John Tronolone and even more so, Ryan Letsche. And to think it all began with a pad, a pen, and Starbucks coffee some five months ago.\nPAM vs. VALERIE\nPickYourPoison Rules at DODGEBALL 114\nThe wild women are taking over. Veteran\nValerie Winston\nwrestles with newcomer to the captains circle,\nPam D'Luhy\n. The special\nPickYourPoison\nteam selection stipulation is in effect.\nDon't miss out on this first-time meeting between two of the most dominant females in the game's history. Catch it live\nDecember 1\n.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/113FF.jpg\" vspace=\"3\"><big><b>THANKSGIVING SPECIAL Results!<br/>WALL v. ALL 4</b></big><br/>The feverishly awaited fourth installment in a war five arduous months in the making. The alliances have boldly, brashly kicked each others' ass from heaven all the way down to hell, and with no dissolution in sight.<br/><br/>Team WALL opened things up with the inaugural victory of this monumental clash. The resiliency and aggressiveness of their never-say-die rivals however was proven mighty and strong - Team ALL racked up two consecutive triumphs grabbing the early edge heading into the second hour. Had it become all too reminiscent of the <a href=\"http://dodgeball.livejournal.com/2007/10/14/\" target=\"_blank\">shocking third encounter</a> - and a glimpse into the immediate future? Not exactly. <br/><br/>Things looked bleak following the sudden departures of powerhouse Kevin Megill and later Rob Avakian, both of whom had done their fair share of methodical catching and eliminations. Plus, with the additions of superpower Justin Pierce and the returning Kurt Gassner on WALL, the visitors' offensive was shot down almost immediately. The hometown heroes regained and then stretched the advantage into the late night hours, earning a massive seven by the conclusion of CX3.<br/><br/>ALL's inability to regenerate, coupled with the overwhelming resources and experience of their opposition caused ALL's downfall.<br/><br/><u>Flash Results by Game</u>: 1, 4, 5, 6, 7, 8, 9 (WALL); 2, 3 (ALL)<br/><br/>Team WALL, the \"Indians\" if you will, remain the dominating force in this feud-of-the-year contender. <i>WALL defeated ALL, 7 to 2</i>.<br/><br/><b>Moments &amp; Stars</b>: Kevin Fitzpatrick busting Kristen Driscoll's lip due to a vicious bulletball to the face; Bobby Vetrano's magnificant dodges; Kevin Fitzpatrick receiving a nutshot following an accidental deflection by teammate Justin Pierce<br/><br/><b>The YEARBOOK</b><br/>Members of \"Team ALL 4\" came from the following high schools:<br/>Allentown <i>(DiBuccio)</i>; M.A.S.T. <i>(Cornero)</i>; Monmouth Regional <i>(Tronolone)</i>; Red Bank Catholic <i>(Driscoll)</i>; Ocean Township <i>(Edwards, Spirito, Vetrano)</i>; Neptune <i>(R. Brown, M. Brown, Butler)</i>; Manasquan <i>(Avakian, Harley, Krott, Lewis, Londono, Megill, Raspanti, Stopa)</i><br/><br/><b>DODGEBALL CXV Mid-Season Main Event Blockbuster Announcement!</b><br/>It was revealed at this 113th spectacular that on December 8 at <u>DODGEBALL CXV</u>(115), six of the most recognized names in the colorful history of the game will do battle in a special three-versus-three, \"War to Settle the Scores\" encounter.<br/><br/>The deadly alliance of <u>Juan Londono</u>, <u>Ray Marzarella</u>, and <u>Kevin Fitzpatrick</u> will join forces to battle an elite trio in <u>Rob Avakian</u>, <u>Sascha Basista</u>, and <u>Chris Adams</u>! Stayed tuned to <i>dodgeball.livejournal.com</i> in the coming week for all the details concerning this explosive collision!<br/><br/><big><b>RECORDS</b></big><br/>&gt; Attendance: 32<br/>&gt; Notable Returns: Matt Raspanti (last competed at DB XXV)*; Bobby Vetrano (last competed at DB 71); Kurt Gassner (last competed at DB 88)<br/>&gt; New Players: (3) Marc Spirito, Margaret Harley, Nick Marabeti<br/><br/>- DODGEBALL CX3 featured the fourth <i>WALL vs. ALL</i> encounter. Team WALL captured wins in the first two matches, while Team ALL took the third. Team WALL would regain the advantage in this war, winning 7 to 2 at CX3.<br/><br/><i><b>Online Exclusive!</b></i><br/>The brains behind the <i>WALL v. ALL</i> battles can be credited to both John Tronolone and even more so, Ryan Letsche. And to think it all began with a pad, a pen, and Starbucks coffee some five months ago.<br/><br/><img align=\"left\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/114A.jpg\" vspace=\"3\"/><center><big><b>PAM vs. VALERIE</b></big><br/><i>PickYourPoison Rules at DODGEBALL 114</i></center><br/>The wild women are taking over. Veteran <b>Valerie Winston</b> wrestles with newcomer to the captains circle, <b>Pam D'Luhy</b>. The special <i>PickYourPoison</i> team selection stipulation is in effect.<br/><br/>Don't miss out on this first-time meeting between two of the most dominant females in the game's history. Catch it live <b>December 1</b>. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/113FF.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/114A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}