{
  "id": 75537,
  "url": "https://dodgeball.livejournal.com/75537.html",
  "title": ">>> \"Hey B*itch, YOU B*TCH!\"",
  "date": "",
  "body_text": "PAM vs. VALERIE\nPickYourPoison Stipulation Returns!\nFinally after nearly a year patiently, anxiously waiting her big break, one\nPam D'Luhy\nenters the limelight she so truly deserves. Her opponent is one of the originals, the icon\nValerie Winston\n.\nEach of these iron women are perhaps most recognized for their secret sideline specialties, specifically in the throwing department. But with an extensive captains history, the eldest Winston may just have the edge heading into this lady lashing.\nIn 2007 alone, Val has\nCREAMated\nher [wink-wink] best friend John Tronolone and though she came up short, tenaciously competed in the sport's\nTwo Year Anniversary\n, giving it her all alongside the one and only, Lauren Stopa.\nThe resilient D'Luhy is no doubt in for the fight of her career. What will become of this rookie captain? And what effect will the\nPickYourPoision\nstipulation have on these two titans?\nPAM vs. VALERIE\nand it can only happen at DODGEBALL 114.\nDodgeball Gold Awards\nThe 2007 Oscars!\nThe \"Dodgeball Excellence\" awards? The \"Hall of Fame\"?\nLong gone.\nOn December 1, the dodgeball community will receive detailed information on the year end\nGold Awards\n, including the unveiling of categories and possible nominees. DODGEBALL 114 is a must attend for those interested in learning more.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/114A.jpg\" vspace=\"3\"><big><b>PAM vs. VALERIE</b></big><br/><i>PickYourPoison Stipulation Returns!</i><br/><br/>Finally after nearly a year patiently, anxiously waiting her big break, one <b>Pam D'Luhy</b> enters the limelight she so truly deserves. Her opponent is one of the originals, the icon <b>Valerie Winston</b>. <br/><br/>Each of these iron women are perhaps most recognized for their secret sideline specialties, specifically in the throwing department. But with an extensive captains history, the eldest Winston may just have the edge heading into this lady lashing.<br/><br/>In 2007 alone, Val has <i>CREAMated</i> her [wink-wink] best friend John Tronolone and though she came up short, tenaciously competed in the sport's <a href=\"http://dodgeball.livejournal.com/2007/09/03/\" target=\"_blank\">Two Year Anniversary</a>, giving it her all alongside the one and only, Lauren Stopa.<br/><br/>The resilient D'Luhy is no doubt in for the fight of her career. What will become of this rookie captain? And what effect will the <i>PickYourPoision</i> stipulation have on these two titans?<br/><br/><i>PAM vs. VALERIE</i> and it can only happen at DODGEBALL 114.<br/><br/><big><b>Dodgeball Gold Awards</b></big><br/><i>The 2007 Oscars!</i><br/><br/>The \"Dodgeball Excellence\" awards? The \"Hall of Fame\"?<br/>Long gone. <br/><br/>On December 1, the dodgeball community will receive detailed information on the year end <i>Gold Awards</i>, including the unveiling of categories and possible nominees. DODGEBALL 114 is a must attend for those interested in learning more. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/114A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}