{
  "id": 76187,
  "url": "https://dodgeball.livejournal.com/76187.html",
  "title": ">>> Dodgeball, DONUTS, D'Luhy, DOMINATION",
  "date": "",
  "body_text": "2007 GOLD AWARDS\nJust moments before the lady lashing came the long-awaited announcement of the year-end\nGold Awards\n. As of DODGEBALL 114, five categories have been revealed. Congratulations are certainly in order to each of the candidates:\nROOKIE of the Year\n: Sascha Basista, Michael Butler, Grant Cornero, Juan Londono, Rob Pellecchia, Justin Wolf\nNew CONCEPT of the Year\n:\nPickYourPoison\n,\nBoxBall Dodgeball\n,\nCREAMation Rules\n, The\nDodgeball Draft\n.\nPLAYER of the Year\n: Mike Edwards, Lauren Stopa, Kevin Adams, Ryan Letsche\nRIVALRY of the Year\n: C. Adams vs. Fitzpatrick, Londono vs. T. Adams, Megill vs. Edwards, Basista vs. Marzarella, Wall vs. All.\nEVENT of the Year\n: (Nominations to be announced at a later date)\nBeginning at DODGEBALL 116 on December 15, each and every participant will have the opportunity to cast their votes. The results will be unveiled live, in front of the world at DODGEBALL 120 on January 5, 2008.\nPickYourPoison\n: D'LUHY versus V. WINSTON\nSecret sideline specialists head-to-head in the first\nPYP\nencounter in nearly seven months! Could the newcomer\nPam D'Luhy\nknock off the legendary titan\nValerie Winston\n?\nThe event started off perhaps as one would assume - the veteran Winston scoring the inaugural round. The uncanny power and overall unlimited abilites of allies Fitzpatrick, L. Winston, Megill, and newby Vaz brightly shined during the opening contest. The very next contest yielded the exact same result. D'Luhy had yet to get on the board. But the unmerciful, violent onsalught stopped right there.\nGame 3 will long be remembered for the undying heart and determination of \"last man standing\" rivals the dodging extraordinaire Bobby Vetrano and rookie-of-the-year candidate Sascha Basista. This grueling, nearly ten minute mano-e-mano collision proved to be the pivotal turning point in the night's match as a Vetrano-launched bulletball nailed the \"Reckless One\" right smack in the chest.\nFrom then on, the momentum was solely on the side of Team D'LUHY having dismantled their never-say-die opposition for the remaining duration of 114. And to think D'Luhy has her captain counterpart to thank -\nPickYourPoison\nindeed!\nFlash Results by Game\n: 1, 2 (Winston); 3, 4, 5, 6, 7, 8, 9, 10, 11 (D'Luhy)\nPam claims victory against Valerie , 9 to 2.\nMoments & Stars\n: the Mrs. Vetrano countdowns; the phenomenal Game 3 one-on-one showdown between Sascha Basista and Bobby Vetrano; Rob Pellecchia and Diana DiBuccio shielded by Dunkin Donuts boxes; Justin Wolf angrily punting a bulletball over the school; Chris Adams's terrific late match catches; the magnificant sideline eliminations by Captain D'Luhy; the shattered pair of roller blades\nA special acknowledgment to both Kevin Megill and Lauren Stopa for purchasing brand new bulletballs in the days leading up to DODGEBALL 114. There will be more than enough amo heading into these arduous winter months and we certainly have them to thank.\nRECORDS\n> Attendance: 31\n> Notable Returns: Matt Johnson (last competed at DB 71); Wesley Hebrew (last competed at DB 98)\n> New Players: (2) Bobby Bonney, Shawn Vaz\n- DODGEBALL CX3 and DODGEBALL 114 are the first two consecutive events (excluding a ten event) to reach an attendances of 30 or more since DODGEBALL 33 and DODGEBALL XXX4 - all the way back in April 2006!\n- This was only the fourth\nPickYourPoison\nmatch-up in dodgeball's two-plus year history; the first since DODGEBALL 92 back in mid-June 2007.\n- Following Game 3, the three-minute \"last man standing\" timer was shortened to one minute. The low temperature played a part in this unananymous decision.\n- In the main event, Pam D'Luhy knocked off veteran captain Valerie Winston 9 to 2. This was D'Luhy's debut match.\n- Again, the dry weather held up, this 114th edition being the 23rd consecutive event not a\nWet War\n. It was also the 26th straight event held on the Back Courts of Wall High School.\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nDODGEBALL CXV\n\"The War to Settle the Scores\"\nMid-Season Main Event on December 8!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><b>2007 GOLD AWARDS</b></big> <br/>Just moments before the lady lashing came the long-awaited announcement of the year-end <i>Gold Awards</i>. As of DODGEBALL 114, five categories have been revealed. Congratulations are certainly in order to each of the candidates: <br/><br/><u>ROOKIE of the Year</u>: Sascha Basista, Michael Butler, Grant Cornero, Juan Londono, Rob Pellecchia, Justin Wolf <br/><u>New CONCEPT of the Year</u>: <i>PickYourPoison</i>, <i>BoxBall Dodgeball</i>, <i>CREAMation Rules</i>, The <i>Dodgeball Draft</i>. <br/><u>PLAYER of the Year</u>: Mike Edwards, Lauren Stopa, Kevin Adams, Ryan Letsche <br/><u>RIVALRY of the Year</u>: C. Adams vs. Fitzpatrick, Londono vs. T. Adams, Megill vs. Edwards, Basista vs. Marzarella, Wall vs. All. <br/><u>EVENT of the Year</u>: (Nominations to be announced at a later date) <br/><br/>Beginning at DODGEBALL 116 on December 15, each and every participant will have the opportunity to cast their votes. The results will be unveiled live, in front of the world at DODGEBALL 120 on January 5, 2008. <br/><br/><big><b><i><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/114Az.jpg\" vspace=\"3\">PickYourPoison</img></i>: D'LUHY versus V. WINSTON</b></big> <br/>Secret sideline specialists head-to-head in the first <i>PYP</i> encounter in nearly seven months! Could the newcomer <b>Pam D'Luhy</b> knock off the legendary titan <b>Valerie Winston</b>? <br/><br/>The event started off perhaps as one would assume - the veteran Winston scoring the inaugural round. The uncanny power and overall unlimited abilites of allies Fitzpatrick, L. Winston, Megill, and newby Vaz brightly shined during the opening contest. The very next contest yielded the exact same result. D'Luhy had yet to get on the board. But the unmerciful, violent onsalught stopped right there. <br/><br/>Game 3 will long be remembered for the undying heart and determination of \"last man standing\" rivals the dodging extraordinaire Bobby Vetrano and rookie-of-the-year candidate Sascha Basista. This grueling, nearly ten minute mano-e-mano collision proved to be the pivotal turning point in the night's match as a Vetrano-launched bulletball nailed the \"Reckless One\" right smack in the chest. <br/><br/>From then on, the momentum was solely on the side of Team D'LUHY having dismantled their never-say-die opposition for the remaining duration of 114. And to think D'Luhy has her captain counterpart to thank - <i>PickYourPoison</i> indeed! <br/><br/><u>Flash Results by Game</u>: 1, 2 (Winston); 3, 4, 5, 6, 7, 8, 9, 10, 11 (D'Luhy) <br/><br/>Pam claims victory against Valerie , 9 to 2.<br/><br/><b>Moments &amp; Stars</b>: the Mrs. Vetrano countdowns; the phenomenal Game 3 one-on-one showdown between Sascha Basista and Bobby Vetrano; Rob Pellecchia and Diana DiBuccio shielded by Dunkin Donuts boxes; Justin Wolf angrily punting a bulletball over the school; Chris Adams's terrific late match catches; the magnificant sideline eliminations by Captain D'Luhy; the shattered pair of roller blades<br/><br/><i>A special acknowledgment to both Kevin Megill and Lauren Stopa for purchasing brand new bulletballs in the days leading up to DODGEBALL 114. There will be more than enough amo heading into these arduous winter months and we certainly have them to thank.</i> <br/><br/><big><b>RECORDS</b></big> <br/>&gt; Attendance: 31 <br/>&gt; Notable Returns: Matt Johnson (last competed at DB 71); Wesley Hebrew (last competed at DB 98)<br/>&gt; New Players: (2) Bobby Bonney, Shawn Vaz <br/><br/>- DODGEBALL CX3 and DODGEBALL 114 are the first two consecutive events (excluding a ten event) to reach an attendances of 30 or more since DODGEBALL 33 and DODGEBALL XXX4 - all the way back in April 2006! <br/>- This was only the fourth <i>PickYourPoison</i> match-up in dodgeball's two-plus year history; the first since DODGEBALL 92 back in mid-June 2007.<br/>- Following Game 3, the three-minute \"last man standing\" timer was shortened to one minute. The low temperature played a part in this unananymous decision. <br/>- In the main event, Pam D'Luhy knocked off veteran captain Valerie Winston 9 to 2. This was D'Luhy's debut match. <br/>- Again, the dry weather held up, this 114th edition being the 23rd consecutive event not a <i>Wet War</i>. It was also the 26th straight event held on the Back Courts of Wall High School. <br/><br/><center><big>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - <br/><br/><b>DODGEBALL CXV<br/>\"The War to Settle the Scores\"</b> <br/>Mid-Season Main Event on December 8!</big><br/><br/><a href=\"http://photobucket.com\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photo Sharing and Video Hosting at Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/115Ax.jpg\"/></a></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/114Az.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/115Ax.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}