{
  "id": 76377,
  "url": "https://dodgeball.livejournal.com/76377.html",
  "title": "The WAR to Settle the SCORES",
  "date": "",
  "body_text": "DODGEBALL 116 & 117 Announcements!\nThe colossal six-pack challenge if you will isn't the only thing to anticipate - the main events for both the 116th spectacular and second annual Christmas Special will be made public!\nButler Beat Box!\nSo on the agenda are the bombshell announements as well as the huge team attraction ... but also, a high-octance soundtrack created just for CXV by the legendary,\nGold Award\nnominee, Michael Butler!\nLONDONO, MARZARELLA, FITZPATRICK\nvs. AVAKIAN, BASISTA, C. ADAMS\nMid-Season Main Event:\n\"The War to Settle the Scores\"\nThis is just huge! Literally, figuratively one of the biggest wars in all of dodgeball history!\nLONDONO / AVAKIAN History\nComing off the heels of a six month conflict with the legendary Tom Adams, \"Muffin Man\" Juan Londono begged to find where his career would take him next. As DODGEBALL 96 approached, an opportunity presented itself with the returning\nHit the Human\ncontest - and the challenge of the suicidal Rob Avakian. The somewhat forgotten pregame set the stage for one of the most intense wars of the year!\nOn that\nJuly 14\nnight, Avakian successfully fought off the Londono-lead charges in a truly magical showcase. \"The Cockroach\" would have to wait until\nDODGEBALL 106\n- an agonizing three months - before his next shot and ultimately return the favor.\nMARZARELLA / BASISTA History\nYou've heard it once, you'll hear it again - \"In Lieu of Lenny!\" Unable to attend, the award-winning Herrera left rookie-of-the-year contender Sascha Basista without competition in the proposed contest at\nDODGEBALL 84\n. With the sudden void, willing combatants teed off in a rare\nRimshot Contest\nto decide the evening's headliners.\nPondScum\nicon Ray Marzarella wound up the sole survivor in the pregame festivity and the rest is history.\nThat battle between the \"Reckless One\" and the blocking extraordinaire went unresolved in the inaugural bout with each man racking two wins. But the conflict doesn't cease there.\nIn their destined rematch, Basista bested the gutsy opposition at\nDODGEBALL NINETY 4\nin front of an astounding 39 at the June 2007 finale. But before long, Marzarella extracted his own measure of revenge, joining forces with\nPondScum\nally Gerald \"G Money\" Lewis and dismantling the breakdancing dodger along with the colorful Joey Smalls in an unforgettable doubles bout in\nearly-September\n.\nFITZPATRICK / ADAMS History\nThe unforgiving struggle that revolutionized the so-called \"captains match\". It's hard to believe it's been nearly one full year since these two first clashed at the 2006 year-end finale, DODGEBALL 70, and even now, nothing has been settled! Each tied at 1, this six-man collision may once and for all put a stop to this sadistic massacre.\nTo recap, Fitzpatrick annihilated the eldest Adams into oblivian at the\nSeason 7 finale\nlate last year. But how the tables had turned and \"Fitz\", in their impatiently-awaited return brawl was left \"blinded by the white\"; \"The Axe\" Adams had defeated his nemisis in the\nCREAMation 3\n.\nThis is the fifth* prearranged match between the superpowers and records clearly show no favorite heading into this \"War to Settle to Scores\".\n*See\nDODGEBALL 75\nand\nDODGEBALL 101\n.........\nAlready in this 12th Season:\nDODGEBALL CX1: Kevin Adams defeated Grant Cornero in a DODGEBALL LXXXVI rematch\nDODGEBALL CX2: Mike Edwards remains unbeaten with a win over Derek Carty\nDODGEBALL CX3: Wall decimates All in the feverishly-awaited fourth round\nDODGEBALL 114: Pam D'Luhy in her debut match knocks off Valerie Winston\nThe insanity of Avakian and Basista, the uncanny power of Adams and Fitzpatrick, the never-say-die attitudes of Londono and Marzarella ... brace yourself for the kick-ass, in-your-face action as only these six warriors know how. The mid-season main event will deliver!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b><big>DODGEBALL 116 &amp; 117 Announcements!</big></b> <br/>The colossal six-pack challenge if you will isn't the only thing to anticipate - the main events for both the 116th spectacular and second annual Christmas Special will be made public! <br/><br/><b><big>Butler Beat Box!</big></b><br/>So on the agenda are the bombshell announements as well as the huge team attraction ... but also, a high-octance soundtrack created just for CXV by the legendary, <i>Gold Award</i> nominee, Michael Butler!<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/115B.jpg\" vspace=\"2\"><big><big><b>LONDONO, MARZARELLA, FITZPATRICK <br/>vs. AVAKIAN, BASISTA, C. ADAMS</b></big><br/>Mid-Season Main Event: <i>\"The War to Settle the Scores\"</i></big><br/><br/>This is just huge! Literally, figuratively one of the biggest wars in all of dodgeball history! <br/><br/><u><b>LONDONO / AVAKIAN History</b></u> <br/>Coming off the heels of a six month conflict with the legendary Tom Adams, \"Muffin Man\" Juan Londono begged to find where his career would take him next. As DODGEBALL 96 approached, an opportunity presented itself with the returning <i>Hit the Human</i> contest - and the challenge of the suicidal Rob Avakian. The somewhat forgotten pregame set the stage for one of the most intense wars of the year! <br/><br/>On that <a href=\"http://dodgeball.livejournal.com/2007/07/16/\" target=\"_blank\">July 14</a> night, Avakian successfully fought off the Londono-lead charges in a truly magical showcase. \"The Cockroach\" would have to wait until <a href=\"http://dodgeball.livejournal.com/2007/10/08/\" target=\"_blank\">DODGEBALL 106</a> - an agonizing three months - before his next shot and ultimately return the favor.<br/><br/><u><b>MARZARELLA / BASISTA History</b></u> <br/>You've heard it once, you'll hear it again - \"In Lieu of Lenny!\" Unable to attend, the award-winning Herrera left rookie-of-the-year contender Sascha Basista without competition in the proposed contest at <a href=\"http://dodgeball.livejournal.com/2007/04/23/\" target=\"_blank\">DODGEBALL 84</a>. With the sudden void, willing combatants teed off in a rare <i>Rimshot Contest</i> to decide the evening's headliners. <i>PondScum</i> icon Ray Marzarella wound up the sole survivor in the pregame festivity and the rest is history. <br/><br/>That battle between the \"Reckless One\" and the blocking extraordinaire went unresolved in the inaugural bout with each man racking two wins. But the conflict doesn't cease there. <br/><br/>In their destined rematch, Basista bested the gutsy opposition at <a href=\"http://dodgeball.livejournal.com/2007/07/02/\" target=\"_blank\">DODGEBALL NINETY 4</a> in front of an astounding 39 at the June 2007 finale. But before long, Marzarella extracted his own measure of revenge, joining forces with <i>PondScum</i> ally Gerald \"G Money\" Lewis and dismantling the breakdancing dodger along with the colorful Joey Smalls in an unforgettable doubles bout in <a href=\"http://dodgeball.livejournal.com/2007/09/12/\" target=\"_blank\">early-September</a>. <br/><br/><u><b>FITZPATRICK / ADAMS History</b></u> <br/>The unforgiving struggle that revolutionized the so-called \"captains match\". It's hard to believe it's been nearly one full year since these two first clashed at the 2006 year-end finale, DODGEBALL 70, and even now, nothing has been settled! Each tied at 1, this six-man collision may once and for all put a stop to this sadistic massacre.<br/><br/>To recap, Fitzpatrick annihilated the eldest Adams into oblivian at the <a href=\"http://dodgeball.livejournal.com/2007/01/02/\" target=\"_blank\">Season 7 finale</a> late last year. But how the tables had turned and \"Fitz\", in their impatiently-awaited return brawl was left \"blinded by the white\"; \"The Axe\" Adams had defeated his nemisis in the <a href=\"http://dodgeball.livejournal.com/2007/10/01/\" target=\"_blank\"><i>CREAMation 3</i></a>.<br/><br/>This is the fifth* prearranged match between the superpowers and records clearly show no favorite heading into this \"War to Settle to Scores\".<br/><i>*See <a href=\"http://dodgeball.livejournal.com/2007/02/12/\" target=\"_blank\">DODGEBALL 75</a> and <a href=\"http://dodgeball.livejournal.com/2007/08/22/\" target=\"_blank\">DODGEBALL 101</a></i><br/><br/>.........<br/><br/>Already in this 12th Season: <br/>DODGEBALL CX1: Kevin Adams defeated Grant Cornero in a DODGEBALL LXXXVI rematch <br/>DODGEBALL CX2: Mike Edwards remains unbeaten with a win over Derek Carty<br/>DODGEBALL CX3: Wall decimates All in the feverishly-awaited fourth round<br/>DODGEBALL 114: Pam D'Luhy in her debut match knocks off Valerie Winston<br/><br/>The insanity of Avakian and Basista, the uncanny power of Adams and Fitzpatrick, the never-say-die attitudes of Londono and Marzarella ... brace yourself for the kick-ass, in-your-face action as only these six warriors know how. The mid-season main event will deliver! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/115B.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}