{
  "id": 76689,
  "url": "https://dodgeball.livejournal.com/76689.html",
  "title": "\"... a date which will live in INFAMY ...\"",
  "date": "",
  "body_text": "\"The War to Settle the Scores\"\nLONDONO, MARZARELLA, FITZPATRICK vs. AVAKIAN, BASISTA, C. ADAMS\nThe hallowed grounds of Wall High School wouldn't be big enough to hold these combustable elements! Six of the most destructive entities -\nJuan Londono, Ray Marzarella, Kevin Fitzpatrick .. Rob Avakian, Sascha Basista, Chris Adams\n- combined to produce quite possibly the most barbaric, satanically insane melee of all-time!\nFlash Results by Game\nLondono/Marzarella/Fitzpatrick: 1*, 2, 3, 6, 9\nAvakian/Basista/Adams: 4, 5, 7, 8\nTension was in the air the moment the iconic captains squared-off in the opening captains-only inaugural game*. The crucial first point\nand\npick may have altered the course of history as we know it. The \"minor\" stipulation added a mere hours before showtime was indeed the deciding factor in this match-of-the-year contender. But the three-hour race to the finish line was arduous and tumultuous and tested the sharp minds and seemingly indestructible bodies of all involved.\nThe first full contest featuring all 31 combatants was as kick-ass intense as one would imagine. The stinging bulletballs rocketed from every direction kept the warriors on their toes throughout. Game 3 would replicate not only the madness and mayhem, but also the result. Londono, Marzarella, and Fitzpatrick racked up an incredible three by the end of hour one.\nBy round four however, the powerful resistance lead by the opposing \"Triple Entente\" breathed new life, carrying the momentum in to the next consecutive confrontations. With a golden opportunity to tie [and no alternative], Avakian, Basista, and Adams would pull out all the stops to conquer.\nOh but how the tide shifted ever-so briefly - and the lead extended yet again. But it wasn't enough to keep \"ABA\" down for long. Legendary figureheads like hot-hands catching maniac Mike \"Sputz\" Krott, \"Power Ranger\" Matt Brown, and indeed the generals themselves atomic-bombed the enemy into near surrender. The war to settle this deadlocked four to four score would go down without a hitch.\nSoldiers collapsed at the feet of their predator, the circular, wooden regerators smacked, all in effort to once and for all settle this damn thing! When the smoke cleared, only one triple alliance stood ...\nJuan Londono, Ray Marzarella,\nand\nKevin Fitzpatrick\nperhaps for the last time defeated\nRob Avakian, Sascha Basista,\nand\nChris Adams\n, 5 to 4, at DODGEBALL CXV.\nFantastically star-studded. Action intensified. Truly amazing dodgeball.\nMoments & Stars\n: Juan Londono taking out both Chris Adams and Sascha Basista in the captains-only round; Ray Marzarella's nearly 20-foot deflection landing on and eliminating teammate Mike Edwards; Kevin Adams's brutal faceshot on Kevin Megill; Mike \"Sputz\" Krott's critical catches as well as Joey \"Eddie Gordo\" Smalls's various kills and dodges; the Ryan Letsche rampages following his own eliminations\nButler Beat Box!\nHats off to\nGold Award\nnominee Michael \"M Bizzle\" Butler for the non-stop energy and creativity his special CXV soundtrack produced. Fans will long remember the event for this very reason.\nDODGEBALL 116 / DODGEBALL 117 Announcements!\n(Scroll down for the next big blockbusters!)\nRECORDS\n> Attendance: 31\n> Notable Returns: Dan Turner (last competed at DB CX); Steve Pham (last competed at DB CX1)\n> New Players: 0 (first time since DODGEBALL 109)\n- Only three female competitors: Alison Bertsch, Diana DiBuccio, and Pam D'Luhy.\n- DODGEBALL CX3, DODGEBALL 114, and DODGEBALL CXV are the first consecutive non-ten events to each include the likes of over 30 stars. This is truly remarkable seeing as it is a feat not realized since DODGEBALL 13, DODGEBALL 14, and DODGEBALL 15 in November 2005! Who would have predicted that 25 months, one hundred events later, success is indeed riding higher than ever!\n- The main event featured six megastars competing in only the second three-versus-three encounter, billed as \"The War to Settle the Scores\". The rivals - Londono/Avakian, Marzarella/Basista, Fitzpatrick/C. Adams - were each tied in their respective feuds. The opening round was a captains-only showdown, where the winners earned both the first point of the match as well as the overall pick for their team. At this 115th event, the trio of Juan Londono, Ray Marzarella, and Kevin Fitzpatrick would go on to narrowly defeat Rob Avakian, Sascha Basista, and Chris Adams in truly one of the most insane brawls ever witnessed. The final was 5 to 4.\n..\nJuan Londono\nhad a wealth of team battle experience entering in to the mid-season melee, this being his fourth overall. His record improves to 5-2-0; his third straight victory.\n..\nRay Marzarella\n, like Juan, came in with plenty of team knowledge thanks to several\nPondScum\nshowdowns. Ray is 3-2-2.\n..\nKevin Fitzpatrick\nis the only player in history to have partaken in both three-on-three matches (the other at DODGEBALL 100). His record improves to 4-3-0.\n..\nRob Avakian\nmade his team war debut. His record unfortunately slips to 1-3-0.\n..\nSascha Basista\nstands at 2-3-1. He's competed in numerous singles matches and one team attraction prior to CXV.\n..\nChris Adams\n, now 6-5-0, has been captain more times than anyone in history.\nOnline Exclusive!\nThe original line-up for the mid-season main event saw\nMarzarella & Londono vs. Basista & Avakian\nabout two months ago. Following Chris Adams's defeat of nemisis Kevin Fitzpatrick at DODGEBALL 105:\nCREAMation 3\n, they too were added to the mix.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nDODGEBALL 116\nOne of the most anticipated\nCREAMation Rules\nencounters ever! \"Most Intense\" award-winners square off when\nTravis Mills\nmeets\nRyan McCrorey\non December 15! Plus, voting opens for the prestigious year-end\nGold Awards\n!\nDODGEBALL 117: Christmas Special Main Event!\nTwo of the biggest icons to ever grace the dodgeball battlegrounds collide for the first time in their careers. Legend\nTom Adams\n, Legend\nJohn Tronolone\n- the second annual holiday edition comes full speed on December 22!\nDODGEBALL 118 / DODGEBALL 119: Double Header!\nIt's back-to-back nights of the kick-ass dodgeball action you just can't get enough of! Remember to mark\nFriday, December 28\nand\nSaturday, December 29\non your calenders! Matches to be announced in the near future!\nDODGEBALL 120\nThe climactical season finale extraganza crashes Wall High School on January 5, 2008! Stayed tuned for more on this milestone!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><u><big><b>\"The War to Settle the Scores\"</b></big></u><br/>LONDONO, MARZARELLA, FITZPATRICK vs. AVAKIAN, BASISTA, C. ADAMS</big><br/>The hallowed grounds of Wall High School wouldn't be big enough to hold these combustable elements! Six of the most destructive entities - <b>Juan Londono, Ray Marzarella, Kevin Fitzpatrick .. Rob Avakian, Sascha Basista, Chris Adams</b> - combined to produce quite possibly the most barbaric, satanically insane melee of all-time!<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball115AA.jpg\" vspace=\"3\"><u>Flash Results by Game</u><br/>Londono/Marzarella/Fitzpatrick: 1*, 2, 3, 6, 9<br/>Avakian/Basista/Adams: 4, 5, 7, 8<br/><br/>Tension was in the air the moment the iconic captains squared-off in the opening captains-only inaugural game*. The crucial first point <i>and</i> pick may have altered the course of history as we know it. The \"minor\" stipulation added a mere hours before showtime was indeed the deciding factor in this match-of-the-year contender. But the three-hour race to the finish line was arduous and tumultuous and tested the sharp minds and seemingly indestructible bodies of all involved.<br/><br/>The first full contest featuring all 31 combatants was as kick-ass intense as one would imagine. The stinging bulletballs rocketed from every direction kept the warriors on their toes throughout. Game 3 would replicate not only the madness and mayhem, but also the result. Londono, Marzarella, and Fitzpatrick racked up an incredible three by the end of hour one.<br/><br/>By round four however, the powerful resistance lead by the opposing \"Triple Entente\" breathed new life, carrying the momentum in to the next consecutive confrontations. With a golden opportunity to tie [and no alternative], Avakian, Basista, and Adams would pull out all the stops to conquer.<br/><br/>Oh but how the tide shifted ever-so briefly - and the lead extended yet again. But it wasn't enough to keep \"ABA\" down for long. Legendary figureheads like hot-hands catching maniac Mike \"Sputz\" Krott, \"Power Ranger\" Matt Brown, and indeed the generals themselves atomic-bombed the enemy into near surrender. The war to settle this deadlocked four to four score would go down without a hitch.<br/><br/>Soldiers collapsed at the feet of their predator, the circular, wooden regerators smacked, all in effort to once and for all settle this damn thing! When the smoke cleared, only one triple alliance stood ...<br/><br/><b>Juan Londono, Ray Marzarella,</b> and <b>Kevin Fitzpatrick</b> perhaps for the last time defeated <b>Rob Avakian, Sascha Basista,</b> and <b>Chris Adams</b>, 5 to 4, at DODGEBALL CXV. <br/><br/>Fantastically star-studded. Action intensified. Truly amazing dodgeball.<br/><br/><b>Moments &amp; Stars</b>: Juan Londono taking out both Chris Adams and Sascha Basista in the captains-only round; Ray Marzarella's nearly 20-foot deflection landing on and eliminating teammate Mike Edwards; Kevin Adams's brutal faceshot on Kevin Megill; Mike \"Sputz\" Krott's critical catches as well as Joey \"Eddie Gordo\" Smalls's various kills and dodges; the Ryan Letsche rampages following his own eliminations<br/><br/><b>Butler Beat Box!</b><br/>Hats off to <i>Gold Award</i> nominee Michael \"M Bizzle\" Butler for the non-stop energy and creativity his special CXV soundtrack produced. Fans will long remember the event for this very reason.<br/><br/><b>DODGEBALL 116 / DODGEBALL 117 Announcements!</b> <br/><i>(Scroll down for the next big blockbusters!)</i><br/><br/><big><b>RECORDS</b></big> <br/>&gt; Attendance: 31 <br/>&gt; Notable Returns: Dan Turner (last competed at DB CX); Steve Pham (last competed at DB CX1) <br/>&gt; New Players: 0 (first time since DODGEBALL 109) <br/><br/>- Only three female competitors: Alison Bertsch, Diana DiBuccio, and Pam D'Luhy.<br/>- DODGEBALL CX3, DODGEBALL 114, and DODGEBALL CXV are the first consecutive non-ten events to each include the likes of over 30 stars. This is truly remarkable seeing as it is a feat not realized since DODGEBALL 13, DODGEBALL 14, and DODGEBALL 15 in November 2005! Who would have predicted that 25 months, one hundred events later, success is indeed riding higher than ever!<br/>- The main event featured six megastars competing in only the second three-versus-three encounter, billed as \"The War to Settle the Scores\". The rivals - Londono/Avakian, Marzarella/Basista, Fitzpatrick/C. Adams - were each tied in their respective feuds. The opening round was a captains-only showdown, where the winners earned both the first point of the match as well as the overall pick for their team. At this 115th event, the trio of Juan Londono, Ray Marzarella, and Kevin Fitzpatrick would go on to narrowly defeat Rob Avakian, Sascha Basista, and Chris Adams in truly one of the most insane brawls ever witnessed. The final was 5 to 4. <br/>.. <u>Juan Londono</u> had a wealth of team battle experience entering in to the mid-season melee, this being his fourth overall. His record improves to 5-2-0; his third straight victory. <br/>.. <u>Ray Marzarella</u>, like Juan, came in with plenty of team knowledge thanks to several <i>PondScum</i> showdowns. Ray is 3-2-2.<br/>.. <u>Kevin Fitzpatrick</u> is the only player in history to have partaken in both three-on-three matches (the other at DODGEBALL 100). His record improves to 4-3-0. <br/>.. <u>Rob Avakian</u> made his team war debut. His record unfortunately slips to 1-3-0. <br/>.. <u>Sascha Basista</u> stands at 2-3-1. He's competed in numerous singles matches and one team attraction prior to CXV. <br/>.. <u>Chris Adams</u>, now 6-5-0, has been captain more times than anyone in history.<br/><br/><i><b>Online Exclusive!</b></i> <br/>The original line-up for the mid-season main event saw <i>Marzarella &amp; Londono vs. Basista &amp; Avakian</i> about two months ago. Following Chris Adams's defeat of nemisis Kevin Fitzpatrick at DODGEBALL 105: <i>CREAMation 3</i>, they too were added to the mix. <br/><br/><center><big><big>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~<br/><br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DBCUN.jpg\" vspace=\"3\"/></big></big></center><big>DODGEBALL 116</big><br/>One of the most anticipated <i>CREAMation Rules</i> encounters ever! \"Most Intense\" award-winners square off when <b>Travis Mills</b> meets <b>Ryan McCrorey</b> on December 15! Plus, voting opens for the prestigious year-end <i>Gold Awards</i>!<br/><br/><big>DODGEBALL 117: Christmas Special Main Event!</big><br/>Two of the biggest icons to ever grace the dodgeball battlegrounds collide for the first time in their careers. Legend <b>Tom Adams</b>, Legend <b>John Tronolone</b> - the second annual holiday edition comes full speed on December 22!<br/><br/><big>DODGEBALL 118 / DODGEBALL 119: Double Header!</big><br/>It's back-to-back nights of the kick-ass dodgeball action you just can't get enough of! Remember to mark <u>Friday, December 28</u> and <u>Saturday, December 29</u> on your calenders! Matches to be announced in the near future!<br/><br/><big>DODGEBALL 120</big><br/>The climactical season finale extraganza crashes Wall High School on January 5, 2008! Stayed tuned for more on this milestone! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball115AA.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DBCUN.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}