{
  "id": 77311,
  "url": "https://dodgeball.livejournal.com/77311.html",
  "title": "The FALL of DUSSELDORF",
  "date": "",
  "body_text": "The CREAMation 4\nMcCrorey, last-minute substitute Basista face off\nIn one of the year's newsmakers, the wildly intense Travis Mills was unable to attend this 116th extravaganza. But despite his unforunate absence, fans and spectators alike expected to see the proposed\nCREAMation 4\n- and that's exactly what they got!\nRookie-of-the-year candidate Sascha Basista stepped up to the plate a mere minutes before showtime, accepting the challenge of one of the most recognized figures to ever set foot on the dodgeball battlegrounds, Mr. Ryan McCrorey.\nFlash Results by Game\nMcCrorey: 1, 3, 4, 6, 7, 8, 9, 12\nBasista: 2, 5, 10, 11\nThe flash results do not lie as the 18 year-old sensation was in for a fight. The conclusion of the fifth round spelled doom for the young prodigy. Team MCCROREY with such allies like catching phenom Ryan Letsche and the ever-accurate Kevin Adams tackled the obstacle that stood ahead. Basista's attempted comeback came way late in the event and thus, he was\nCREAMated\n.\nRyan McCrorey defeated Sascha Basista, 8 to 4, with\nCREAMation Rules\non the line.\nMoments & Stars\n: Mike Edwards guarded by a garbage can; Sascha Basista darting and eventually captured following 116's official end\nWhat Happened?\nThe decline in attendance can perhaps be credited to a number of factors: the coming of final exams; last-minute holiday shopping; the cold, wet weather.\nPlus, legendary big mouth Justin Pierce may have suffered the game's plaguing finger injury. We here at\ndodgeball.livejournal.com\nhope to have update on his condition and certainly wish him well.\nRECORDS\n> Attendance: 17\n> New Players: (0)\n- The attendance of DODGEBALL 116 saw a rather large drop when compared to the last couple of weeks. The turnout of 17 is the lowest since DODGEBALL 77 in late-February.\n- After 27 weeks of dry weather, the streak came to an end at DODGEBALL 116. Not only was DODGEBALL 116\nWet War XXII\n, it was also the third\nSnow War\n. Three of the four\nCREAMation Rules\nencounters have been\nWet Wars\nas well (the Adams/Fitzpatrick at DODGEBALL 105 was not).\n- Even the match made headlines! Scheduled participant Travis Mills was unable to attend and one Sascha Basista would take his place at the very last minute. Basista unfortunately would lose the confrontation against Ryan McCrorey, 8 to 4, and reluctantly get\nCREAMated\n.\n- This was the second straight week Basista was captain. He lost both matches and moves to 2-4-1. McCrorey returned after well over a year out of the captains chair. This win improves his record to 2-1-1.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nDODGEBALL ONE-SEVENTEEN: 12.22.07\nA Christmas gift indeed ...\nJohn Tronolone\nclashes with\nTom Adams\nfor the very first time ever. Plus, listen up for the DODGEBALL CXX main event announcement.\nDODGEBALL 118: Friday, 12.28.07\nBoxBall Dodgeball\nkicks off two back-to-back nights of non-stop action!\nDODGEBALL 119: Saturday, 12.29.07\nThe test of endurance continues - what will happen at 119?\nDODGEBALL CXX: 1.5.08\nThe 2007\nGold Awards\npresented as well as the colossal season finale main event, that to be announced at DODGEBALL ONE-SEVENTEEN.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball116B.jpg\" vspace=\"3\"><big><b>The CREAMation 4</b><br/>McCrorey, last-minute substitute Basista face off</big><br/>In one of the year's newsmakers, the wildly intense Travis Mills was unable to attend this 116th extravaganza. But despite his unforunate absence, fans and spectators alike expected to see the proposed <i>CREAMation 4</i> - and that's exactly what they got!<br/><br/>Rookie-of-the-year candidate Sascha Basista stepped up to the plate a mere minutes before showtime, accepting the challenge of one of the most recognized figures to ever set foot on the dodgeball battlegrounds, Mr. Ryan McCrorey.<br/><br/><u>Flash Results by Game</u><br/>McCrorey: 1, 3, 4, 6, 7, 8, 9, 12<br/>Basista: 2, 5, 10, 11<br/><br/>The flash results do not lie as the 18 year-old sensation was in for a fight. The conclusion of the fifth round spelled doom for the young prodigy. Team MCCROREY with such allies like catching phenom Ryan Letsche and the ever-accurate Kevin Adams tackled the obstacle that stood ahead. Basista's attempted comeback came way late in the event and thus, he was <i>CREAMated</i>.<br/><br/>Ryan McCrorey defeated Sascha Basista, 8 to 4, with <i>CREAMation Rules</i> on the line.<br/><br/><b>Moments &amp; Stars</b>: Mike Edwards guarded by a garbage can; Sascha Basista darting and eventually captured following 116's official end<br/><br/><b>What Happened?</b><br/>The decline in attendance can perhaps be credited to a number of factors: the coming of final exams; last-minute holiday shopping; the cold, wet weather.<br/><br/>Plus, legendary big mouth Justin Pierce may have suffered the game's plaguing finger injury. We here at <i>dodgeball.livejournal.com</i> hope to have update on his condition and certainly wish him well.<br/><br/><big><b>RECORDS</b></big><br/>&gt; Attendance: 17<br/>&gt; New Players: (0)<br/><br/>- The attendance of DODGEBALL 116 saw a rather large drop when compared to the last couple of weeks. The turnout of 17 is the lowest since DODGEBALL 77 in late-February.<br/>- After 27 weeks of dry weather, the streak came to an end at DODGEBALL 116. Not only was DODGEBALL 116 <i>Wet War XXII</i>, it was also the third <i>Snow War</i>. Three of the four <i>CREAMation Rules</i> encounters have been <i>Wet Wars</i> as well (the Adams/Fitzpatrick at DODGEBALL 105 was not).<br/>- Even the match made headlines! Scheduled participant Travis Mills was unable to attend and one Sascha Basista would take his place at the very last minute. Basista unfortunately would lose the confrontation against Ryan McCrorey, 8 to 4, and reluctantly get <i>CREAMated</i>. <br/>- This was the second straight week Basista was captain. He lost both matches and moves to 2-4-1. McCrorey returned after well over a year out of the captains chair. This win improves his record to 2-1-1.<br/><br/><center><big><big>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</big></big></center><br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/117B1.jpg\" vspace=\"3\"/><big>DODGEBALL ONE-SEVENTEEN: 12.22.07</big><br/>A Christmas gift indeed ... <b>John Tronolone</b> clashes with <b>Tom Adams</b> for the very first time ever. Plus, listen up for the DODGEBALL CXX main event announcement.<br/><br/><big>DODGEBALL 118: Friday, 12.28.07</big><br/><b>BoxBall Dodgeball</b> kicks off two back-to-back nights of non-stop action!<br/><big>DODGEBALL 119: Saturday, 12.29.07</big><br/>The test of endurance continues - what will happen at 119?<br/><br/><big>DODGEBALL CXX: 1.5.08</big><br/>The 2007 <i>Gold Awards</i> presented as well as the colossal season finale main event, that to be announced at DODGEBALL ONE-SEVENTEEN. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball116B.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/117B1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}