{
  "id": 77959,
  "url": "https://dodgeball.livejournal.com/77959.html",
  "title": "The NORTH POLE",
  "date": "",
  "body_text": "The high-profile \"Dream Match\" between two honored figures -\nJohn Tronolone\nversus\nTom Adams\nfor the very first time ever! Santa's come early!\n\"How the West was Won\" quickly became the motto of this nail-biting 117th spectacular. Beginning not on the \"east\", the third eldest Adams struck first. Key allies such as flame-throwing right-hander Kevin Fitzpatrick and 8th grade superstar Rob Pellecchia were nearly unstoppable in the opening contest. Tronolone, though with a glowing smile, was not all too surprised with the initial outcome - his poor captains record a sure reason why. But the self-proclaimed \"Creation\" counted himself and his supporting cast out way too early because when Game 2 rolled around, Tronolone was on the board.\nFrom here on out, it was anybody's ballgame with the \"west side\" a place of good fortune and a little luck. Not until the grueling 8th round, two long hours into this bloodthristy conflict, did \"Greek God\" Adams finally break the curse of the \"east\", taking the pivotal multi-point lead  and ultimately spelling the demise of his \"Greek\" counterpart.\nFlash Results by Game\n:\nTom Adams defeated John Tronolone, 5 to 4\n.\nAdams: 1, 3, 5, 7, 8\nTronolone: 2, 4, 6, 9\nSince the Ocean Road Park days of '05 to the ultra-competitive Wall High School wars of the modern era, these iconic superpowers have completely annihilated one another. But despite the numerous, numbing nutshots and the ever-so brutal faceshot just a few short weeks ago, Tom and John could be seen respectfully shaking hands at the conclusion of this unforgettable 2nd Annual Christmas Spectacular.\nMoments & Stars\n: Melissa Kerr's incredible one-handed fumble catch; the ongoing saga between Tom Adams and Bobby Vetrano; newbie Doug Homan's impressive power display; the fearless showing from Michael Tronolone\nXmas Xtras!\nFirst and foremost, special\nThanks!\nto the one and only Chris Adams who put together one hell of a \"Chris-mas\" soundtrack - and he wasn't even there! That's dedication for you. Mike \"Sputz\" Krott, Melissa Kerr, and Diana DiBuccio beautifully decorated the court with holiday lights, signs, and glowing ribbon giving ONE-SEVENTEEN that special atmosphere. And it certainly wasn't hard to notice the attire and wacked-out hairstyles of some of the combatants: Sascha Basista and Cap. John Tronolone in their Dollar Tree Santa hats; Mike \"Sputz\" in a sweet yellow and purple Minnesota Vikings hat; and the outrageously spiked hairdo of rookie-of-the-year sensation Rob Pellecchia.\n2nd Annual Christmas RECORDS\nAttendance: 23\nNotable Returns: Michael Tronolone (last competed at DB 30); Dan Caron (last competed at DB LXXVI)\n*New Players: (3) Doug Homan, Dave Larsen, Casey Wolf\n- ONE-SEVENTEEN was the first event in Winter 2007/2008 and the 29th straight event held on the back courts of Wall High School.\n- *It had been three week dry spell without any new players.\n- In the special holiday showdown, Tom Adams narrowly defeated John Tronolone, 5 to 4.\n..\nTom Adams\nnow 5-2-0, is one of the most dominant captains ever. In his most previous match, he defeated Alison Bertsch at NINETY-NINE one day shy of his 21st birthday.\n..\nJohn Tronolone\nsuffered his record-breaking 8th loss, having gone winless the entire 2007 year. This was his record-tying 11th time as captain as well (along with Chris Adams).\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\nDODGEBALL 118: Double Header Friday!\nIt was to see the return of the ever-so violent\nBoxBall Dodgeball\n. Plans however have been scrapped - what will happen on this special Friday event? Find out December 28.\nDODGEBALL 119: Double Header Saturday!\nThe test of stamina and endurance continues on December 29. Who knows what to expect!\nDODGEBALL CXX: Season Finale Extravaganza!\nTheir never-say-die drive and overall athletic ability have catapulted each of these deserving participants to the pinnacle of a dodgeball player's career. As announced at DODGEBALL ONE-SEVENTEEN,\nPLAYER of the Year\nnominee\nRyan Letsche\nclashes with\nROOKIE of the Year\ncandidate\nGrant Cornero\nat the Season 12 Finale on January 5. This is will be a classic.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"3\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/117B1.jpg\" vspace=\"3\"><i>The high-profile \"Dream Match\" between two honored figures - <b>John Tronolone</b> versus <b>Tom Adams</b> for the very first time ever! Santa's come early!</i><br/><br/>\"How the West was Won\" quickly became the motto of this nail-biting 117th spectacular. Beginning not on the \"east\", the third eldest Adams struck first. Key allies such as flame-throwing right-hander Kevin Fitzpatrick and 8th grade superstar Rob Pellecchia were nearly unstoppable in the opening contest. Tronolone, though with a glowing smile, was not all too surprised with the initial outcome - his poor captains record a sure reason why. But the self-proclaimed \"Creation\" counted himself and his supporting cast out way too early because when Game 2 rolled around, Tronolone was on the board. <br/><br/>From here on out, it was anybody's ballgame with the \"west side\" a place of good fortune and a little luck. Not until the grueling 8th round, two long hours into this bloodthristy conflict, did \"Greek God\" Adams finally break the curse of the \"east\", taking the pivotal multi-point lead  and ultimately spelling the demise of his \"Greek\" counterpart.<br/><br/><u>Flash Results by Game</u>: <i>Tom Adams defeated John Tronolone, 5 to 4</i>.<br/>Adams: 1, 3, 5, 7, 8<br/>Tronolone: 2, 4, 6, 9<br/><br/>Since the Ocean Road Park days of '05 to the ultra-competitive Wall High School wars of the modern era, these iconic superpowers have completely annihilated one another. But despite the numerous, numbing nutshots and the ever-so brutal faceshot just a few short weeks ago, Tom and John could be seen respectfully shaking hands at the conclusion of this unforgettable 2nd Annual Christmas Spectacular. <br/><br/><b>Moments &amp; Stars</b>: Melissa Kerr's incredible one-handed fumble catch; the ongoing saga between Tom Adams and Bobby Vetrano; newbie Doug Homan's impressive power display; the fearless showing from Michael Tronolone<br/><br/><b>Xmas Xtras!</b><br/>First and foremost, special <i>Thanks!</i> to the one and only Chris Adams who put together one hell of a \"Chris-mas\" soundtrack - and he wasn't even there! That's dedication for you. Mike \"Sputz\" Krott, Melissa Kerr, and Diana DiBuccio beautifully decorated the court with holiday lights, signs, and glowing ribbon giving ONE-SEVENTEEN that special atmosphere. And it certainly wasn't hard to notice the attire and wacked-out hairstyles of some of the combatants: Sascha Basista and Cap. John Tronolone in their Dollar Tree Santa hats; Mike \"Sputz\" in a sweet yellow and purple Minnesota Vikings hat; and the outrageously spiked hairdo of rookie-of-the-year sensation Rob Pellecchia.<br/><br/><big><b>2nd Annual Christmas RECORDS</b></big><br/>Attendance: 23<br/>Notable Returns: Michael Tronolone (last competed at DB 30); Dan Caron (last competed at DB LXXVI)<br/>*New Players: (3) Doug Homan, Dave Larsen, Casey Wolf<br/><br/>- ONE-SEVENTEEN was the first event in Winter 2007/2008 and the 29th straight event held on the back courts of Wall High School.<br/>- *It had been three week dry spell without any new players. <br/>- In the special holiday showdown, Tom Adams narrowly defeated John Tronolone, 5 to 4.<br/>.. <u>Tom Adams</u> now 5-2-0, is one of the most dominant captains ever. In his most previous match, he defeated Alison Bertsch at NINETY-NINE one day shy of his 21st birthday.<br/>.. <u>John Tronolone</u> suffered his record-breaking 8th loss, having gone winless the entire 2007 year. This was his record-tying 11th time as captain as well (along with Chris Adams).<br/><br/><center><big><b>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</b></big></center><br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/120Cw.jpg\" vspace=\"3\"/><big>DODGEBALL 118: Double Header Friday!</big><br/>It was to see the return of the ever-so violent <i>BoxBall Dodgeball</i>. Plans however have been scrapped - what will happen on this special Friday event? Find out December 28.<br/><br/><big>DODGEBALL 119: Double Header Saturday!</big><br/>The test of stamina and endurance continues on December 29. Who knows what to expect!<br/><br/><big>DODGEBALL CXX: Season Finale Extravaganza!</big><br/>Their never-say-die drive and overall athletic ability have catapulted each of these deserving participants to the pinnacle of a dodgeball player's career. As announced at DODGEBALL ONE-SEVENTEEN, <i>PLAYER of the Year</i> nominee <b>Ryan Letsche</b> clashes with <i>ROOKIE of the Year</i> candidate <b>Grant Cornero</b> at the Season 12 Finale on January 5. This is will be a classic.<br/><center><iframe allowfullscreen=\"\" class=\"lj_embedcontent\" frameborder=\"0\" height=\"50\" name=\"embed_434169_13\" src=\"https://l.lj-toys.com/?auth_token=sessionless%3A1770591600%3Aembedcontent%3A434169%2613%26%26%3Af2a6e1925822984bdf0edd86b4f31958f8eb8ec8&amp;moduleid=13&amp;preview=&amp;journalid=434169&amp;noads=\" width=\"200\"></iframe><a href=\"http://boomp3.com/m/585881af34be\" rel=\"nofollow\" style=\"font-size: 9px; color: #ccc; letter-spacing: -1px; text-decoration: none\" target=\"_blank\"></a></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/117B1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/120Cw.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}