{
  "id": 79353,
  "url": "https://dodgeball.livejournal.com/79353.html",
  "title": "Baby I'm READY To GO II: CXX Final Preview",
  "date": "",
  "body_text": "As Voted by You, The Crew!\nThe impatiently-long wait is finally over. Which deserving individuals will walk out of DODGEBALL CXX with a presitigious\nGold Award\n? The live trophy presentation reveals all!\nThe Sight, The Sound, The Future!\nDecorative yellow and blue flags, streamers drapped along the perimeter, the blinking bright lights hanging from the tennis polls - it'll be a sight to see. The sound? One can't go wrong with the red hot rockin' CXX Soundtrack, kicked off by Republica's \"Ready to Go\"! And what's next after such a ginormous extravaganza? Just listen up for information regarding Season 13!\nSuperBowl Blockbuster!\nAnd in the superbowl-size showdown, in the most crucial encounter of both participants' careers, innovative catching phenom\nRyan Letsche\nfiercely collides with rookie sensation\nGrant Cornero\n. Who will grab the brass ring?\nPete and Elda Invite You for More!\nAn event of this caliber just can't end oh-so suddenly. Join the warriors of\nEastCoastDodgeball\nfor a fun-filled gathering at the one and only Pete and Elda's Restuarant on Route 35 in Neptune! Be there 10:45pm!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><b><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/120groundz.jpg\" vspace=\"2\">As Voted by You, The Crew!</img></b></big> <br/>The impatiently-long wait is finally over. Which deserving individuals will walk out of DODGEBALL CXX with a presitigious <i>Gold Award</i>? The live trophy presentation reveals all!<br/><br/><big><b>The Sight, The Sound, The Future!</b></big> <br/>Decorative yellow and blue flags, streamers drapped along the perimeter, the blinking bright lights hanging from the tennis polls - it'll be a sight to see. The sound? One can't go wrong with the red hot rockin' CXX Soundtrack, kicked off by Republica's \"Ready to Go\"! And what's next after such a ginormous extravaganza? Just listen up for information regarding Season 13!<br/><br/><big><b>SuperBowl Blockbuster!</b></big> <br/>And in the superbowl-size showdown, in the most crucial encounter of both participants' careers, innovative catching phenom <b>Ryan Letsche</b> fiercely collides with rookie sensation <b>Grant Cornero</b>. Who will grab the brass ring?<br/><br/><big><b>Pete and Elda Invite You for More!</b></big><br/>An event of this caliber just can't end oh-so suddenly. Join the warriors of <i>EastCoastDodgeball</i> for a fun-filled gathering at the one and only Pete and Elda's Restuarant on Route 35 in Neptune! Be there 10:45pm! </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/120groundz.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}