{
  "id": 83188,
  "url": "https://dodgeball.livejournal.com/83188.html",
  "title": "Whatever REAGAN Said",
  "date": "",
  "body_text": "Okay, so maybe the ex-president's famous 1987 speech doesn't exactly apply to the blood-thirsty, never-ending conflict that is\nWALL vs. ALL\n. But the \"wall\" ALL was forced to contend with was damn near indestructible itself! Those damn \"Knights\" never give up!\nCXX7:\nWALL vs. ALL 5\nIndeed, those\nKnights\nfight to the bitter end; not an ounce of quit in any of them. But having to withstand a constant onslaught from a pack of hungry, greedy, outnumbering invaders, on this night anyway, was too much for any mass to deal with.\nFlash Results by Game\nWALL: 1\nALL: 2, 3, 4, 5, 6\nThe homeland defenders used all of their resources and knowledge to capture the first of six battles on this frigid February evening. Oh but how suddenly things changed.\nThat one, measly point would not increase over the course of the next several hours. Team ALL, proudly lead by Londono, Krott, and assassin Megill, rifled lightning-fast bulletballs and  quickly snatched enemy fire like a fly caught in a spider's web\n(Boo! You Suck!)\n.\nMuch like the \"Berlin\" two decades ago, Team WALL falls in this Season 13 blockbuster. But what an effort put forth by all competitors, especially the hometown bad-asses. The harsh winter weather, icy playing surface, and for Team WALL specifically, the lack of mainstay allies, \"The Writer\" tips his hat to all twenty of you.\nTeam ALL defeated Team WALL, 5 to 1.\nMoments & Stars\n: Juan Londono pelted in the ear by Kevin Adams; Kevin Megill's catching and throwing rampage throughout Game 4; Ryan Letsche's stunning Game 5 \"Last Man Standing\" performance; the courts becoming icy towards CXX7's conclusion\nThe YEARBOOK\nMembers of the fifth Team ALL incarnation came from the following schools:\nManasquan\n(Krott, Londono, Megill)\n; Ocean Township\n(Edwards, Everett, Vetrano)\n; Monmouth Regional\n(Tronolone)\n; Freehold Borough\n(Pham)\n; Monsignor Donovan\n(Turner)\n; Allentown\n(DiBuccio)\n; Neptune\n(Butler)\nWhat's Left in Season 13?\n(Scroll down for the shocking announcements!)\nRECORDS\nAttendance:\n20\n(18 men, 2 women)\nNotable Return: Chris Everett (previous DODGEBALL CX).\n- Despite a nasty winter storm in the days leading up CXX7, not once did it rain or snow during the event itself.\n- Because of the forthcoming high school tennis season, the tennis nets were back up.\n-\nWALL vs. ALL 5\nwitnessed Team ALL soundly defeat the hometown heroes by a score of 5 to 1. WALL leads the series 3-2.\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nDODGEBALL 128\nEven \"The Writer\" loves this one! What in God's name will happen when the two most reckless, suicidal individuals meet on the\n1st of March\n? Find out live -\nRob Avakian\none-on-one with\nJoey Smalls\n.\nDODGEBALL 129\nIt was bound to happen! The brightest of young stars share the spotlight on\nMarch 8\nwhen 2007\nROOKIE of the Year\nnominee\nRob Pellecchia\ntakes on 2008's new sensation\nBobby Vetrano\n!\nDODGEBALL C30\nHonored, emulated framers of the game - one epic encounter two and a half years in the making. The left-handed dodgeball god\nKevin Megill\nclashes with the flame-throwing icon himself\nChris Adams\non\nMarch 15\n.\nStay tuned right here to\ndodgeball.livejournal.com\nfor every detail concerning these never-before-seen bouts. Further information regarding the Season 13 Finale, DODGEBALL C30, will also be released in the coming weeks.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/wvalist.jpg\" vspace=\"2\"><br/><i>Okay, so maybe the ex-president's famous 1987 speech doesn't exactly apply to the blood-thirsty, never-ending conflict that is <u>WALL vs. ALL</u>. But the \"wall\" ALL was forced to contend with was damn near indestructible itself! Those damn \"Knights\" never give up!</i><br/><br/><big><b>CXX7: <i>WALL vs. ALL 5</i></b></big><br/>Indeed, those <i>Knights</i> fight to the bitter end; not an ounce of quit in any of them. But having to withstand a constant onslaught from a pack of hungry, greedy, outnumbering invaders, on this night anyway, was too much for any mass to deal with.<br/><br/><u>Flash Results by Game</u><br/>WALL: 1<br/>ALL: 2, 3, 4, 5, 6<br/><br/>The homeland defenders used all of their resources and knowledge to capture the first of six battles on this frigid February evening. Oh but how suddenly things changed.<br/><br/>That one, measly point would not increase over the course of the next several hours. Team ALL, proudly lead by Londono, Krott, and assassin Megill, rifled lightning-fast bulletballs and  quickly snatched enemy fire like a fly caught in a spider's web <i>(Boo! You Suck!)</i>.<br/><br/>Much like the \"Berlin\" two decades ago, Team WALL falls in this Season 13 blockbuster. But what an effort put forth by all competitors, especially the hometown bad-asses. The harsh winter weather, icy playing surface, and for Team WALL specifically, the lack of mainstay allies, \"The Writer\" tips his hat to all twenty of you.<br/><br/><i>Team ALL defeated Team WALL, 5 to 1.</i><br/><br/><b>Moments &amp; Stars</b>: Juan Londono pelted in the ear by Kevin Adams; Kevin Megill's catching and throwing rampage throughout Game 4; Ryan Letsche's stunning Game 5 \"Last Man Standing\" performance; the courts becoming icy towards CXX7's conclusion<br/><br/><b>The YEARBOOK</b><br/>Members of the fifth Team ALL incarnation came from the following schools:<br/>Manasquan <i>(Krott, Londono, Megill)</i>; Ocean Township <i>(Edwards, Everett, Vetrano)</i>; Monmouth Regional <i>(Tronolone)</i>; Freehold Borough <i>(Pham)</i>; Monsignor Donovan <i>(Turner)</i>; Allentown <i>(DiBuccio)</i>; Neptune <i>(Butler)</i><br/><br/><b>What's Left in Season 13?</b><br/><i>(Scroll down for the shocking announcements!)</i><br/><br/><big>RECORDS</big><br/>Attendance: <b>20</b> (18 men, 2 women)<br/>Notable Return: Chris Everett (previous DODGEBALL CX).<br/><br/>- Despite a nasty winter storm in the days leading up CXX7, not once did it rain or snow during the event itself.<br/>- Because of the forthcoming high school tennis season, the tennis nets were back up. <br/>- <i>WALL vs. ALL 5</i> witnessed Team ALL soundly defeat the hometown heroes by a score of 5 to 1. WALL leads the series 3-2.<br/><center><big><big>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~</big></big></center><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/130ROAD.jpg\" vspace=\"2\"/><i><big>DODGEBALL 128</big></i><br/>Even \"The Writer\" loves this one! What in God's name will happen when the two most reckless, suicidal individuals meet on the <u>1st of March</u>? Find out live - <b>Rob Avakian</b> one-on-one with <b>Joey Smalls</b>.<br/><br/><i><big>DODGEBALL 129</big></i><br/>It was bound to happen! The brightest of young stars share the spotlight on <u>March 8</u> when 2007 <i>ROOKIE of the Year</i> nominee <b>Rob Pellecchia</b> takes on 2008's new sensation <b>Bobby Vetrano</b>!<br/><br/><i><big>DODGEBALL C30</big></i><br/>Honored, emulated framers of the game - one epic encounter two and a half years in the making. The left-handed dodgeball god <b>Kevin Megill</b> clashes with the flame-throwing icon himself <b>Chris Adams</b> on <u>March 15</u>.<br/><br/><br/><i>Stay tuned right here to <u>dodgeball.livejournal.com</u> for every detail concerning these never-before-seen bouts. Further information regarding the Season 13 Finale, DODGEBALL C30, will also be released in the coming weeks.</i> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/wvalist.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/130ROAD.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}