{
  "id": 83255,
  "url": "https://dodgeball.livejournal.com/83255.html",
  "title": "Just Don't Do ANYTHING STUPID",
  "date": "",
  "body_text": "DODGEBALL 128:\nAvakian vs. Smalls\nOne can laugh - almost.\nFearlessly reckless. Wildly insane. 100% unpredictable. Come the 1st of March, honored captains. Just a few choice phrases to paint this 128th picture.\nRob Avakian\n, the legend himself competing since the sport's inception, has not just happily accepted this encounter, but rather surprisingly\nrequested\nit in the first place! \"Eddie Gordo\"\nSmalls\nhas been out of the captain's spotlight for a multiple number of months, so why would he turn back the challenge!\nRegardless of how DODGEBALL 128 came about,\nThe Road to C30\njust got a hell of a lot sweeter with this show-stealing war set to take place. Catch this never-before-witnessed showdown live, March 1, only at Wall High School.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"left\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/128Axa.jpg\" vspace=\"2\"><big><b>DODGEBALL 128: <i>Avakian vs. Smalls</i></b></big><br/>One can laugh - almost.<br/><br/>Fearlessly reckless. Wildly insane. 100% unpredictable. Come the 1st of March, honored captains. Just a few choice phrases to paint this 128th picture. <b>Rob Avakian</b>, the legend himself competing since the sport's inception, has not just happily accepted this encounter, but rather surprisingly <i>requested</i> it in the first place! \"Eddie Gordo\" <b>Smalls</b> has been out of the captain's spotlight for a multiple number of months, so why would he turn back the challenge! <br/><br/>Regardless of how DODGEBALL 128 came about, <i>The Road to C30</i> just got a hell of a lot sweeter with this show-stealing war set to take place. Catch this never-before-witnessed showdown live, March 1, only at Wall High School. <br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><small><small> </small></small> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/128Axa.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}