{
  "id": 83933,
  "url": "https://dodgeball.livejournal.com/83933.html",
  "title": "Is It Time To WAKE UP?",
  "date": "",
  "body_text": "Let's just cut right to chase ...\nEastCoastDodgeball has been ever-so blessed in its two years-plus existence and the forthcoming confrontations are sure reasons why. Anyone who debates or argues that point must be living under a shell.\nRob Pellecchia, Bobby Vetrano, Kevin Megill, Chris Adams\n- four of the most celebrated and respected athletes share the spotlight to conclude what has truly been a fantastically star-studded, one-of-a-kind 13th Season.\nPellecchia, Vetrano at 129\nThese young sensations enter unfamiliar territory at DODGEBALL 129 as neither have ever been granted the coveted team general's position - until now. And despite few physical altercations between the two, one must have been hibernating to have not predicted this soon-to-be epic collision.\nThe lions of old took immediate notice at the monumental debut of prodigy\nRob Pellecchia\n. This 14 year-old all-star carries all the goods - speed, agility, power, heart - traits that catapulted  this 2007\nROOKIE of the Year\nnominee to the top of the ranks. His counterpart in this 129th showdown isn't just another face in the crowd either.\nThe success of elder cousin, the legendary Ryan Letsche, could easily be associated with the 15 year-old mogul\nBobby Vetrano\nright from his beginning days. Enduring rivalries with superpowers Tom Adams, Kevin Fitzpatrick, Kevin Adams, and even Letsche himself have put and kept the kid on the map.\nThe electricity generated from these two young bucks will indeed be felt court-wide. Catch this feverishly-awaited encounter on March 8.\nDODGEBALL C30 coming March 15\nThis epic needs no hype -\nChris Adams\nversus\nKevin Megill\nat the one and only Season 13 Finale. The pregame\n\"MoneyMaker\" Rimshot Contest\nas well as the celebratory  Pete & Elda's gathering are just a fraction for what's in store for the grandest event of the year.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/129matchzx.jpg\" vspace=\"2\"><i>Let's just cut right to chase ...<br/><br/>EastCoastDodgeball has been ever-so blessed in its two years-plus existence and the forthcoming confrontations are sure reasons why. Anyone who debates or argues that point must be living under a shell. <b>Rob Pellecchia, Bobby Vetrano, Kevin Megill, Chris Adams</b> - four of the most celebrated and respected athletes share the spotlight to conclude what has truly been a fantastically star-studded, one-of-a-kind 13th Season.</i><br/><br/><big><b>Pellecchia, Vetrano at 129</b></big><br/>These young sensations enter unfamiliar territory at DODGEBALL 129 as neither have ever been granted the coveted team general's position - until now. And despite few physical altercations between the two, one must have been hibernating to have not predicted this soon-to-be epic collision.<br/><br/>The lions of old took immediate notice at the monumental debut of prodigy <b>Rob Pellecchia</b>. This 14 year-old all-star carries all the goods - speed, agility, power, heart - traits that catapulted  this 2007 <i>ROOKIE of the Year</i> nominee to the top of the ranks. His counterpart in this 129th showdown isn't just another face in the crowd either.<br/><br/>The success of elder cousin, the legendary Ryan Letsche, could easily be associated with the 15 year-old mogul <b>Bobby Vetrano</b> right from his beginning days. Enduring rivalries with superpowers Tom Adams, Kevin Fitzpatrick, Kevin Adams, and even Letsche himself have put and kept the kid on the map.<br/><br/>The electricity generated from these two young bucks will indeed be felt court-wide. Catch this feverishly-awaited encounter on March 8.<br/><br/><big><b>DODGEBALL C30 coming March 15</b></big><br/>This epic needs no hype - <b>Chris Adams</b> versus <b>Kevin Megill</b> at the one and only Season 13 Finale. The pregame <i>\"MoneyMaker\" Rimshot Contest</i> as well as the celebratory  Pete &amp; Elda's gathering are just a fraction for what's in store for the grandest event of the year. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/129matchzx.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}