{
  "id": 84719,
  "url": "https://dodgeball.livejournal.com/84719.html",
  "title": "Runnin' Down a DREAM",
  "date": "",
  "body_text": "Many encounters have been termed \"dream matches\", but perhaps never has that description been more fitting than it is now. It's amazing that arguably the two most respected, decorated stars have gone all these\nyears\nwithout ever meeting. But at DODGEBALL C30, the idea of the \"dream\" became an ultimate reality.\nAnd so it goes ... iconic southpaw\nKevin Megill\n, legendary powerhouse\nChris Adams\n- undoubtedly one of the biggest confrontations on the SuperBowl stage!\nMATCH SUMMARY\nOne had to question if either man would ever be the same following such a masterpiece of mayhem - the inaugural round of this seven game series all the evidence needed. The show-stealing performance from Megill's DODGEBALL 80 adversary-turned-teammate Mike Edwards allowed Megill to gain the first point of the match.\nThe momentum carried throughout the next hour of play, with the flame-throwing left-hander extending the lead to 3. With a firm grip on the contest, could Megill close out the remaining portion of DODGEBALL C30 to his benefit?\nThe Megill-lead massacre, as strong and powerful as imagined, would be temporarily halted by an Adams onslaught in Game 4. Backed by dynamite first choice Grant Cornero, rim-smacking Mike Butler, and future season finale headliner Juan Londono, the eldest of the Adams clan physically assaulted his resilient enemies to finally get on the board. But \"The Axe's\" equally fearsome foe wasn't finished just yet.\n\"I'm Captain, and we can't lose!\", exclaimed a highly-motivated Megill in an attempt to reenergize and refocus his pack of predators. And refocus indeed. With time quickly winding down, the former 14-year powerhouse pitcher regrouped from the minor setback and steadily climbed atop the mountain known as DODGEBALL C30.\nFlash Results by Game\n... Megill: 1, 2, 3, 5, 6; Adams: 4, 7\nKevin Megill\nsuccessfully fought off the forces of\nChris Adams\n, 5 to 2, at the 130th\nEastCoastDodgeball\nspectacular.\nWarriors that exited the Wall High School battlegrounds couldn't help but notice the cracks on 18th Avenue - the collision between Megill and Adams jostled the very foundations of the earth! What an absolutely brutal, physically scarring altercation!\nMike \"Sputz\" Krott\nleft DODGEBALL C30 with a streak of pride a mile wide and some dough - $11 to be exact! The catching phenom himself outlasted ten other competitors in the sport's first\nMoneyMaker\nRimshot Contest, defeating runner-up Juan Londono in the final round.\nFull list of entries into this pregame competition: Bobby Vetrano, Chris Adams, Diana DiBuccio, Grant Cornero, Joe Kelly, John Tronolone, Juan Londono, Melissa Kerr, Mike \"Sputz\" Krott, Ryan Letsche, and Travis Mills.\nSEASON 13\n-->\nButler vs. Butler\n, Lauren Winston and Grant Cornero\nCREAMated\n, and ALL's destruction of WALL were just some of the highlights over the past 10-week program.\n--> This 13th Season generated an average attendance of 22.4 and produced a record-low 9 new players.\n--> DODGEBALL 125 and DODGEBALL 128 were the only\nWet Wars\n. It should also be noted that DODGEBALL 128 was a\nSnow War\nas well.\n--> Diana DiBuccio, Juan Londono, and John Tronolone attended every Season 13 event, spanning from DODGEBALL 121 in mid-January to the March 15th finale DODGEBALL C30.\nDODGEBALL C30\n--> Most would agree the decorations for DODGEBALL C30 were rather ... interesting. Streamers stretched several yards from various points of the court, the\nStar Rims\nwere hung just for the hell of it, and two 70-foot clotheslines some 10 feet in the air seemingly served no purpose. It looked like a war zone even before C30 officially began! At least there were Christmas lights.\n--> The C30 Soundtrack was organized by female titans Diana DiBuccio and Melissa Kerr and featured a mix of rock, rap, and dance themes, specifically from the\nJock Jams\nCD.\n--> The first-ever\nMoneyMaker\nRimshot Contest is just one of several different variations of the popular pregame. Mike \"Sputz\" Krott ended up the sole survivor of this one, walking out of DODGEBALL C30 $11 richer.\n--> First Pick for Kevin Megill:\nJohn Tronolone\n--> First Pick for Chris Adams:\nGrant Cornero\nDODGEBALL 131 Announcement - shocking DODGEBALL 140 Revelation!\nTravis Mills and Kristen Driscoll team up to take on Valerie Winston, Sascha Basista, and John Tronolone in a 2 vs. 3\nCREAMation Rules\nencounter, one week before they all leave for WrestleMania XXIV! It all goes down March 22!\nDODGEBALL 140 comes to live May 31, and never before has a season's main attraction been established prior to its start! Regardless,\nEastCoastDodgeball\nis overly thrilled to give you this:\nJustin Wolf\nvs.\nJuan Londono\nat the Season 14 Conclusion!\nIt's a ten event for goodness sake - just some of the happenings guaranteed you'll never forget!\n--> The Game 1, one on one showdown between Mike Edwards and soon-to-be season finale headliner Juan Londono.\n--> Captain Chris Adams wrapped in white streamers.\n--> Captain Kevin Megill hitting rim when needed in Game 1 and accidentally in Game 2.\n--> Michelle Mullins kicking ass and taking names.\n--> The returning Chris Daly, not surprisingly to those that know him, participating barefoot. Captain Adams was also without footwear at one point during the night.\n--> A slew of combatants dancing to the many hip-hop and dance songs.\n--> Luke Frazza delivering some free goodies!\n--> Grant Cornero missing a 20 foot lob from Mike Edwards.\n--> Ryan Letsche's incredible string of front line blocks and dodges during Game 6.\n--> Mike \"Sputz\" Krott falling backward after catching a rifled bulletball from John Tronolone.\n--> Travis Mills receiving two nutshots; one from opponent Melissa Kerr and the other from teammate Justin Wolf during\nPrison Ball\n.\nAttendance of DODGEBALL C30 was\n30\n, comprised of 19 men and 11 women.\nNew Players\nincluded John Cusic, Anthony Fossani, and Bianca Basilone.\nDODGEBALL C30 welcomed back several of\nEastCoastDodgeball's\nfinest talents: Alysha Kelly (previous DB 42); Joe Kelly (previous DB LX3); Jason Teitelbaum (previous DB 102); Chris Daly (previous DB 119); Kathryn Nogueira (previous CXX); Sara DeCuir (previous DB 122)\nDODGEBALL C30 was the fourth season finale extravaganza held on the Front Courts of Wall High School. This was largely due to the continuing tennis lights failure.\nThe month of March has hosted 3 season finales; more than other time of the year. DODGEBALL 30 took place on March 12, 2006, while last year's DODGEBALL 80 was held on St. Patrick's Day on the 17th.\nThe official theme song was \"Runnin' Down a Dream\" by Tom Petty & the Heartbreakers.\nDODGEBALL C30 was just the third ten event to feature a\nRimshot Contest\nof any kind. DODGEBALL 50 in the Summer of 2006 and DODGEBALL LX from October of that year also featured the special pregame competition.\nThe captains for this milestone event were legendary figures Kevin Megill and Chris Adams. This was the first meeting between the two, despite each competing in over 100 events.\n..\nKevin Megill\nmade his third season finale captains appearance, having headlined DODGEBALL 30 and DODGEBALL 80 [both held in the month of March]. He leaves C30 with an overall 6-1-1 record, having become only the third competitor in history to reach six total victories.\n..\nChris Adams\nalso made his third season finale captains appearance, having headlined DODGEBALL 50 and DODGEBALL 70. He leaves C30 with an overall 6-6-0 record, having become the first competitor in history to lead a team into battle 12 times.\nAlysha Kelly was the only competitor of the total 30 to have never competed in a ten event.\nJohn Tronolone is now the sole combatant to participate in all 13 season finales. Kevin Adams had the streak of 12 going, but wound up missing DODGEBALL C30 due to his senior class trip.\nDODGEBALL C30 not only ended the 13th ten-week program, but the Winter 2007/2008 season as well. The sport will head in to its third Spring beginning with DODGEBALL 131 on March 22.\nC30 Soundtrack\nSpecial\nThanks!\nto both Melissa Kerr and Diana DiBuccio for the work they put forth towards the red hot playlist.\nThe Atmosphere\nNearly everyone in attendance helped out in setting up and taking down the decorations.\nThank You\nall!\nNow That Winter is Over ...\nTo everyone who participated or simply watched in awe,\nThanks!\nfor making this time period one of the most exciting ever! Over two and a half years later and we're still going strong!\nThe 130th EastCoastDodgeball extravaganza ... what did you think?\nA: Trust me, I'll be back.\nB: A fun time all-around.\nC: Some moments here and there.\nD: More negatives than positives.\nE: I'd rather visit the dentist.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30collage.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30collage.jpg\"/></a></center><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-mainevent.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-mainevent.jpg\"/></a></center><br/>Many encounters have been termed \"dream matches\", but perhaps never has that description been more fitting than it is now. It's amazing that arguably the two most respected, decorated stars have gone all these <i>years</i> without ever meeting. But at DODGEBALL C30, the idea of the \"dream\" became an ultimate reality.<br/><br/>And so it goes ... iconic southpaw <b>Kevin Megill</b>, legendary powerhouse <b>Chris Adams</b> - undoubtedly one of the biggest confrontations on the SuperBowl stage!<br/><br/><center><u>MATCH SUMMARY</u></center>One had to question if either man would ever be the same following such a masterpiece of mayhem - the inaugural round of this seven game series all the evidence needed. The show-stealing performance from Megill's DODGEBALL 80 adversary-turned-teammate Mike Edwards allowed Megill to gain the first point of the match.<br/><br/>The momentum carried throughout the next hour of play, with the flame-throwing left-hander extending the lead to 3. With a firm grip on the contest, could Megill close out the remaining portion of DODGEBALL C30 to his benefit?<br/><br/>The Megill-lead massacre, as strong and powerful as imagined, would be temporarily halted by an Adams onslaught in Game 4. Backed by dynamite first choice Grant Cornero, rim-smacking Mike Butler, and future season finale headliner Juan Londono, the eldest of the Adams clan physically assaulted his resilient enemies to finally get on the board. But \"The Axe's\" equally fearsome foe wasn't finished just yet.<br/><br/>\"I'm Captain, and we can't lose!\", exclaimed a highly-motivated Megill in an attempt to reenergize and refocus his pack of predators. And refocus indeed. With time quickly winding down, the former 14-year powerhouse pitcher regrouped from the minor setback and steadily climbed atop the mountain known as DODGEBALL C30.<br/><br/><u>Flash Results by Game</u> ... Megill: 1, 2, 3, 5, 6; Adams: 4, 7<br/><br/><b>Kevin Megill</b> successfully fought off the forces of <b>Chris Adams</b>, 5 to 2, at the 130th <i>EastCoastDodgeball</i> spectacular.<br/><br/>Warriors that exited the Wall High School battlegrounds couldn't help but notice the cracks on 18th Avenue - the collision between Megill and Adams jostled the very foundations of the earth! What an absolutely brutal, physically scarring altercation!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-.jpg\"/></a></center><br/><b>Mike \"Sputz\" Krott</b> left DODGEBALL C30 with a streak of pride a mile wide and some dough - $11 to be exact! The catching phenom himself outlasted ten other competitors in the sport's first <i>MoneyMaker</i> Rimshot Contest, defeating runner-up Juan Londono in the final round.<br/><br/>Full list of entries into this pregame competition: Bobby Vetrano, Chris Adams, Diana DiBuccio, Grant Cornero, Joe Kelly, John Tronolone, Juan Londono, Melissa Kerr, Mike \"Sputz\" Krott, Ryan Letsche, and Travis Mills.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-facts.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-facts.jpg\"/></a></center><br/><big>SEASON 13</big><br/>--&gt; <i>Butler vs. Butler</i>, Lauren Winston and Grant Cornero <i>CREAMated</i>, and ALL's destruction of WALL were just some of the highlights over the past 10-week program.<br/>--&gt; This 13th Season generated an average attendance of 22.4 and produced a record-low 9 new players.<br/>--&gt; DODGEBALL 125 and DODGEBALL 128 were the only <i>Wet Wars</i>. It should also be noted that DODGEBALL 128 was a <i>Snow War</i> as well.<br/>--&gt; Diana DiBuccio, Juan Londono, and John Tronolone attended every Season 13 event, spanning from DODGEBALL 121 in mid-January to the March 15th finale DODGEBALL C30.<br/><br/><big>DODGEBALL C30</big><br/>--&gt; Most would agree the decorations for DODGEBALL C30 were rather ... interesting. Streamers stretched several yards from various points of the court, the <i>Star Rims</i> were hung just for the hell of it, and two 70-foot clotheslines some 10 feet in the air seemingly served no purpose. It looked like a war zone even before C30 officially began! At least there were Christmas lights.<br/>--&gt; The C30 Soundtrack was organized by female titans Diana DiBuccio and Melissa Kerr and featured a mix of rock, rap, and dance themes, specifically from the <i>Jock Jams</i> CD.<br/>--&gt; The first-ever <i>MoneyMaker</i> Rimshot Contest is just one of several different variations of the popular pregame. Mike \"Sputz\" Krott ended up the sole survivor of this one, walking out of DODGEBALL C30 $11 richer.<br/>--&gt; First Pick for Kevin Megill: <i>John Tronolone</i><br/>--&gt; First Pick for Chris Adams: <i>Grant Cornero</i><br/><br/><big>DODGEBALL 131 Announcement - shocking DODGEBALL 140 Revelation!</big><br/>Travis Mills and Kristen Driscoll team up to take on Valerie Winston, Sascha Basista, and John Tronolone in a 2 vs. 3 <i>CREAMation Rules</i> encounter, one week before they all leave for WrestleMania XXIV! It all goes down March 22!<br/><br/>DODGEBALL 140 comes to live May 31, and never before has a season's main attraction been established prior to its start! Regardless, <i>EastCoastDodgeball</i> is overly thrilled to give you this: <b>Justin Wolf</b> vs. <b>Juan Londono</b> at the Season 14 Conclusion!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-moments.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-moments.jpg\"/></a></center><br/>It's a ten event for goodness sake - just some of the happenings guaranteed you'll never forget!<br/>--&gt; The Game 1, one on one showdown between Mike Edwards and soon-to-be season finale headliner Juan Londono.<br/>--&gt; Captain Chris Adams wrapped in white streamers.<br/>--&gt; Captain Kevin Megill hitting rim when needed in Game 1 and accidentally in Game 2.<br/>--&gt; Michelle Mullins kicking ass and taking names.<br/>--&gt; The returning Chris Daly, not surprisingly to those that know him, participating barefoot. Captain Adams was also without footwear at one point during the night.<br/>--&gt; A slew of combatants dancing to the many hip-hop and dance songs.<br/>--&gt; Luke Frazza delivering some free goodies!<br/>--&gt; Grant Cornero missing a 20 foot lob from Mike Edwards.<br/>--&gt; Ryan Letsche's incredible string of front line blocks and dodges during Game 6.<br/>--&gt; Mike \"Sputz\" Krott falling backward after catching a rifled bulletball from John Tronolone.<br/>--&gt; Travis Mills receiving two nutshots; one from opponent Melissa Kerr and the other from teammate Justin Wolf during <i>Prison Ball</i>.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-records.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-records.jpg\"/></a></center><br/>Attendance of DODGEBALL C30 was <b>30</b>, comprised of 19 men and 11 women.<br/><br/><b>New Players </b> included John Cusic, Anthony Fossani, and Bianca Basilone.<br/><br/>DODGEBALL C30 welcomed back several of <i>EastCoastDodgeball's</i> finest talents: Alysha Kelly (previous DB 42); Joe Kelly (previous DB LX3); Jason Teitelbaum (previous DB 102); Chris Daly (previous DB 119); Kathryn Nogueira (previous CXX); Sara DeCuir (previous DB 122)<br/><br/>DODGEBALL C30 was the fourth season finale extravaganza held on the Front Courts of Wall High School. This was largely due to the continuing tennis lights failure.<br/><br/>The month of March has hosted 3 season finales; more than other time of the year. DODGEBALL 30 took place on March 12, 2006, while last year's DODGEBALL 80 was held on St. Patrick's Day on the 17th.<br/><br/>The official theme song was \"Runnin' Down a Dream\" by Tom Petty &amp; the Heartbreakers.<br/><br/>DODGEBALL C30 was just the third ten event to feature a <i>Rimshot Contest</i> of any kind. DODGEBALL 50 in the Summer of 2006 and DODGEBALL LX from October of that year also featured the special pregame competition.<br/><br/>The captains for this milestone event were legendary figures Kevin Megill and Chris Adams. This was the first meeting between the two, despite each competing in over 100 events.<br/>.. <b>Kevin Megill</b> made his third season finale captains appearance, having headlined DODGEBALL 30 and DODGEBALL 80 [both held in the month of March]. He leaves C30 with an overall 6-1-1 record, having become only the third competitor in history to reach six total victories.<br/>.. <b>Chris Adams</b> also made his third season finale captains appearance, having headlined DODGEBALL 50 and DODGEBALL 70. He leaves C30 with an overall 6-6-0 record, having become the first competitor in history to lead a team into battle 12 times.<br/><br/>Alysha Kelly was the only competitor of the total 30 to have never competed in a ten event.<br/><br/>John Tronolone is now the sole combatant to participate in all 13 season finales. Kevin Adams had the streak of 12 going, but wound up missing DODGEBALL C30 due to his senior class trip.<br/><br/>DODGEBALL C30 not only ended the 13th ten-week program, but the Winter 2007/2008 season as well. The sport will head in to its third Spring beginning with DODGEBALL 131 on March 22.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=C30RESULTS-ack.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-ack.jpg\"/></a></center><br/><u>C30 Soundtrack</u><br/>Special <i>Thanks!</i> to both Melissa Kerr and Diana DiBuccio for the work they put forth towards the red hot playlist.<br/><br/><u>The Atmosphere</u><br/>Nearly everyone in attendance helped out in setting up and taking down the decorations. <i>Thank You</i> all!<br/><br/><u>Now That Winter is Over ...</u><br/>To everyone who participated or simply watched in awe, <i>Thanks!</i> for making this time period one of the most exciting ever! Over two and a half years later and we're still going strong!<br/><br/><center><br/><form action=\"http://poll.pollhost.com/vote.cgi\" method=\"post\"><table bgcolor=\"#008888\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"150\"><tr><td><font color=\"#FFFF00\" face=\"Comic Sans MS\" size=\"+0\"><b>The 130th EastCoastDodgeball extravaganza ... what did you think?</b></font></td></tr><tr><td><center><select name=\"answer\"><option value=\"1\">A: Trust me, I'll be back.</option><option value=\"2\">B: A fun time all-around.</option><option value=\"3\">C: Some moments here and there.</option><option value=\"4\">D: More negatives than positives.</option><option value=\"5\">E: I'd rather visit the dentist.</option></select></center><tr><td colspan=\"2\"><input name=\"config\" type=\"hidden\" value=\"V1dFQ29vd25lcgkxMjA1NjUzNTU1CTAwODg4OAlGRkZGMDAJQ29taWMgU2FucyBNUwlZZWxsb3c\"/><center><input type=\"submit\" value=\"Vote\"/>  <input name=\"view\" type=\"submit\" value=\"View\"/></center></td></tr><tr><td align=\"right\" bgcolor=\"#FFFFFF\" colspan=\"2\"><font color=\"#000000\" face=\"Comic Sans MS\" size=\"-2\"><a href=\"http://www.pollhost.com/\" rel=\"nofollow\" target=\"_blank\"><font color=\"#000099\"></font></a></font></td></tr></td></tr></table></form><br/></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30collage.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-mainevent.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-facts.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-moments.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-records.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/C30RESULTS-ack.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}