{
  "id": 86127,
  "url": "https://dodgeball.livejournal.com/86127.html",
  "title": "ANIMAL PLANET Presents",
  "date": "",
  "body_text": "DODGEBALL 134 Results\nBattle Royal Series\nFinale!\nJoining the likes of legendary \"referee\" Diana DiBuccio and Rimshot King Ryan Letsche is the future season finale headliner himself,\nJustin Wolf\n. \"The Punter\" outlasted Alysha Kelly, Chris Adams, Diana DiBuccio, Grant Cornero, Juan Londono, Mike Butler, Mike Edwards, Mike \"Sputz\" Krott, Zach Katz, and finalists, former Battle Royal champion Ryan Letsche and powerhouse Kevin Fitzpatrick in this third and final free-for-all pregame.\nLetsche and Fitzpatrick simultaneously eliminated each other from the Battle Royal, allowing Wolf to pick up the huge victory en route to his mammouth-sized confrontation against \"Muffin Man\" Juan Londono at DODGEBALL CXL on May 31st.\nFlash Results by Game\nTeam WOLF: 2, 3, 4, 5, 6, 8, 9, 11\nTeam FOX: 1, 7, 10\nThose in attendance were thrilled at the return not of a certain competitor, but of the properly functioning tennis lights. And with Wolf running the show, anything was possible .. standard two-team battles, the rarely-seen back court\nPrison Ball\nbrawls, and the\nSecret \"Captains\"\nslaughters produced a wicked event from beginning to end.\nThe Rules\n: Classic two-team for much of the first half, followed by several\nPrison Ball\nand\nSecret \"Captain\"\ngames.\nThe Match\n: Team WOLF defeated Team FOX, 8 to 3.\nMoments & Stars\n: Lauren Stopa and Justin Pierce suffering leg injuries; Zach Katz receiving a Kevin Adams-thrown bulletball to the face; kick-ass catching displays from Melissa Kerr and Diana DiBuccio;\nSecret \"Captain\"\nJohn Tronolone as the \"Last Man Standing\" in both Games 9 and 11; Grant Cornero pelting his brother Bob in the back during a mid-court showdown\nAttendance\n: 25 competitors, comprised of 19 men and 6 women.\nNew Players\n: Eric Friedman\nOther Notes\n: DODGEBALL 134 was the first event held on the Back Courts of Wall High School since DODGEBALL 128 on March 1. The lights shut-off at approximately 10:40pm.\n________________________________________\n_____\nYou better be ready for the Season 14 Midway Showdown ...\nAnnouncement coming in the next 48 hours!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball134A.jpg\" vspace=\"2\"><big><b><u>DODGEBALL 134 Results</u></b> <br/><i>Battle Royal Series</i> Finale!</big> <br/><br/>Joining the likes of legendary \"referee\" Diana DiBuccio and Rimshot King Ryan Letsche is the future season finale headliner himself, <b>Justin Wolf</b>. \"The Punter\" outlasted Alysha Kelly, Chris Adams, Diana DiBuccio, Grant Cornero, Juan Londono, Mike Butler, Mike Edwards, Mike \"Sputz\" Krott, Zach Katz, and finalists, former Battle Royal champion Ryan Letsche and powerhouse Kevin Fitzpatrick in this third and final free-for-all pregame. <br/><br/>Letsche and Fitzpatrick simultaneously eliminated each other from the Battle Royal, allowing Wolf to pick up the huge victory en route to his mammouth-sized confrontation against \"Muffin Man\" Juan Londono at DODGEBALL CXL on May 31st. <br/><br/><u>Flash Results by Game</u> <br/>Team WOLF: 2, 3, 4, 5, 6, 8, 9, 11 <br/>Team FOX: 1, 7, 10 <br/><br/>Those in attendance were thrilled at the return not of a certain competitor, but of the properly functioning tennis lights. And with Wolf running the show, anything was possible .. standard two-team battles, the rarely-seen back court <i>Prison Ball</i> brawls, and the <i>Secret \"Captains\"</i> slaughters produced a wicked event from beginning to end. <br/><br/><b>The Rules</b>: Classic two-team for much of the first half, followed by several <i>Prison Ball</i> and <i>Secret \"Captain\"</i> games. <br/><b>The Match</b>: Team WOLF defeated Team FOX, 8 to 3. <br/><b>Moments &amp; Stars</b>: Lauren Stopa and Justin Pierce suffering leg injuries; Zach Katz receiving a Kevin Adams-thrown bulletball to the face; kick-ass catching displays from Melissa Kerr and Diana DiBuccio; <i>Secret \"Captain\"</i> John Tronolone as the \"Last Man Standing\" in both Games 9 and 11; Grant Cornero pelting his brother Bob in the back during a mid-court showdown <br/><b>Attendance</b>: 25 competitors, comprised of 19 men and 6 women. <br/><b>New Players</b>: Eric Friedman <br/><b>Other Notes</b>: DODGEBALL 134 was the first event held on the Back Courts of Wall High School since DODGEBALL 128 on March 1. The lights shut-off at approximately 10:40pm.<br/><br/><center>________________________________________<wbr/>_____<br/><br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball135A-1.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball135A-1.jpg\"/></a><br/><br/><big>You better be ready for the Season 14 Midway Showdown ... <br/>Announcement coming in the next 48 hours!</big></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball134A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball135A-1.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}