{
  "id": 87174,
  "url": "https://dodgeball.livejournal.com/87174.html",
  "title": "Way Too Many LAUGHS",
  "date": "",
  "body_text": "DODGEBALL CXXXVI Results:\n\"Maniac\" Mills Runs the Show!\nSome have already called it the most laugh-out-loud event in the history of the sport - really now, with crazed lunatic\nTravis Mills\nin charge, would you expect anything less?\nPlayer's Choice Rimshot Contest\nParticipants\n: Alysha Kelly, Bobby Vetrano, Justin Pierce, Kevin Adams, Lauren Stopa, Mike \"Sputz\" Krott, Ryan Letsche, Travis Mills\n(winner)\n, Zach Katz.\nAfter defeating eight hungry warriors, \"The Maniac\" went on to deliver a most unique opening contest ... 2008 rookie sensation Bobby Vetrano against the world! And once the so-called \"target practice\" came to a halt, teams oddly named ALEXANDER THE GREAT and PIMP DADDY MCGEE were formulated to Mills's liking!\nFlash Results by Game\nATG: 3, 5, 6\nPDM: 1, 2, 4\nNumerous back-court\nPrison Ball\nrounds kept the energy level, and comedy level, at an all-time high. Those who were not in attendance for this 136th melee will be undoubtedly be hearing some of the memorable occurrences and happenings from this ridiculously insane three hour show!\nThe Rules\n: Majority\nPrison Ball\nwith one classic two-team.\nThe Match\n: Team ALEXANDER THE GREAT fought defeated Team PIMP DADDY MCGEE to a 3 - 3 draw.\nMoments & Stars\n: the comedic one-on-one showdowns between Travis Mills and Kevin Adams; a Justin Wolf punt crashing into an unsuspecting Kevin Megill; Diana DiBuccio's unsuccessful attempts at catching with the cones; Lauren Stopa's pinpoint accurate throws to imprisoned teammates and eliminations on enemies; Ryan Letsche sitting throughout one of the games and still managing to catch\nAttendance\n: 14 competitors, comprised of 11 men and 3 women.\nOther Notes\n: DODGEBALL CXXXVI was the 28th\nWet War\n. Travis Mills stamped his name into the record books having won both\nPlayer's Choice Rimshot Contests\n, the first at\nDODGEBALL 118\n. This was the first time an event ended in a tie since the inaugural\nDodgeball Draft\n,\nDODGEBALL 101\n, in late-August 2007.\n________________________________________\n________\nImportant News Concerning Season 14 / DODGEBALL CXL\nComing May 31 ...\nThe SuperBowl-sized\nWolf-Juan\nconfrontation slated for DODGEBALL CXL on May 31 is already making headlines. As reported last week, neither man is allowed to team up until after their Season 14 finale encounter. But that's not all as another bombshell announcement will be made public at this Saturday's DODGEBALL CXXXVII! As for all those \"letters\", the secret is finally out ...\nLetters were sent out to the families of full-time dodgeball competitors late last week, inviting parents, guardians, siblings, and whomever else to join in on this forthcoming spring spectacular. More information will be provided in the coming weeks, so stay tuned.\nComing Up Next ...\nWarriors signed up for the\nEastCoastDodgeball TextMessagingService\nwill receive details concerning the main event for this Saturday's DODGEBALL CXXXVII. Make sure to check those phones during the week!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><big><u><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball136A.jpg\" vspace=\"2\">DODGEBALL CXXXVI Results:</img></u></big><br/>\"Maniac\" Mills Runs the Show!</big><br/><br/>Some have already called it the most laugh-out-loud event in the history of the sport - really now, with crazed lunatic <b>Travis Mills</b> in charge, would you expect anything less?<br/><br/><u><i>Player's Choice Rimshot Contest</i> Participants</u>: Alysha Kelly, Bobby Vetrano, Justin Pierce, Kevin Adams, Lauren Stopa, Mike \"Sputz\" Krott, Ryan Letsche, Travis Mills <small>(winner)</small>, Zach Katz.<br/><br/>After defeating eight hungry warriors, \"The Maniac\" went on to deliver a most unique opening contest ... 2008 rookie sensation Bobby Vetrano against the world! And once the so-called \"target practice\" came to a halt, teams oddly named ALEXANDER THE GREAT and PIMP DADDY MCGEE were formulated to Mills's liking!<br/><br/><u>Flash Results by Game</u><br/>ATG: 3, 5, 6<br/>PDM: 1, 2, 4<br/><br/>Numerous back-court <i>Prison Ball</i> rounds kept the energy level, and comedy level, at an all-time high. Those who were not in attendance for this 136th melee will be undoubtedly be hearing some of the memorable occurrences and happenings from this ridiculously insane three hour show!<br/><br/><b>The Rules</b>: Majority <i>Prison Ball</i> with one classic two-team.<br/><b>The Match</b>: Team ALEXANDER THE GREAT fought defeated Team PIMP DADDY MCGEE to a 3 - 3 draw.<br/><b>Moments &amp; Stars</b>: the comedic one-on-one showdowns between Travis Mills and Kevin Adams; a Justin Wolf punt crashing into an unsuspecting Kevin Megill; Diana DiBuccio's unsuccessful attempts at catching with the cones; Lauren Stopa's pinpoint accurate throws to imprisoned teammates and eliminations on enemies; Ryan Letsche sitting throughout one of the games and still managing to catch<br/><b>Attendance</b>: 14 competitors, comprised of 11 men and 3 women.<br/><b>Other Notes</b>: DODGEBALL CXXXVI was the 28th <i>Wet War</i>. Travis Mills stamped his name into the record books having won both <i>Player's Choice Rimshot Contests</i>, the first at <a href=\"http://dodgeball.livejournal.com/2007/12/30/\" target=\"_blank\">DODGEBALL 118</a>. This was the first time an event ended in a tie since the inaugural <i>Dodgeball Draft</i>, <a href=\"http://dodgeball.livejournal.com/2007/08/28/\" target=\"_blank\">DODGEBALL 101</a>, in late-August 2007.<br/><br/><center><big><big>________________________________________<wbr/>________<br/><br/>Important News Concerning Season 14 / DODGEBALL CXL</big></big></center><br/><br/><img align=\"left\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball140C.jpg\" vspace=\"2\"/><b>Coming May 31 ...</b> The SuperBowl-sized <i>Wolf-Juan</i> confrontation slated for DODGEBALL CXL on May 31 is already making headlines. As reported last week, neither man is allowed to team up until after their Season 14 finale encounter. But that's not all as another bombshell announcement will be made public at this Saturday's DODGEBALL CXXXVII! As for all those \"letters\", the secret is finally out ...<br/><br/>Letters were sent out to the families of full-time dodgeball competitors late last week, inviting parents, guardians, siblings, and whomever else to join in on this forthcoming spring spectacular. More information will be provided in the coming weeks, so stay tuned.<br/><br/><b>Coming Up Next ...</b> Warriors signed up for the <i>EastCoastDodgeball TextMessagingService</i> will receive details concerning the main event for this Saturday's DODGEBALL CXXXVII. Make sure to check those phones during the week!<br/><br/><br/><br/><br/><small> </small> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball136A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball140C.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}