{
  "id": 87682,
  "url": "https://dodgeball.livejournal.com/87682.html",
  "title": "MOTHER'S DAY Madness",
  "date": "",
  "body_text": "DIBUCCIO vs. MULLINS Results from CXXXVII!\n\"Mom\" must be so proud!\nFlash Results by Game\n... Mullins: 1, 3; DiBuccio: 2, 4\nThe warriors of Wall High School fought through four physically agonizing rounds only to be shafted of a final result. It's a safe bet that this issue is far from being settled as a rematch for next week's DODGEBALL CXXXVIII has already been signed.\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Michelle Mullins fought Diana DiBuccio to a 2 - 2 draw.\nMoments & Stars\n: Rob Brown eliminating both Tom Cowling and Mike \"Sputz\" Krott in the first throw of the night; Kevin Adams fumbling a Lauren Stopa-thrown bulletball; Ryan Letsche's dominating Game 4 performance; Tom Adams and Wesley Hebrew engaging in several mid-court showdowns; Rob Brown catching a forceful Kevin Adams bulletball as it impactfully connects with his face; two game-saving team regenerations from Mike Edwards\nAttendance\n: 28 competitors, comprised of 20 men and 8 women.\nOther Notes\n: DODGEBALL 131 in mid-March was the last time captains were featured; the longest drought ever. DODGEBALL CXXXVII, along with the preceding CXXXVI, are the first two consecutive events to end in a draw under classic rules. This was the second year in a row two women headlined an event during Mother's Day weekend\n(see\nDODGEBALL 87\n)\n.\nCaptain's Statistics\n: DiBuccio 3-4-3 : Mullins 0-0-1. DiBuccio became the first competitor in history to fight to a draw three times.\nReturning to Action\n:\nEastCoastDodgeball\nwelcomed back Jarid Putman, Lenny Weg, and Steve Guarino, all of whom reemerged for the first time since late Spring-2006. Former\nCaptains Champion\nWesley Hebrew also returned to the dance after a lengthy absence.\nDODGEBALL CXL Announcement!\nJust when you thought the upcoming 140th dodgeball spectacular on May 31st couldn't get any bigger, it does. As announced at CXXXVII, the winner of the colossal\nWOLF-JUAN\nconfrontation will become the first of six, that's right,\nsix\ncaptains at the summer sizzler, DODGEBALL 150, in August!\nOnline Exclusive\n: DODGEBALL CXXXVII took place one day before Captain Mullins's 17th birthday.\n________________________________________\n____________\nAnd then there were THREE ...\nDODGEBALL CXXXVIII: 5.17.08\nThe unresolved finish from the magnificent 137th has left all hardcore 'ballers wanting more. With that being said, the main event for this Saturday's 138th will be the anticipated return bout between \"Ghetto Superstar\"\nDiana DiBuccio\nand 2008's female fury\nMichelle Mullins\n! It's \"Round 2\" for these titans - will a winner finally emerge?\nDODGEBALL 139: 5.24.08\nAnd just when you thought you had all the answers .. match announcement coming mid-week via the\nTextMessagingService\n!\nDODGEBALL CXL: Season 14 Finale on 5.31.08\nUndeniably one of the most feverishly-awaited events in the sport's nearly three-year existence.\nJustin \"Punter\" Wolf\nlocks horns with\n\"Cockroach\" Juan Londono\n, with the victor advancing to one of six main event spots at DODGEBALL 150. Get your game-faces on for this one.\nPlus, it will indeed be a \"Family Affair\" when the beloved parents and guardians of all diehard superstars make an appearance at this spring spectacle. Which 'rents will show? Who will unleash the urge and step up to the challenge that is dodgeball? The world finds out May 31.\nWhat an awesome line-up on this\nRoad to CXL\n. Shame on those who miss any of these!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball137A.jpg\" vspace=\"2\"><big><big>DIBUCCIO vs. MULLINS Results from CXXXVII!</big></big><br/>\"Mom\" must be so proud!<br/><br/><u>Flash Results by Game</u> ... Mullins: 1, 3; DiBuccio: 2, 4<br/>The warriors of Wall High School fought through four physically agonizing rounds only to be shafted of a final result. It's a safe bet that this issue is far from being settled as a rematch for next week's DODGEBALL CXXXVIII has already been signed. <br/><br/><b>The Rules</b>: Classic two-team match-up.<br/><b>The Match</b>: Michelle Mullins fought Diana DiBuccio to a 2 - 2 draw.<br/><b>Moments &amp; Stars</b>: Rob Brown eliminating both Tom Cowling and Mike \"Sputz\" Krott in the first throw of the night; Kevin Adams fumbling a Lauren Stopa-thrown bulletball; Ryan Letsche's dominating Game 4 performance; Tom Adams and Wesley Hebrew engaging in several mid-court showdowns; Rob Brown catching a forceful Kevin Adams bulletball as it impactfully connects with his face; two game-saving team regenerations from Mike Edwards<br/><b>Attendance</b>: 28 competitors, comprised of 20 men and 8 women.<br/><b>Other Notes</b>: DODGEBALL 131 in mid-March was the last time captains were featured; the longest drought ever. DODGEBALL CXXXVII, along with the preceding CXXXVI, are the first two consecutive events to end in a draw under classic rules. This was the second year in a row two women headlined an event during Mother's Day weekend <i>(see <a href=\"http://dodgeball.livejournal.com/2007/05/13/\" target=\"_blank\">DODGEBALL 87</a>)</i>. <br/><b>Captain's Statistics</b>: DiBuccio 3-4-3 : Mullins 0-0-1. DiBuccio became the first competitor in history to fight to a draw three times.<br/><b>Returning to Action</b>: <i>EastCoastDodgeball</i> welcomed back Jarid Putman, Lenny Weg, and Steve Guarino, all of whom reemerged for the first time since late Spring-2006. Former <i>Captains Champion</i> Wesley Hebrew also returned to the dance after a lengthy absence.<br/><br/><b>DODGEBALL CXL Announcement!</b><br/>Just when you thought the upcoming 140th dodgeball spectacular on May 31st couldn't get any bigger, it does. As announced at CXXXVII, the winner of the colossal <i>WOLF-JUAN</i> confrontation will become the first of six, that's right, <i>six</i> captains at the summer sizzler, DODGEBALL 150, in August!<br/><br/><b>Online Exclusive</b>: DODGEBALL CXXXVII took place one day before Captain Mullins's 17th birthday.<br/><br/><center>________________________________________<wbr/>____________<br/><br/><big><big>And then there were THREE ...</big></big></center><br/><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball140D.jpg\" vspace=\"2\"/><big>DODGEBALL CXXXVIII: 5.17.08</big><br/>The unresolved finish from the magnificent 137th has left all hardcore 'ballers wanting more. With that being said, the main event for this Saturday's 138th will be the anticipated return bout between \"Ghetto Superstar\" <b>Diana DiBuccio</b> and 2008's female fury <b>Michelle Mullins</b>! It's \"Round 2\" for these titans - will a winner finally emerge?<br/><br/><big>DODGEBALL 139: 5.24.08</big><br/>And just when you thought you had all the answers .. match announcement coming mid-week via the <i>TextMessagingService</i>!<br/><br/><big>DODGEBALL CXL: Season 14 Finale on 5.31.08</big><br/>Undeniably one of the most feverishly-awaited events in the sport's nearly three-year existence. <b>Justin \"Punter\" Wolf</b> locks horns with <b>\"Cockroach\" Juan Londono</b>, with the victor advancing to one of six main event spots at DODGEBALL 150. Get your game-faces on for this one.<br/><br/>Plus, it will indeed be a \"Family Affair\" when the beloved parents and guardians of all diehard superstars make an appearance at this spring spectacle. Which 'rents will show? Who will unleash the urge and step up to the challenge that is dodgeball? The world finds out May 31.<br/><br/><center>What an awesome line-up on this <b>Road to CXL</b>. Shame on those who miss any of these!</center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball137A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball140D.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}