{
  "id": 89300,
  "url": "https://dodgeball.livejournal.com/89300.html",
  "title": "The FAMILY AFFAIR: CXL Results!",
  "date": "",
  "body_text": "Almost three years of this seemingly never-ending journey and not once had\nyou\nbeen invited - where were those manners you taught us over the course of our existence? Let's just hope it was worth waiting for!\n________________________________________\n________________________________\nJustin \"Punter\" Wolf\ncame to the 140th intent on kicking - or punting - the \"Cockroach\" out of contention. But number one nemesis\n\"Muffin Man\" Juan Londono\nwould not hesitate on serving a great big piece of that grenade-looking pastry. Two of the most deserving, diehard dodgeballers each willing to put it all on the line for a lifetime supply of bragging rights and that first-class ticket to headline DODGEBALL 150 on August 9!\nThe action came too furious, too fast, the Game 1 false start a prime example! The warriors and their loved ones were rarin' to go! Once order was restored,\nEastCoastDodgeball\nproduced the finest in athletic competition leaving the astounding 39 in attendance and the sideline crowd in awe of such high-intensity and insanity.\nIn the opening contest, the Londono-lead charges knocked off opposing team general Wolf to take the first point of the match. Melissa \"Killer\" Kerr and Jason Teitelbaum, mohawk and all, proved to be two of the \"Muffin Man's\" most valuable assets.\nCome Game 2, the balance of power shifted as body-piercing throws from Grant Cornero coupled with the rim-smacking efforts of the \"UnSTOPAble\" Lauren Stopa and megastar Tom Adams yielded \"The Punter\" to his first triumph of the three-hour melee.\nIt was about this time many family members arose from their positions on the sidelines, each wanting to get in on the non-stop action. How about those rocket fastballs from Mr. Krott, the dynamite catches from Mr. Cornero, or Mrs. Vetrano's wicked underhand? Yeah, it was that good. Players and spectators alike could not remove or erase the everlasting smiles from their faces.\nGames 3 and 4 were as red hot as the kick-ass soundtrack with Londono and Wolf trading victories here too.\nBut just when the Wall High School warriors and their loved ones thought this issue would be settled, all they got were more unanswered questions ...\nFlash Results by Game\n: 1, 3 (Juan); 2, 4 (Wolf)\n... For the first time in\nEastCoastDodgeball\nseason finale history, we have a tie! Fearless team generals Londono and Wolf were unsuccessful in their attempt to grab that third and deciding victory.\nBut what a fastastically-starstudded confrontation, one that unquestionably lived up to the hype. Expect these two iron men to finish this in the very near future.\nJustin Wolf\nand\nJuan Londono\neach secured 2 games. The match is a draw!\nSeason 14\n~ Valerie Winston and Bobby Vetrano both\nCREAMated\n, the intense\nBattle Royal Series\n, and the DiBuccio-Mullins encounters were just some of the highlights of this 14th Season.\n~ 24.5 was the average attendance and in it included the likes of an awesome 29 new competitors.\n~ DODGEBALL 133 and DODGEBALL CXXXVI were the two\nWet Wars\n.\n~ Justin Pierce, John Tronolone, Diana DiBuccio, Kevin Adams, and Ryan Letsche attended every Season 14 event spanning from DODGEBALL 131 in late-March to the spectacular finale DODGEBALL CXL.\nDODGEBALL CXL\n~ Decorations consisted of four blue and white flags, blue streamers tied to the tennis nets, a large laundry line with four large punch balloons attached, and three laminated DODGEBALL CXL posters along the inside fence.\n~ Edible goodies and refreshments consisted of delicious cupcakes, fresh watermelon, gallons of water, chips and salsa, among many other snacks and drinks.\n~ Captain Justin Wolf created the energetic, high octane soundtrack featuring a variety of alternative and rock artists and bands.\n~ The Pellecchia Family were the lucky winners of the \"Family Affair\" Raffle, taking home a $25 Gift Card to Sunoco.\n~ The special RelayForLife bin collected a terrific $31 in donations!\n~ First Pick for Captain Justin Wolf:\nKevin Adams\n~ First Pick for Captain Juan Londono:\nRyan Letsche\nYou Just Never Know!\n~ Parents and guardians of full-time dodgeballers were mailed two invitations during the course of the last month. Parents nor players (with exception of Chris Adams, Diana DiBuccio, and John Tronolone) were aware of the idea until they received such letters.\n~ Weather reports in the days prior to the event called for vicious thunderstorms throughout the day and night. Those who attended clearly saw a break in the clouds as not a single drop of rain was felt from any of the attendees. Perhaps it was those beloved relatives \"above\" who banned together just to help us out.\nIf there's one event sure to produce lifelong memories, it's the 140th. Here's just a fraction of the fun!\n~ Kevin Fitzpatrick unintentionally smacking an out-of-bounds Alison Bertsch in the lower back with a stinging bulletball.\n~ Megan and Grace Tronolone attacking the likes of Dan Spengeman and Diana DiBuccio.\n~ Tom Adams hitting two crucial rimshots on the night.\n~ Mrs. Pellecchia just barely missing a Kevin Megill-rifled bulletball to the face.\n~ Mr. Cornero and Jason Teitelbaum's tremendous catching abilities.\n~ The awesome double-team tactics of Mike \"Sputz\" Krott and Mr. Krott.\n~ John Tronolone's full court team regeneration in Game 4.\n~ Mr. Spengeman facing off with Mrs. Vetrano in an intense mid-court showdown.\n~ Alison Bertsch's double-elimination on Sascha Basista and Cap. Justin Wolf\n~ Bobby Vetrano and Mike Edwards's long-lasting, no quit Game 4 performance.\n~ Justin Wolf not once angrily punting a ball out of the court.\n*Feel like adding a few more happenings from this spring spectacle? Click \"THROW A BALL\" at the end of the entry and let your voice be heard!\n*Check out some of these moments in picture form, courtesy Dan Spengeman! Click\nHERE\nto view the album!\nThe astonishing\nattendance of 39\nis the fifth highest turnout in dodgeball history. This incredible number was comprised of 28 men and 11 women.\nEach of the\nnine new players\nwere - and get this - either a parent or sibling of a member of the current roster! The awesome list consists of these loved ones:\nMr. Cornero\n(Father of Grant Cornero)\n,\nMr. Krott\n(Father of Mike \"Sputz\" Krott)\n,\nMr. and Mrs. Pellecchia\n(Father and Mother of Rob Pellecchia)\n,\nMr. Spengeman\n(Father of Dan Spengeman)\n,\nMr. Tronolone, Megan Tronolone, and Grace Tronolone\n(Father and twin sisters of John Tronolone)\n, and\nMrs. Vetrano\n(Mother of Bobby Vetrano and Aunt of Ryan Letsche)\n.\nAnd congratulations are certainly in order to Mr. Spengeman as well, who broke the record for the oldest person to ever compete at an\nEastCoastDodgeball\nevent - 62!\nOther relatives on hand for this special occasion included\nMs. Adams\n(Mother of Chris, Tom, and Kevin Adams)\n,\nMr. Bertsch\n(Father of Alison Bertsch)\n,\nMs. Butler and Mr. Carroll\n(Mother and Uncle of Michael Butler)\n,\nMrs. Cornero, Bob Cornero, and Abigail Cornero\n(Mother, brother, and sister of Grant Cornero)\n,\nMr. and Mrs. D'Luhy\n(Father and Mother of Pamela D'Luhy)\n,\nMs. DiBuccio\n(Mother of Diana DiBuccio)\n,\nDan Fitzpatrick\n(Brother of Kevin Fitzpatrick, who also played)\n,\nMs. Huter\n(Mother of Sascha Basista)\n,\nMrs. Kerr\n(Mother of Melissa Kerr)\n,\nMrs. Krott\n(Mother of Mike \"Sputz\" Krott)\n,\nMr. and Mrs. Megill\n(Father and Mother of Kevin Megill)\n,\nMrs. Mullins\n(Mother of Michelle Mullins)\n,\nMr. and Mrs. Pierce\n(Father and Mother of Justin Pierce)\n,\nMrs. Spengeman\n(Mother of Dan Spengeman)\n,\nMrs. Stopa\n(Mother of Lauren Stopa)\n,\nMrs. Tronolone\n(Stepmother of John Tronolone)\n,\nMr. Wolf and Casey Wolf\n(Father and brother of Justin Wolf)\n.\nDODGEBALL CXL was the seventh season finale held on the back courts of Wall High School.\nThis was the second ten event held in the month of May. The first took place exactly one hundred events prior at DODGEBALL XL on May 20, 2006.\nThe official theme song was \"Rock and Roll\" by Gary Glitter.\nDODGEBALL CXL featured only the third raffle in dodgeball history. DODGEBALL 100 and DODGEBALL CXX were cash giveaways contrary to CXL's preselected prize.\nMaking their ten event captains debut, Justin \"Punter\" Wolf fought \"Muffin Man\" Juan Londono to the first draw in season finale history. Only four games were completed in all; a season finale record-low as well.\n~\nJustin Wolf\nleaves DODGEBALL CXL with a 1-1-1 record having yet to compete in anything other than a singles contest.\n~\nJuan Londono\nnow holds a 5-2-1 record and was on a three-game winning streak en route to DODGEBALL CXL.\n*The pre-match stipulation stated that the winner of the Wolf-Juan confrontation would emerge as the first of six captains at DODGEBALL 150 on August 9th. Due to the event-ending tie-score, that obviously did not happen.\nBright in Blue!\nThose who came early are certainly thanked for setting up the many decorations. The Wall High School tennis courts was the place to be on May 31 just from the look of it!\nSuper Soundtrack!\nJustin Wolf did an outstanding job with the musical playlist for this 140th extravaganza. His work is very much appreciated.\nHelp Yourself!\nA number of superstars provided food for players and spectators alike - thanks to all who contributed!\nAnd Because You Showed!\nParents, relatives, friends - thanks so very much for attending! Because of your participation, DODGEBALL CXL is bound to be a lifelong memory for everyone involved! The dodgeball crew certainly hopes you enjoyed yourselves and please, do not hesitate to come again!\nDODGEBALL CXL \"Family Affair\" has come to a close ... what are your thoughts?\n10 ... a lifelong memory.\n9 ...\n8 ...\n7 ...\n6 ...\n5 ... moments here, moments there.\n4 ...\n3 ...\n2 ...\n1 ... I prefer golf.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <b><big><i>Almost three years of this seemingly never-ending journey and not once had <u>you</u> been invited - where were those manners you taught us over the course of our existence? Let's just hope it was worth waiting for!</i><br/><center>________________________________________<wbr/>________________________________</center></big></b><br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=CXLmatch.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLmatch.jpg\"/></a><br/><b>Justin \"Punter\" Wolf</b> came to the 140th intent on kicking - or punting - the \"Cockroach\" out of contention. But number one nemesis <b>\"Muffin Man\" Juan Londono</b> would not hesitate on serving a great big piece of that grenade-looking pastry. Two of the most deserving, diehard dodgeballers each willing to put it all on the line for a lifetime supply of bragging rights and that first-class ticket to headline DODGEBALL 150 on August 9!<br/><br/>The action came too furious, too fast, the Game 1 false start a prime example! The warriors and their loved ones were rarin' to go! Once order was restored, <i>EastCoastDodgeball</i> produced the finest in athletic competition leaving the astounding 39 in attendance and the sideline crowd in awe of such high-intensity and insanity.<br/><br/>In the opening contest, the Londono-lead charges knocked off opposing team general Wolf to take the first point of the match. Melissa \"Killer\" Kerr and Jason Teitelbaum, mohawk and all, proved to be two of the \"Muffin Man's\" most valuable assets. <br/><br/>Come Game 2, the balance of power shifted as body-piercing throws from Grant Cornero coupled with the rim-smacking efforts of the \"UnSTOPAble\" Lauren Stopa and megastar Tom Adams yielded \"The Punter\" to his first triumph of the three-hour melee. <br/><br/>It was about this time many family members arose from their positions on the sidelines, each wanting to get in on the non-stop action. How about those rocket fastballs from Mr. Krott, the dynamite catches from Mr. Cornero, or Mrs. Vetrano's wicked underhand? Yeah, it was that good. Players and spectators alike could not remove or erase the everlasting smiles from their faces. <br/><br/>Games 3 and 4 were as red hot as the kick-ass soundtrack with Londono and Wolf trading victories here too.<br/><br/>But just when the Wall High School warriors and their loved ones thought this issue would be settled, all they got were more unanswered questions ...<br/><br/><u>Flash Results by Game</u>: 1, 3 (Juan); 2, 4 (Wolf) <br/><br/>... For the first time in <i>EastCoastDodgeball</i> season finale history, we have a tie! Fearless team generals Londono and Wolf were unsuccessful in their attempt to grab that third and deciding victory.<br/><br/>But what a fastastically-starstudded confrontation, one that unquestionably lived up to the hype. Expect these two iron men to finish this in the very near future.<br/><br/><i><b>Justin Wolf</b> and <b>Juan Londono</b> each secured 2 games. The match is a draw!</i><br/><br/><br/><img align=\"right\" alt=\"\" hspace=\"3\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/cxlcollage.jpg\" vspace=\"3\"><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=CXLfse.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLfse.jpg\"/></a><br/><br/><big><i><u>Season 14</u></i></big><br/>~ Valerie Winston and Bobby Vetrano both <i>CREAMated</i>, the intense <i>Battle Royal Series</i>, and the DiBuccio-Mullins encounters were just some of the highlights of this 14th Season.<br/>~ 24.5 was the average attendance and in it included the likes of an awesome 29 new competitors.<br/>~ DODGEBALL 133 and DODGEBALL CXXXVI were the two <i>Wet Wars</i>.<br/>~ Justin Pierce, John Tronolone, Diana DiBuccio, Kevin Adams, and Ryan Letsche attended every Season 14 event spanning from DODGEBALL 131 in late-March to the spectacular finale DODGEBALL CXL.<br/><br/><big><i><u>DODGEBALL CXL</u></i></big><br/>~ Decorations consisted of four blue and white flags, blue streamers tied to the tennis nets, a large laundry line with four large punch balloons attached, and three laminated DODGEBALL CXL posters along the inside fence.<br/>~ Edible goodies and refreshments consisted of delicious cupcakes, fresh watermelon, gallons of water, chips and salsa, among many other snacks and drinks.<br/>~ Captain Justin Wolf created the energetic, high octane soundtrack featuring a variety of alternative and rock artists and bands.<br/>~ The Pellecchia Family were the lucky winners of the \"Family Affair\" Raffle, taking home a $25 Gift Card to Sunoco.<br/>~ The special RelayForLife bin collected a terrific $31 in donations!<br/>~ First Pick for Captain Justin Wolf: <i>Kevin Adams</i><br/>~ First Pick for Captain Juan Londono: <i>Ryan Letsche</i><br/><br/><big><i><u>You Just Never Know!</u></i></big><br/>~ Parents and guardians of full-time dodgeballers were mailed two invitations during the course of the last month. Parents nor players (with exception of Chris Adams, Diana DiBuccio, and John Tronolone) were aware of the idea until they received such letters.<br/>~ Weather reports in the days prior to the event called for vicious thunderstorms throughout the day and night. Those who attended clearly saw a break in the clouds as not a single drop of rain was felt from any of the attendees. Perhaps it was those beloved relatives \"above\" who banned together just to help us out.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=CXLmoments.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLmoments.jpg\"/></a></center><br/>If there's one event sure to produce lifelong memories, it's the 140th. Here's just a fraction of the fun!<br/>~ Kevin Fitzpatrick unintentionally smacking an out-of-bounds Alison Bertsch in the lower back with a stinging bulletball.<br/>~ Megan and Grace Tronolone attacking the likes of Dan Spengeman and Diana DiBuccio.<br/>~ Tom Adams hitting two crucial rimshots on the night.<br/>~ Mrs. Pellecchia just barely missing a Kevin Megill-rifled bulletball to the face.<br/>~ Mr. Cornero and Jason Teitelbaum's tremendous catching abilities.<br/>~ The awesome double-team tactics of Mike \"Sputz\" Krott and Mr. Krott.<br/>~ John Tronolone's full court team regeneration in Game 4.<br/>~ Mr. Spengeman facing off with Mrs. Vetrano in an intense mid-court showdown.<br/>~ Alison Bertsch's double-elimination on Sascha Basista and Cap. Justin Wolf<br/>~ Bobby Vetrano and Mike Edwards's long-lasting, no quit Game 4 performance.<br/>~ Justin Wolf not once angrily punting a ball out of the court. <br/><br/>*Feel like adding a few more happenings from this spring spectacle? Click \"THROW A BALL\" at the end of the entry and let your voice be heard!<br/><br/>*Check out some of these moments in picture form, courtesy Dan Spengeman! Click <a href=\"http://picasaweb.google.com/DanSpengeman/Dodgeball140\" rel=\"nofollow\" target=\"_blank\">HERE</a> to view the album!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=CXLrecords.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLrecords.jpg\"/></a></center><br/>The astonishing <u>attendance of 39</u> is the fifth highest turnout in dodgeball history. This incredible number was comprised of 28 men and 11 women.<br/><br/>Each of the <u>nine new players</u> were - and get this - either a parent or sibling of a member of the current roster! The awesome list consists of these loved ones: <b>Mr. Cornero</b> <i>(Father of Grant Cornero)</i>, <b>Mr. Krott</b> <i>(Father of Mike \"Sputz\" Krott)</i>, <b>Mr. and Mrs. Pellecchia</b> <i>(Father and Mother of Rob Pellecchia)</i>, <b>Mr. Spengeman</b> <i>(Father of Dan Spengeman)</i>, <b>Mr. Tronolone, Megan Tronolone, and Grace Tronolone</b> <i>(Father and twin sisters of John Tronolone)</i>, and <b>Mrs. Vetrano</b> <i>(Mother of Bobby Vetrano and Aunt of Ryan Letsche)</i>.<br/><br/>And congratulations are certainly in order to Mr. Spengeman as well, who broke the record for the oldest person to ever compete at an <i>EastCoastDodgeball</i> event - 62!<br/><br/>Other relatives on hand for this special occasion included <b>Ms. Adams</b> <i>(Mother of Chris, Tom, and Kevin Adams)</i>, <b>Mr. Bertsch</b> <i>(Father of Alison Bertsch)</i>, <b>Ms. Butler and Mr. Carroll</b> <i>(Mother and Uncle of Michael Butler)</i>, <b>Mrs. Cornero, Bob Cornero, and Abigail Cornero</b> <i>(Mother, brother, and sister of Grant Cornero)</i>, <b>Mr. and Mrs. D'Luhy</b> <i>(Father and Mother of Pamela D'Luhy)</i>, <b>Ms. DiBuccio</b> <i>(Mother of Diana DiBuccio)</i>, <b>Dan Fitzpatrick</b> <i>(Brother of Kevin Fitzpatrick, who also played)</i>, <b>Ms. Huter</b> <i>(Mother of Sascha Basista)</i>, <b>Mrs. Kerr</b> <i>(Mother of Melissa Kerr)</i>, <b>Mrs. Krott</b> <i>(Mother of Mike \"Sputz\" Krott)</i>, <b>Mr. and Mrs. Megill</b> <i>(Father and Mother of Kevin Megill)</i>, <b>Mrs. Mullins</b> <i>(Mother of Michelle Mullins)</i>, <b>Mr. and Mrs. Pierce</b> <i>(Father and Mother of Justin Pierce)</i>, <b>Mrs. Spengeman</b> <i>(Mother of Dan Spengeman)</i>, <b>Mrs. Stopa</b> <i>(Mother of Lauren Stopa)</i>, <b>Mrs. Tronolone</b> <i>(Stepmother of John Tronolone)</i>, <b>Mr. Wolf and Casey Wolf</b> <i>(Father and brother of Justin Wolf)</i>.<br/><br/>DODGEBALL CXL was the seventh season finale held on the back courts of Wall High School.<br/><br/>This was the second ten event held in the month of May. The first took place exactly one hundred events prior at DODGEBALL XL on May 20, 2006.<br/><br/>The official theme song was \"Rock and Roll\" by Gary Glitter.<br/><br/>DODGEBALL CXL featured only the third raffle in dodgeball history. DODGEBALL 100 and DODGEBALL CXX were cash giveaways contrary to CXL's preselected prize.<br/><br/>Making their ten event captains debut, Justin \"Punter\" Wolf fought \"Muffin Man\" Juan Londono to the first draw in season finale history. Only four games were completed in all; a season finale record-low as well.<br/>~ <b>Justin Wolf</b> leaves DODGEBALL CXL with a 1-1-1 record having yet to compete in anything other than a singles contest.<br/>~ <b>Juan Londono</b> now holds a 5-2-1 record and was on a three-game winning streak en route to DODGEBALL CXL.<br/>*The pre-match stipulation stated that the winner of the Wolf-Juan confrontation would emerge as the first of six captains at DODGEBALL 150 on August 9th. Due to the event-ending tie-score, that obviously did not happen.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=CXLackn.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLackn.jpg\"/></a></center><br/><u>Bright in Blue!</u><br/>Those who came early are certainly thanked for setting up the many decorations. The Wall High School tennis courts was the place to be on May 31 just from the look of it!<br/><br/><u>Super Soundtrack!</u><br/>Justin Wolf did an outstanding job with the musical playlist for this 140th extravaganza. His work is very much appreciated.<br/><br/><u>Help Yourself!</u><br/>A number of superstars provided food for players and spectators alike - thanks to all who contributed! <br/><br/><u>And Because You Showed!</u><br/>Parents, relatives, friends - thanks so very much for attending! Because of your participation, DODGEBALL CXL is bound to be a lifelong memory for everyone involved! The dodgeball crew certainly hopes you enjoyed yourselves and please, do not hesitate to come again!<br/><br/><center><br/><form action=\"http://poll.pollhost.com/vote.cgi\" method=\"post\"><table bgcolor=\"#EEEEEE\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"150\"><tr><td><font color=\"#000088\" face=\"Verdana\" size=\"-1\"><b>DODGEBALL CXL \"Family Affair\" has come to a close ... what are your thoughts?</b></font></td></tr><tr><td><center><select name=\"answer\"><option value=\"1\">10 ... a lifelong memory.</option><option value=\"2\">9 ... </option><option value=\"3\">8 ... </option><option value=\"4\">7 ...</option><option value=\"5\">6 ... </option><option value=\"6\">5 ... moments here, moments there.</option><option value=\"7\">4 ...</option><option value=\"8\">3 ... </option><option value=\"9\">2 ... </option><option value=\"10\">1 ... I prefer golf.</option></select></center><tr><td colspan=\"2\"><input name=\"config\" type=\"hidden\" value=\"V1dFQ29vd25lcgkxMjEyMzU2Mzg1CUVFRUVFRQkwMDAwODgJVmVyZGFuYQlCbHVl\"/><center><input type=\"submit\" value=\"Vote\"/>  <input name=\"view\" type=\"submit\" value=\"View\"/></center></td></tr><tr><td align=\"right\" bgcolor=\"#FFFFFF\" colspan=\"2\"><font color=\"#000000\" face=\"Verdana\" size=\"-2\"><a href=\"http://www.pollhost.com/\" rel=\"nofollow\" target=\"_blank\"><font color=\"#000099\"></font></a></font></td></tr></td></tr></table></form><br/><br/></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLmatch.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/cxlcollage.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLfse.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLmoments.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLrecords.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/CXLackn.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}