{
  "id": 90436,
  "url": "https://dodgeball.livejournal.com/90436.html",
  "title": "And The CHASE is ON!",
  "date": "",
  "body_text": "A \"Royal Championship\"\nA Triple Main Event in One Night!\nBattle Royal: Title on the Line\nIt's taking\nEastCoastDodgeball\nby storm! No rules, no allies - just the opportunity to maul and maim. The last man or woman remaining rules the roost.\nParticipants of just the seventh pregame massacre were Kelsey Clayton, Bobby Vetrano, Chris Adams, Justin Wolf, Kevin Adams, Eamon Fitzpatrick, Ryan Letsche, Mike \"Sputz\" Krott, Alysha Kelly, Mike Edwards, Diana DiBuccio, runner-up Travis Mills, and the eventual victor and first Champion of CXL3, the incomparable powerhouse\nKevin Fitzpatrick\n...\nFITZ versus PATRICK\nIn the mega-sized, multi-person showdown, Team FITZ defeated Team PATRICK, taking three of the five total games completed. FITZ took rounds 1, 3, and 5; PATRICK took the evens in between.\n\"Championship Chase\"\n... By winning the \"royal\" free-for-all, \"Fitz\" gained possession of the ECD Championship and more than bragging rights were on the line in this chase. One-half of the DODGEBALL 145 main event was up for grabs! Could \"Fitz\" hang on to the gold for three hours!?\nBy the end of CXL3, seven different men proudly wore the strap. In Game 1 alone, inaugural champ Fitzpatrick was taken down by catching icon Mike \"Sputz\" Krott, only to be pelted seconds later by the obsessive John Tronolone. The self-proclaimed \"Creation\" carried the gold for nearly one full contest until a lob at the rim fell short and into the greedy hands of new target Bobby Vetrano.\nIt was a slow process from here on out, with only a few more title switches:\nPLAYER of the Year '07\nKevin Adams and \"Rimshot King\" Ryan Letsche included. The two-time season finale headliner Letsche waited nervously and anxiously for the those damn lights  to power off. But a missed catching opportunity shattered his dreams and the man of the hour was none other than Mr.\nMichael Edwards\n, hanging on until the very end\n\"The Crazy One's\" triumphant reign earned him the prestigious main event position in the July 5\nEastCoastDodgeball\npresentation, DODGEBALL 145. And his adversary on that holiday weekend,\nKevin Adams\n. What a confrontation that is going to be!\nThe Rules\n: Classic two-team match-up with an individual \"Championship Chase\" addition.\nThe Match\n: Team FITZ defeated Team PATRICK, 3 - 2.\nMoments & Stars\n: Matt Brown catching a bullet ball in his shorts; John Tronolone's obsession with regaining the \"WWE\" Championship; an impressive catching display from Chris Adams\nAttendance\n: 24, comprised of 18 men and 6 women\nOther Notes\n: Attendance (female, male, and overall) completely mirrored that of last week's DODGEBALL 142. This was only the second event to feature a \"Championship Chase\", the first at\nDODGEBALL 118\nin late-December 2007. The Battle Royal has only become common as of recent memory, but its history can be traced back to the Spring of 2006.\nHope You've Noticed!\nEver since the spectacular \"Family Affair\" on May 31, relatives have been coming out of the woodworks just to get a glimpse of the weekly attraction known as dodgeball. At DODGEBALL CXL3, Juan Londono's uncle made a guest appearance as did Mr. Fitzpatrick, father of Kevin, Dan, and Eamon.\nBattle Royal History\nDODGEBALL 39\n..\nDODGEBALL 62\n..\nDODGEBALL 118\n..\nDODGEBALL 132\n..\nDODGEBALL 133\n..\nDODGEBALL 134",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball143C.jpg\" vspace=\"2\"><big><big><b>A \"Royal Championship\"</b></big><br/>A Triple Main Event in One Night!</big><br/><br/><u>Battle Royal: Title on the Line</u><br/>It's taking <i>EastCoastDodgeball</i> by storm! No rules, no allies - just the opportunity to maul and maim. The last man or woman remaining rules the roost.<br/><br/>Participants of just the seventh pregame massacre were Kelsey Clayton, Bobby Vetrano, Chris Adams, Justin Wolf, Kevin Adams, Eamon Fitzpatrick, Ryan Letsche, Mike \"Sputz\" Krott, Alysha Kelly, Mike Edwards, Diana DiBuccio, runner-up Travis Mills, and the eventual victor and first Champion of CXL3, the incomparable powerhouse <b>Kevin Fitzpatrick</b> ...<br/><br/><u>FITZ versus PATRICK</u><br/>In the mega-sized, multi-person showdown, Team FITZ defeated Team PATRICK, taking three of the five total games completed. FITZ took rounds 1, 3, and 5; PATRICK took the evens in between.<br/><br/><u>\"Championship Chase\"</u><br/>... By winning the \"royal\" free-for-all, \"Fitz\" gained possession of the ECD Championship and more than bragging rights were on the line in this chase. One-half of the DODGEBALL 145 main event was up for grabs! Could \"Fitz\" hang on to the gold for three hours!?<br/><br/>By the end of CXL3, seven different men proudly wore the strap. In Game 1 alone, inaugural champ Fitzpatrick was taken down by catching icon Mike \"Sputz\" Krott, only to be pelted seconds later by the obsessive John Tronolone. The self-proclaimed \"Creation\" carried the gold for nearly one full contest until a lob at the rim fell short and into the greedy hands of new target Bobby Vetrano.<br/><br/>It was a slow process from here on out, with only a few more title switches: <i>PLAYER of the Year '07</i> Kevin Adams and \"Rimshot King\" Ryan Letsche included. The two-time season finale headliner Letsche waited nervously and anxiously for the those damn lights  to power off. But a missed catching opportunity shattered his dreams and the man of the hour was none other than Mr. <b>Michael Edwards</b>, hanging on until the very end<br/><br/>\"The Crazy One's\" triumphant reign earned him the prestigious main event position in the July 5 <i>EastCoastDodgeball</i> presentation, DODGEBALL 145. And his adversary on that holiday weekend, <b>Kevin Adams</b>. What a confrontation that is going to be!<br/><br/><b>The Rules</b>: Classic two-team match-up with an individual \"Championship Chase\" addition.<br/><b>The Match</b>: Team FITZ defeated Team PATRICK, 3 - 2.<br/><b>Moments &amp; Stars</b>: Matt Brown catching a bullet ball in his shorts; John Tronolone's obsession with regaining the \"WWE\" Championship; an impressive catching display from Chris Adams<br/><b>Attendance</b>: 24, comprised of 18 men and 6 women<br/><b>Other Notes</b>: Attendance (female, male, and overall) completely mirrored that of last week's DODGEBALL 142. This was only the second event to feature a \"Championship Chase\", the first at <a href=\"http://dodgeball.livejournal.com/2007/12/30/\" target=\"_blank\">DODGEBALL 118</a> in late-December 2007. The Battle Royal has only become common as of recent memory, but its history can be traced back to the Spring of 2006.<br/><br/><b>Hope You've Noticed!</b><br/>Ever since the spectacular \"Family Affair\" on May 31, relatives have been coming out of the woodworks just to get a glimpse of the weekly attraction known as dodgeball. At DODGEBALL CXL3, Juan Londono's uncle made a guest appearance as did Mr. Fitzpatrick, father of Kevin, Dan, and Eamon.<br/><br/><b>Battle Royal History</b><br/><a href=\"http://dodgeball.livejournal.com/2006/05/14/\" target=\"_blank\">DODGEBALL 39</a> .. <a href=\"http://dodgeball.livejournal.com/2006/11/05/\" target=\"_blank\">DODGEBALL 62</a> .. <a href=\"http://dodgeball.livejournal.com/2007/12/30/\" target=\"_blank\">DODGEBALL 118</a> .. <a href=\"http://dodgeball.livejournal.com/2008/04/07/\" target=\"_blank\">DODGEBALL 132</a> .. <a href=\"http://dodgeball.livejournal.com/2008/04/14/\" target=\"_blank\">DODGEBALL 133</a> .. <a href=\"http://dodgeball.livejournal.com/2008/04/20/\" target=\"_blank\">DODGEBALL 134</a> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball143C.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}