{
  "id": 91592,
  "url": "https://dodgeball.livejournal.com/91592.html",
  "title": "\"NON-STOP DODGEBALL!\"",
  "date": "",
  "body_text": "DRAFT #5 Results from DODGEBALL 146!\nWho knew what to expect at this 146th, especially when only a week removed from the explosive encounter between two all-time great competitors, Kevin Adams and Mike Edwards.\nMany could consider the\nDraft\nto be that of a practice round, or better yet, target practice. No stipulations or championships on the line as seen in recent memory, no winner-take-all stakes whatsoever. Good, clean dodgeball fun and excitement as only the warriors of\nEastCoastDodgeball\nknow how. And those in attendance for this fifth random team selection likely weren't complaining at the end of the night.\nFlash Results by Game\nONE: 1, 2, 5, 7\nTWO: 3, 4, 6, 8\nBoth armies captured four victories! The match is a draw!\nTeam ONE\n1. Steve Pham - 3. Mike Edwards - 5. Anthony Zambito - 7. Bobby Vetrano - 9. Kevin Megill - 11. Dan Fitzpatrick\nTeam TWO\n2. Juan Londono - 4. John Tronolone - 6. Melissa Kerr - 8. Pam D'Luhy - 10. Mike \"Sputz\" Krott - 12. Valerie Winston\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Team ONE fought Team TWO to a 4 - 4 draw. Teams were selected the\nDodgeball Draft\n.\nMoments & Stars\n: Steve Pham out of frustration launching his sneaker over the fence; a vicious thigh shot delivered to Travis \"Urkel\" Mills\nAttendance\n: 27, comprised of 18 men and 9 women.\nNew Players\n: Anthony Zambito, Anne Bonner, Danielle Gazonas, Zachary Bergquist\nOther Notes\n: Zachary Bergquist broke the record for the youngest player in history at just 8 months old. The previous record was that of 3 year-old Gavin Moralski at DODGEBALL 48 nearly two years prior.\nDODGEBALL 150 on August 9!\nThe world finally knows what awaits in less than one month time! Six of the absolute best the game has to offer have been split up into two formidible coalitions\n2008's most promising superstar\nBOBBY VETRANO\n, legendary female powerhouse\nALISON BERTSCH\n, and the red-hot Columbian \"Cockroach\"\nJUAN LONDONO\ntitanically clash with the tough-as-nails rimshot specialist\nLAUREN STOPA\n, iconic \"Greek\" himself\nTOM ADAMS\n, and the first lady of dodgeball\nDIANA DIBUCCIO\nin the earth-shattering event of the year! Start time is an early 5pm so make every attempt to get your a** to Wall High School on August 9! This is one showcase you don't want to miss.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball146A.jpg\" vspace=\"2\"><big><big><b>DRAFT #5 Results from DODGEBALL 146!</b></big><b></b></big><br/>Who knew what to expect at this 146th, especially when only a week removed from the explosive encounter between two all-time great competitors, Kevin Adams and Mike Edwards.<br/><br/>Many could consider the <i>Draft</i> to be that of a practice round, or better yet, target practice. No stipulations or championships on the line as seen in recent memory, no winner-take-all stakes whatsoever. Good, clean dodgeball fun and excitement as only the warriors of <i>EastCoastDodgeball</i> know how. And those in attendance for this fifth random team selection likely weren't complaining at the end of the night.<br/><br/><u>Flash Results by Game</u><br/>ONE: 1, 2, 5, 7<br/>TWO: 3, 4, 6, 8<br/><br/><i>Both armies captured four victories! The match is a draw!</i><br/><br/><u>Team ONE</u><br/>1. Steve Pham - 3. Mike Edwards - 5. Anthony Zambito - 7. Bobby Vetrano - 9. Kevin Megill - 11. Dan Fitzpatrick<br/><br/><u>Team TWO</u><br/>2. Juan Londono - 4. John Tronolone - 6. Melissa Kerr - 8. Pam D'Luhy - 10. Mike \"Sputz\" Krott - 12. Valerie Winston<br/><br/><b>The Rules</b>: Classic two-team match-up.<br/><b>The Match</b>: Team ONE fought Team TWO to a 4 - 4 draw. Teams were selected the <i>Dodgeball Draft</i>.<br/><b>Moments &amp; Stars</b>: Steve Pham out of frustration launching his sneaker over the fence; a vicious thigh shot delivered to Travis \"Urkel\" Mills<br/><b>Attendance</b>: 27, comprised of 18 men and 9 women. <br/><b>New Players</b>: Anthony Zambito, Anne Bonner, Danielle Gazonas, Zachary Bergquist<br/><b>Other Notes</b>: Zachary Bergquist broke the record for the youngest player in history at just 8 months old. The previous record was that of 3 year-old Gavin Moralski at DODGEBALL 48 nearly two years prior.<br/><br/><big><big><b>DODGEBALL 150 on August 9!</b></big><b></b></big><br/>The world finally knows what awaits in less than one month time! Six of the absolute best the game has to offer have been split up into two formidible coalitions<br/><br/>2008's most promising superstar <b>BOBBY VETRANO</b>, legendary female powerhouse <b>ALISON BERTSCH</b>, and the red-hot Columbian \"Cockroach\" <b>JUAN LONDONO</b> titanically clash with the tough-as-nails rimshot specialist <b>LAUREN STOPA</b>, iconic \"Greek\" himself <b>TOM ADAMS</b>, and the first lady of dodgeball <b>DIANA DIBUCCIO</b> in the earth-shattering event of the year! Start time is an early 5pm so make every attempt to get your a** to Wall High School on August 9! This is one showcase you don't want to miss. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball146A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}