{
  "id": 91674,
  "url": "https://dodgeball.livejournal.com/91674.html",
  "title": "It Just Won't CRUMBLE",
  "date": "",
  "body_text": "Factions WALL, ALL meet in Round 7!\nNo wonder this clash ever-so deservingly captured the prestigious 2007\nRIVALRY of the Year\ncrown! Only a select few match-ups manage to produce such raw emotion and the desire to win as this year-long struggle. This seventh showing was no different than the rest - what an all-around memorable performance!\nFlash Results by Game\nALL: 1, 2\nWALL: 3, 4, 5, 6\nThe homeland defenders escaped with arguably their most impressive victory to date. Out-numbered like so many times before, members of this famed faction put their differences aside all in effort to halt such an invasion. Letsche and the Fitzpatrick brothers Eamon and Kevin, specifically, lead the force enduring all of the pain and punishment from the very beginning of the onslaught to the bitter, bitter end. And with that undying will and determination came their adversaries' reluctant decision to raise the white flag.\nTeam WALL 4, Team ALL 2.\nThe YEARBOOK\nThe seventh incarnation of Team ALL featured these fine athletes and their respective schools:\nManasquan\n(Krott, Londono, Megill, Stopa)\n; Red Bank Catholic\n(D. Fitzpatrick, Mulligan, Zambito)\n; Monmouth Regional\n(Tronolone)\n; Calvary Academy\n(Smalls)\n; Ocean Township\n(Vetrano)\n; Freehold Boro\n(Pham)\n; Allentown\n(DiBuccio)\n; Shore Regional\n(Spengeman)\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Team WALL defeated Team ALL, 4 - 2. This was the same score last time around as well\n(see\nDODGEBALL 135\n)\n.\nMoments & Stars\n: Kevin Fitzpatrick running down the Last Man Standing three-minute timer in both Games 1 and 2; Ryan Letsche angrily launching a team regeneration rim over the fence after receiving a stinging bulletball to back; Ryan Letsche, unbeknownst to his allies, flinging the rim back into the court; the hilarious Joey Smalls-deflection into teammate Diana DiBuccio\nAttendance\n: 23, comprised of 19 men and 4 women\nNew Players\n: Andrew Mulligan\nOther Notes\n: Hometown heroes Team WALL remains atop the leader board in this series, winning their fifth contest out of the total seven.\n________________________________________\n_________________\nOnly THREE Left!\nDODGEBALL 148 on 7.26.08\nThe highly-unpredictable\nPlayer's Choice Rimshot Contest\nmakes its third appearance and to victor, the opportunity to run the show as he or she sees fit.\nDODGEBALL 149 on 8.2.08\nIt won't matter how high they jump on this night, especially with a combined 14 losses. In a special\nEastCoastDodgeball\npresentation,\nJohn Tronolone\ngoes one-on-one with\nDerek Carty\n. The loser will suffer his final defeat in this first-ever \"Captains Retirement Match\".\nDODGEBALL 150 on 8.9.08 starting at 5pm\nThe single, biggest dodgeball attraction of the entire year and it only happens just this once.\nEastCoastDodgeball's\ningenius \"Writer\" has taken six of the absolute best the game has to offer, divided them up into two separate entities, and forced them to wage war with each other. The deadly alliance of\nLauren Stopa\n,\nTom Adams\n, and\nDiana DiBuccio\nmust contend with an equally destructive trio in\nBobby Vetrano\n,\nAlison Bertsch\n, and\nJuan Londono\n. Missing out on this once-in-a-lifetime event would be a sin.\nGet all the up-to-date news right here on\ndodgeball.livejournal.com\n. And for those of you on the ECD TextMessagingList, make sure you check those phones!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball147C.jpg\" vspace=\"2\"><big><big><b>Factions WALL, ALL meet in Round 7!</b></big></big><br/>No wonder this clash ever-so deservingly captured the prestigious 2007 <i>RIVALRY of the Year</i> crown! Only a select few match-ups manage to produce such raw emotion and the desire to win as this year-long struggle. This seventh showing was no different than the rest - what an all-around memorable performance!<br/><br/><u>Flash Results by Game</u><br/>ALL: 1, 2<br/>WALL: 3, 4, 5, 6<br/><br/>The homeland defenders escaped with arguably their most impressive victory to date. Out-numbered like so many times before, members of this famed faction put their differences aside all in effort to halt such an invasion. Letsche and the Fitzpatrick brothers Eamon and Kevin, specifically, lead the force enduring all of the pain and punishment from the very beginning of the onslaught to the bitter, bitter end. And with that undying will and determination came their adversaries' reluctant decision to raise the white flag.<br/><br/><i>Team WALL 4, Team ALL 2.</i><br/><br/><b>The YEARBOOK</b><br/>The seventh incarnation of Team ALL featured these fine athletes and their respective schools:<br/>Manasquan <i>(Krott, Londono, Megill, Stopa)</i>; Red Bank Catholic <i>(D. Fitzpatrick, Mulligan, Zambito)</i>; Monmouth Regional <i>(Tronolone)</i>; Calvary Academy <i>(Smalls)</i>; Ocean Township <i>(Vetrano)</i>; Freehold Boro <i>(Pham)</i>; Allentown <i>(DiBuccio)</i>; Shore Regional <i>(Spengeman)</i><br/><br/><b>The Rules</b>: Classic two-team match-up. <br/><b>The Match</b>: Team WALL defeated Team ALL, 4 - 2. This was the same score last time around as well <i>(see <a href=\"http://dodgeball.livejournal.com/2008/04/27/\" target=\"_blank\">DODGEBALL 135</a>)</i>.<br/><b>Moments &amp; Stars</b>: Kevin Fitzpatrick running down the Last Man Standing three-minute timer in both Games 1 and 2; Ryan Letsche angrily launching a team regeneration rim over the fence after receiving a stinging bulletball to back; Ryan Letsche, unbeknownst to his allies, flinging the rim back into the court; the hilarious Joey Smalls-deflection into teammate Diana DiBuccio<br/><b>Attendance</b>: 23, comprised of 19 men and 4 women<br/><b>New Players</b>: Andrew Mulligan<br/><b>Other Notes</b>: Hometown heroes Team WALL remains atop the leader board in this series, winning their fifth contest out of the total seven.<br/><br/><br/><br/><br/><br/><br/><center>________________________________________<wbr/>_________________<br/><br/><br/><br/><br/><br/><big><big><big>Only THREE Left!</big></big></big></center><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150E.jpg\" vspace=\"2\"/><big>DODGEBALL 148 on 7.26.08</big><br/>The highly-unpredictable <i>Player's Choice Rimshot Contest</i> makes its third appearance and to victor, the opportunity to run the show as he or she sees fit.<br/><br/><big>DODGEBALL 149 on 8.2.08</big><br/>It won't matter how high they jump on this night, especially with a combined 14 losses. In a special <i>EastCoastDodgeball</i> presentation, <b>John Tronolone</b> goes one-on-one with <b>Derek Carty</b>. The loser will suffer his final defeat in this first-ever \"Captains Retirement Match\".<br/><br/><big>DODGEBALL 150 on 8.9.08 starting at 5pm</big><br/>The single, biggest dodgeball attraction of the entire year and it only happens just this once. <br/><br/><i>EastCoastDodgeball's</i> ingenius \"Writer\" has taken six of the absolute best the game has to offer, divided them up into two separate entities, and forced them to wage war with each other. The deadly alliance of <b>Lauren Stopa</b>, <b>Tom Adams</b>, and <b>Diana DiBuccio</b> must contend with an equally destructive trio in <b>Bobby Vetrano</b>, <b>Alison Bertsch</b>, and <b>Juan Londono</b>. Missing out on this once-in-a-lifetime event would be a sin.<br/><br/>Get all the up-to-date news right here on <i>dodgeball.livejournal.com</i>. And for those of you on the ECD TextMessagingList, make sure you check those phones! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball147C.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150E.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}