{
  "id": 91944,
  "url": "https://dodgeball.livejournal.com/91944.html",
  "title": "ARMED FORCES",
  "date": "",
  "body_text": "Player's Choice Rimshot Contest #3\nDODGEBALL 148 Results!\nThe Road to 150\ngot a hell of a lot sweeter for one of its very own headliners. The third pregame contest of its kind produced the wily veteran and resident comedy relief\nDiana DiBuccio\nas its sole survivor. She managed to outlast an astounding 16 other combatants, each wanting the opportunity to run the show: Justin Wolf, Bill Plantz, Mike Edwards, Bobby Vetrano, Steve Pham, Kevin Fitzpatrick, Dan Spengeman, John Tronolone, Andrew Feiter, Kelsey Clayton, Eamon Fitzpatrick, Sascha Basista, Lauren Stopa, Joey Smalls, Juan Londono, and Grant Cornero.\nFlash Results by Game\n:\nAIRFORCE: 1, 2\nMARINES: 3\nCompetitors of this 148th were overly cautious in their approach to the frontline - a very methodical pace to the action. To think that each of the three completed contests ran approximately 45 minutes is insane!\nWhen the dim moonlight became the only way to see, Team AIRFORCE's measly two victories were enough to claim the win.\nThe AIRFORCE, 2. The MARINES, 1.\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Team AIRFORCE defeated Team MARINES to a 2 - 1 .\nMoments & Stars\n: the numerous double eliminations as well as a rare triple taking place throughout the night; \"Last Man Standing\" Kevin Adams taking out his entire opposition to win Game 2\nAttendance\n: 28, comprised of 21 men and 7 women.\nNew Players\n: Michelle Gelber\nOther Notes\n: The last time an event featured all but three total games was back in March 2007 at\nDODGEBALL 78\n. DODGEBALL 148 featured just the third\nPlayer's Choice\nRimshot Contest, the first two won by Travis \"Maniac\" Mills. Dan Spengeman provided the kick-ass soundtrack for the event.\nWait .. What Kind of Rimshot Contest?\nThis two-year concept has come with several different rewards. Events such as\nDODGEBALL 50\n,\nDODGEBALL LX\n, and\nDODGEBALL 82\nallowed the winner, or in many cases the winners, to become captains for the evening. The one and only \"MoneyMaker\" Rimshot Contest at\nDODGEBALL C30\nput a little extra cash in the victor's pocket. Beginning with\nDODGEBALL 118\nin late-December 2007, those that triumphed won creative control over the night's event.\nOverall, there have been 12 prematch competitions. The winners bracket consists of Tom Adams, Derek Carty, Mark Entwistle, John Tronolone, Dan Spengeman, Ray Marzarella, Mike \"Sputz\" Krott, Diana DiBuccio, Chris Adams (2), Sara DeCuir (2), Travis Mills (2), and Ryan Letsche (3).\n________________________________________\n________________________\nTHE FINAL TWO!\nDODGEBALL CXLIX on August 2\nThe two most unlucky, unsuccessful team generals in\nEastCoastDodgeball\nhistory meet one-on-one for the very first - and last - time ever when\nDerek Carty\ncollides with\nJohn Tronolone\nin a \"White Flag Match\".\nDODGEBALL 150 on August 9 beginning at 5pm!\nGoosebumps cover your arms, chills run down your spine for the most anticipated attraction of them all, DODGEBALL 150.\nScheduled is a colossal three-on-three war featuring the deadly triad of\nLauren Stopa, Tom Adams, and Diana DiBuccio\nagainst an equally destructive trio comprised of\nBobby Vetrano, Alison Bertsch, and Juan Londono\n. Those who absolutely love this game won't be disappointed after this debate is settled.\nRiding on the success of the unforgettable\n140th extravaganza\n, will family and friends pay another visit on August 9? You'll find out first hand if you attend!\n\"The Writer\" isn't finished quite yet! Be sure to check those phones during the week as a major announcement regarding this milestone 150th will be sent to all members of the ECD TextMessagingList!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><big><b><i>Player's Choice Rimshot Contest #3</i></b></big><b><br/>DODGEBALL 148 Results!</b></big></center><br/><i>The Road to 150</i> got a hell of a lot sweeter for one of its very own headliners. The third pregame contest of its kind produced the wily veteran and resident comedy relief <b>Diana DiBuccio</b> as its sole survivor. She managed to outlast an astounding 16 other combatants, each wanting the opportunity to run the show: Justin Wolf, Bill Plantz, Mike Edwards, Bobby Vetrano, Steve Pham, Kevin Fitzpatrick, Dan Spengeman, John Tronolone, Andrew Feiter, Kelsey Clayton, Eamon Fitzpatrick, Sascha Basista, Lauren Stopa, Joey Smalls, Juan Londono, and Grant Cornero. <br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball148A.jpg\" vspace=\"2\"><u>Flash Results by Game</u>:<br/>AIRFORCE: 1, 2<br/>MARINES: 3<br/><br/>Competitors of this 148th were overly cautious in their approach to the frontline - a very methodical pace to the action. To think that each of the three completed contests ran approximately 45 minutes is insane! <br/><br/>When the dim moonlight became the only way to see, Team AIRFORCE's measly two victories were enough to claim the win.<br/><br/><i>The AIRFORCE, 2. The MARINES, 1.</i><br/><br/><b>The Rules</b>: Classic two-team match-up.<br/><b>The Match</b>: Team AIRFORCE defeated Team MARINES to a 2 - 1 .<br/><b>Moments &amp; Stars</b>: the numerous double eliminations as well as a rare triple taking place throughout the night; \"Last Man Standing\" Kevin Adams taking out his entire opposition to win Game 2<br/><b>Attendance</b>: 28, comprised of 21 men and 7 women.<br/><b>New Players</b>: Michelle Gelber<br/><b>Other Notes</b>: The last time an event featured all but three total games was back in March 2007 at <a href=\"http://dodgeball.livejournal.com/2007/03/05/\" target=\"_blank\">DODGEBALL 78</a>. DODGEBALL 148 featured just the third <i>Player's Choice</i> Rimshot Contest, the first two won by Travis \"Maniac\" Mills. Dan Spengeman provided the kick-ass soundtrack for the event.<br/><br/><u>Wait .. What Kind of Rimshot Contest?</u><br/>This two-year concept has come with several different rewards. Events such as <a href=\"http://dodgeball.livejournal.com/2006/08/07/\" target=\"_blank\">DODGEBALL 50</a>, <a href=\"http://dodgeball.livejournal.com/2006/10/23/\" target=\"_blank\">DODGEBALL LX</a>, and <a href=\"http://dodgeball.livejournal.com/2007/04/08/\" target=\"_blank\">DODGEBALL 82</a> allowed the winner, or in many cases the winners, to become captains for the evening. The one and only \"MoneyMaker\" Rimshot Contest at <a href=\"http://dodgeball.livejournal.com/2008/03/16/\" target=\"_blank\">DODGEBALL C30</a> put a little extra cash in the victor's pocket. Beginning with <a href=\"http://dodgeball.livejournal.com/2007/12/30/\" target=\"_blank\">DODGEBALL 118</a> in late-December 2007, those that triumphed won creative control over the night's event.<br/><br/>Overall, there have been 12 prematch competitions. The winners bracket consists of Tom Adams, Derek Carty, Mark Entwistle, John Tronolone, Dan Spengeman, Ray Marzarella, Mike \"Sputz\" Krott, Diana DiBuccio, Chris Adams (2), Sara DeCuir (2), Travis Mills (2), and Ryan Letsche (3).<br/><br/><center>________________________________________<wbr/>________________________<br/><br/><big><big><big><b>THE FINAL TWO!</b></big></big></big></center><br/>DODGEBALL CXLIX on August 2<br/>The two most unlucky, unsuccessful team generals in <i>EastCoastDodgeball</i> history meet one-on-one for the very first - and last - time ever when <b>Derek Carty</b> collides with <b>John Tronolone</b> in a \"White Flag Match\".<br/><br/><big><b>DODGEBALL 150 on August 9 beginning at 5pm!</b></big><br/>Goosebumps cover your arms, chills run down your spine for the most anticipated attraction of them all, DODGEBALL 150.<br/><br/>Scheduled is a colossal three-on-three war featuring the deadly triad of <b>Lauren Stopa, Tom Adams, and Diana DiBuccio</b> against an equally destructive trio comprised of <b>Bobby Vetrano, Alison Bertsch, and Juan Londono</b>. Those who absolutely love this game won't be disappointed after this debate is settled.<br/><br/>Riding on the success of the unforgettable <a href=\"http://dodgeball.livejournal.com/2008/06/01/\" target=\"_blank\">140th extravaganza</a>, will family and friends pay another visit on August 9? You'll find out first hand if you attend!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150F.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150F.jpg\"/></a></center><br/>\"The Writer\" isn't finished quite yet! Be sure to check those phones during the week as a major announcement regarding this milestone 150th will be sent to all members of the ECD TextMessagingList! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball148A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150F.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}