{
  "id": 93065,
  "url": "https://dodgeball.livejournal.com/93065.html",
  "title": "More Than Just BALLS",
  "date": "",
  "body_text": "It's the year's grandest spectacle and it happens just this once.\nWelcome to the unprecedented\n150th\nEastCoastDodgeball\nPresentation\n.\nAn astonishing 35 months - a good 1,000 full 24-hour days - have whizzed on by. And in a three-year time period, look what's happened; friendships formed, tears poured, laughs shared, tempers flared, fingers broken, blood shed, and memories created. Phew, that covers a hell of a lot of ground and all from a popular playground game.\nBut plenty more has been thrown than just the beerbelly-shaped painballs and wicked-fast bulletballs. \"What else,\" you ask? Let's take a ride back in time shall we ..\nCan I Take Your Order?\nThe \"tasty\" consequences of the dreaded\nCREAMation\nencounters aren't as sweet for the defeated, incomparable powerhouse\nKevin Fitzpatrick\n, legendary female titan\nLauren Winston\n, and upcoming leading general\nBobby Vetrano\njust to name a few. Flip the menu over and see a delicious selection of poisonous pastries, baked by \"Muffin Man\"\nJuan Londono\n.\nWhat Rulebook?\nWhy catching phenom\nMike \"Sputz\" Krott\nand first lady of dodgeball\nDiana DiBuccio\nhaven't been given referee shirts still boggles minds. These enthusiastic, diehard dodgeballers threw the rulebook out the window long before it was even published. You gotta love 'em anyway.\nTemper Tantrums\nPoor innocent balloons popped, stationary trash cans kicked to the curb, neon team regenerators-turned-javelins; geez\nLetsche\n, get help. And supposedly no one informed\nJustin \"Punter\" Wolf\"\nabout the field goal kicker position - it's been filled.\nThe Fire Burns!\nThere are those who stand calmly, patiently along the backline, waiting to capture an unsuspecting prey. And then there are those who simply don't give a damn.\nJoey \"Eddie Gordo\" Smalls\n, break-dancing dodger\nSascha Basista\n, Wrestle'Maniac'\nTravis Mills\nand the original kamikaze\nSteve Adams\nnever hesitate in hurling themselves into enemy fire.\nLet Them Eat Cake!\nPlan your birthday with\nEastCoastDodgeball\n! Contact DODGEBALL 150 main eventer\nLauren Stopa\nfor all the details!\nThe Invisible Crown.\nAnd since DAY 1, the once long-haired, WWE shirt wearin', self-proclaimed \"Creation\"\nJohn Tronolone\n, apparently with the The Writer's blessing, has perhaps thrown more of his \"weight\" around than anyone else. Who presented him with the key to the kingdom?\nOver 400 competitors, some 1200 completed games, and this is what awaits.\nThe\nreward\n..\nThe MAIN EVENT:\nMen vs. Women!\nA colossal, never-before-witnessed three-on-three war dividing the genders in half! The testosterone-filled alliance of\nBOBBY VETRANO\n,\nTRAVIS MILLS\n, and\nJUAN LONDONO\nepically collide with the female faction comprised of\nALISON BERTSCH\n,\nLAUREN STOPA\n, and\nDIANA DIBUCCIO\n. There is no greater battle in 2008 than the one that awaits at DODGEBALL 150. Be there.\nShow Me The $$$!\nThe winner-take-all competition returns to the prestigious ten event spotlight! The ever-popular \"MoneyMaker\" Rimshot Contest crown is up for grabs at DODGEBALL 150. Who will walk away with bragging rights a mile wide\nand\nsome dough? Find out live August 9. Don't forget about the $1 entry fee!\n\"Want More.\"\nA most fitting tagline to such an extraordinary night. Eye-blinding decorations, delicious sideline delights, and the Spengeman-Tronolone co-produced DODGEBALL 150 Soundtrack are just three plus reasons to attend this milestone. Family, friends, coworkers, pets .. we want you there as well!\nThrowin' Our Own Party!\nThe superstars invite you to the official afterparty of DODGEBALL 150 at the one and only Applebee's in Wall. The night just wouldn't feel complete without this tradition.\nEastCoastDodgeball\nwarriors.\nBeloved relatives and close personal friends.\nLet all of us celebrate this moment together.\nAfter all, it's how we got here.\nKid Rock \"Bawitdaba\"\nOfficial Theme Song of DODGEBALL 150!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big><center><big>It's the year's grandest spectacle and it happens just this once. <br/>Welcome to the unprecedented <b>150th <i>EastCoastDodgeball</i> Presentation</b>.</big></center></big><br/>An astonishing 35 months - a good 1,000 full 24-hour days - have whizzed on by. And in a three-year time period, look what's happened; friendships formed, tears poured, laughs shared, tempers flared, fingers broken, blood shed, and memories created. Phew, that covers a hell of a lot of ground and all from a popular playground game. <br/><br/>But plenty more has been thrown than just the beerbelly-shaped painballs and wicked-fast bulletballs. \"What else,\" you ask? Let's take a ride back in time shall we .. <br/><br/><ul><li><u>Can I Take Your Order?</u><br/>The \"tasty\" consequences of the dreaded <i>CREAMation</i> encounters aren't as sweet for the defeated, incomparable powerhouse <b>Kevin Fitzpatrick</b>, legendary female titan <b>Lauren Winston</b>, and upcoming leading general <b>Bobby Vetrano</b> just to name a few. Flip the menu over and see a delicious selection of poisonous pastries, baked by \"Muffin Man\" <b>Juan Londono</b>.</li></ul><ul><li><u>What Rulebook?</u><br/>Why catching phenom <b>Mike \"Sputz\" Krott</b> and first lady of dodgeball <b>Diana DiBuccio</b> haven't been given referee shirts still boggles minds. These enthusiastic, diehard dodgeballers threw the rulebook out the window long before it was even published. You gotta love 'em anyway.</li></ul><ul><li><u>Temper Tantrums</u><br/>Poor innocent balloons popped, stationary trash cans kicked to the curb, neon team regenerators-turned-javelins; geez <b>Letsche</b>, get help. And supposedly no one informed <b>Justin \"Punter\" Wolf\"</b> about the field goal kicker position - it's been filled.</li></ul><ul><li><u>The Fire Burns!</u><br/>There are those who stand calmly, patiently along the backline, waiting to capture an unsuspecting prey. And then there are those who simply don't give a damn. <b>Joey \"Eddie Gordo\" Smalls</b>, break-dancing dodger <b>Sascha Basista</b>, Wrestle'Maniac' <b>Travis Mills</b> and the original kamikaze <b>Steve Adams</b> never hesitate in hurling themselves into enemy fire.<br/></li></ul><ul><li><u>Let Them Eat Cake!</u><br/>Plan your birthday with <i>EastCoastDodgeball</i>! Contact DODGEBALL 150 main eventer <b>Lauren Stopa</b> for all the details!</li></ul><ul><li><u>The Invisible Crown.</u><br/>And since DAY 1, the once long-haired, WWE shirt wearin', self-proclaimed \"Creation\" <b>John Tronolone</b>, apparently with the The Writer's blessing, has perhaps thrown more of his \"weight\" around than anyone else. Who presented him with the key to the kingdom?</li></ul><center><big>Over 400 competitors, some 1200 completed games, and this is what awaits.<br/>The <i>reward</i> .. </big><br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=DODGEBALL150Schedule.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/DODGEBALL150Sch.jpg\"/></a></center><br/><big><big><big> The MAIN EVENT: <i>Men vs. Women!</i></big></big></big><br/>A colossal, never-before-witnessed three-on-three war dividing the genders in half! The testosterone-filled alliance of <b>BOBBY VETRANO</b>, <b>TRAVIS MILLS</b>, and <b>JUAN LONDONO</b> epically collide with the female faction comprised of <b>ALISON BERTSCH</b>, <b>LAUREN STOPA</b>, and <b>DIANA DIBUCCIO</b>. There is no greater battle in 2008 than the one that awaits at DODGEBALL 150. Be there.<br/><br/><big><big><big>Show Me The $$$!</big></big></big><br/>The winner-take-all competition returns to the prestigious ten event spotlight! The ever-popular \"MoneyMaker\" Rimshot Contest crown is up for grabs at DODGEBALL 150. Who will walk away with bragging rights a mile wide <i>and</i> some dough? Find out live August 9. Don't forget about the $1 entry fee!<br/><br/><big><big><big>\"Want More.\"</big></big></big><br/>A most fitting tagline to such an extraordinary night. Eye-blinding decorations, delicious sideline delights, and the Spengeman-Tronolone co-produced DODGEBALL 150 Soundtrack are just three plus reasons to attend this milestone. Family, friends, coworkers, pets .. we want you there as well!<br/><br/><big><big><big>Throwin' Our Own Party!</big></big></big><br/>The superstars invite you to the official afterparty of DODGEBALL 150 at the one and only Applebee's in Wall. The night just wouldn't feel complete without this tradition.<br/><br/><center><big><big><i>EastCoastDodgeball</i> warriors.<br/>Beloved relatives and close personal friends.<br/>Let all of us celebrate this moment together.<br/>After all, it's how we got here.</big></big><br/><br/><br/><big><big><big>Kid Rock \"Bawitdaba\"<br/>Official Theme Song of DODGEBALL 150!</big></big></big><br/><iframe allowfullscreen=\"\" class=\"lj_embedcontent\" frameborder=\"0\" height=\"344\" name=\"embed_434169_30\" src=\"https://l.lj-toys.com/?auth_token=sessionless%3A1770591600%3Aembedcontent%3A434169%2630%26%26%26youtube%26OMaVsrZvIMA%3A33e20a4406a0fa4a51c2afb9b4fc644b55b76a01&amp;source=youtube&amp;vid=OMaVsrZvIMA&amp;moduleid=30&amp;preview=&amp;journalid=434169&amp;noads=\" width=\"425\"></iframe></center> </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/DODGEBALL150Sch.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}