{
  "id": 93421,
  "url": "https://dodgeball.livejournal.com/93421.html",
  "title": "BALLwitdaBALL",
  "date": "",
  "body_text": "Friends unified. Action intensified. Lives shaped forever.\nA \"Ball witda Ball\" alright! Six of the very best ever divided into two of the most awesome, destructive combinations ever assembled! 2008 sensation\nBobby Vetrano\n, Wrestle'Maniac'\nTravis Mills\n, and \"Cockroach\"\nJuan Londono\nepically clashed with fierce females powerhouse\nAlison Bertsch\n, \"The unSTOPAble\"\nLauren Stopa\n, and first lady of dodgeball\nDiana DiBuccio\n! This never-before-witnessed \"Battle of the Sexes\" could have only happened at\nEastCoastDodgeball's\n150th presentation!\nA grueling, five-hour war that seemingly showed no signs of termination.  The first moments of the feverishly-awaited collision set the stage for what would eventually become a \"West Side Story\".\nGame 1, Team \"Testosterone\" took the early lead in this match-of-the-year contender. But before long, the ladies lashed back and captured their first point on the contest as well. It was apparent things would only get more heated as the night progressed.\nThe battle-scarring third round left the Wall High School battlegrounds drenched in a pool of sweat, specifically from a fantastic \"Last Man Standing\" performance by wily veteran Justin Pierce. His enduring effort was not enough however to overcome the male-dominating opponents and thus, Vetrano, Mills, and Londono went up one again. But the minor setback only further enraged the already-furious females, who racked up yet another point in their win column. DODGEBALL 150's predominant attraction was again all tied up at 2 apiece!\nWith the moon rearing its bright, white face in the starry summer sky, the intense 3-on-3 thriller was coming down to the wire. Games 5 and Games 6 would continue the apparent pattern with Vetrano/Mills/Londono regaining the one-point edge, only for the ladies to rebound back with a triumph of their own.\nA limited amount of time was all that remained - the finish line oh-so near. Bertsch/Stopa/DiBuccio managed to knock out all but two of their adversaries, rivals-turned-allies Kevin Fitzpatrick and Chris Adams, in the seventh round. Once incomparable powerhouse \"Fitz\" was taken out of contention, the eldest Adams held his own for just seconds longer before the illuminating spotlights powered off. \"The Axe\" Adams's ability to avoid elimination saved the male alliance from certain defeat.\nBobby Vetrano, Travis Mills, and Juan Londono\nfought\nAlison Bertsch, Lauren Stopa, and Diana DiBuccio\nto a 3 to 3 draw at the 150th presentation of\nEastCoastDodgeball\n. The sites, the sounds, the incredible displays of athleticism from this fantastically star-studded confrontation will never be forgotten.\nThe secondary attraction at this massively hyped extravaganza was the popular\nMoneyMaker\nRimshot Contest. With a $1 entry fee, players and spectators were welcome to test their aim during this brief intermission. In the end, defending champion\nMike \"Sputz\" Krott\ncame out with the big win once again, defeating finalists Juan Londono and former one-time contest winner John Tronolone in a three-round showdown.\nOther participants were Eamon Fitzpatrick, former two-time winner Chris Adams, Kerrin Marchese, Mr. Cornero, former one-time winner Ray Marzarella, Bill Plantz, former one-time winner Diana DiBuccio, Grandma Tronolone, former one-time winner Dan Spengeman, Georgi Gilmartin, Kevin Fitzpatrick, Bobby Vetrano, former three-time winner Ryan Letsche, Joan Whoeler, Dan Turner, Lauren Stopa, Joey Smalls, former two-time winner Travis Mills, and Mr. Tronolone.\nThe catching machine walked away with $24 extra bucks in his wallet!\nSeason 15\nA jam-packed season from top to bottom -\nWolf-Juan II\nin a thunderous downpour, \"Championship Chase\" winner Michael Edwards's undefeated captains streak snapped, a\nDraft\n, a Battle Royal, a\nPlayer's Choice\nRimshot Contest, and the returning\nHit the Human\npregame competition! What more could you ask for?!\nThis 15th Season produced an average attendance of 28.6 and welcomed 22 new stars.\nThe only\nWet War\nwas DODGEBALL 142, where Juan Londono defeated Justin Wolf in a stunning rematch from DODGEBALL CXL. The first of six spots in the DODGEBALL 150 main event was on the line as well.\nThis was the first ten-week program that did not feature a\nCREAMation Rules\nencounter since the concept was first introduced in March 2007.\nKevin Megill, Justin Wolf, Mike \"Sputz\" Krott, Kevin Adams, Eamon Fitzpatrick, and John Tronolone participated in every Season 15 event, spanning from DODGEBALL 141 on June 7 to DODGEBALL 150 on August 9.\nDODGEBALL 150\nWall High School never looked so good! Draped beach towels, dangling swimming pool noodles, paper palm trees, hanging boogie boards, beach balls, balloons, and sparkling garland each added to the colorful summer atmosphere!\nEndless gallons of water, all natural fruit snacks, and delicious cupcakes and cookies were drank and eaten up by night's end.\nThe Spengeman-Tronolone soundtrack named\n\"DBFM\"\n, included all genres of music. Theory of a Deadman, Janet Jackson, Moby, Airbourne, The Police, New Kids on the Block, Taproot, and Rev Theory were just some of the artists featured on the five-hour compilation.\nFirst three picks for\nBertsch/Stopa/DiBuccio\n: K. Megill, J. Tronolone, J. Pierce\nFirst three picks for\nVetrano/Mills/Londono\n: K. Fitzpatrick, R. Letsche, C. Adams\nRelatives that gave it another go following the memorable DODGEBALL CXL:\nFamily Affair\nwere\nMr. Cornero\n,\nMr. Spengeman\n, and\nGrace Tronolone\n.\nNon-participating relatives on hand for DODGEBALL 150 were\nMs. Adams, Mrs. Fulton, Dan Karen, and Zoe Adams\n(Mother, aunt, cousin, and dog of Chris, Steve, and Kevin Adams)\n,\nMs. Huter\n(Mother of Sascha Basista)\n,\nTerra Bergquist\n(Mother of Zachary Bergquist)\n,\nMr. Bertsch and Mrs. Bertsch\n(Father and mother of Alison Bertsch)\n,\nMrs. Cornero\n(Mother of Bob, Grant, and Abigail Cornero, wife of Mr. Cornero)\n,\nGrandma and Grandpa Edwards\n(Paternal grandparents of Michael Edwards)\n,\nMr. Fitzpatrick\n(Father of Kevin, Dan, and Eamon Fitzpatrick)\n,\nMrs. Kerr and Jen Mullen\n(Mother and future sister-in-law of Melissa Kerr)\n,\nMr. and Mrs. Letsche\n(Father and mother of Ryan Letsche, uncle and aunt of Bobby Vetrano)\n,\nMrs. Londono and Catalina Londono\n(Mother and sister of Juan Londono)\n,\nMrs. Marchese\n(Mother of Kerrin Marchese)\n,\nMr. Megill and Mrs. Megill\n(Father and mother of Kevin Megill)\n,\nMr. Mills and Mrs. Mills\n(Father and mother Travis Mills)\n,\nMrs. Pellecchia\n(Mother of Rob Pellecchia)\n,\nMrs. Spengeman\n(Mother of Dan Spengeman, wife of Mr. Spengeman)\n,\nMr. Tronolone, Mrs. Tronolone, Megan Tronolone, and Grandma Tronolone\n(Father, stepmother, sister, and paternal grandmother of John Tronolone)\n, and\nMrs. Vetrano\n(Mother of Bobby Vetrano, aunt of Ryan Letsche)\n.\nOnline Exclusive!\nIt was a rocky road to DODGEBALL 150, as the six-person encounter seen at the event was altered numerous times en route to the big day. Superstars Grant Cornero and Tom Adams were originally scheduled participants in the 3-on-3 melee, but later declined entry due to injury and conflicting work schedule, respectively.\nThe idea behind a \"gender division\" had been talked about since the beginning of time, but never on such a grand stage like DODGEBALL 150. Once the final six were decided, \"The Writer\" took it upon himself one last time to change the match less than two weeks before showtime.\nAn event of this magnitude doesn't happen once a month, or even once a year. With beloved family and friends present, DODGEBALL 150 was a once-in-a-lifetime spectacle and only those who experienced it can explain why.\nIf eight-month old\nZachary Bergquist\nand six-year old\nGrace Tronolone\ndidn't put a smile on your face, then\nJim Butler's\nseemingly pointless high-jump dodges sure as hell did. If neither did the trick, you can always count on kamikaze\nSteve Adams\nsacrificing his body at the frontline throughout the five-hour show.\nThe modern-day \"Golden Girls\"\nJoan Whoeler\n,\nGeorgi Gilmartin\n, and\nGrandma Nancy Tronolone\ngiving it a whirl in the highly-anticipated Rimshot Contest received a nice ovation from the onlookers as did the masterful game-ending catch by first overall choice\nKevin Megill\nstopping a\nGrant Cornero\n-launched bulletball dead in its tracks.\nThe admirable, Game 3 performance from icon\nJustin Pierce\n, the \"Ohs!\" and \"Ahs!\" in reaction to the vicious nutshot delivered to\nBob Cornero\n, and the comical catching mishap from\nDerek Carty\nand\nChris Adams\nwill all be talked about years from now.\nDODGEBALL 150 hit a jackpot attendance, reaching the\nsecond highest\nposition for any event with an incredible\n51\nparticipants. This is just\none\nperson shy of last year's DODGEBALL 100. The turnout was comprised of 40 men and 11 women.\nFour new players\n- Bethany Schonberg, Karen Shih, Ryan Kerr\n(brother of Melissa Kerr)\n, and Abigail Cornero\n(sister of Bob and Grant Cornero, daughter of Mr. Cornero)\n- made their presence felt at this milestone extravaganza.\nFamiliar faces\nreturning to the dance were Kerrin Marchese whose over year and half-long dodgeball hiatus came to an end. Jim Martin and Dave Curtis also reemerged after lengthy absences.\nThe official theme song was \"Bawitdaba\" by Kid Rock.\nDODGEBALL 150 was the eighth season finale held on the back courts of Wall High School.\nAugust ties the month of March for the most number of season finales with three. DODGEBALL 30 in 2006, DODGEBALL 80 in 2007, and DODGEBALL C30 in 2008 took place in March while DODGEBALL 50 in 2006, DODGEBALL 100 in 2007, and now DODGEBALL 150 were each held in August.\nThe second\nMoneyMaker\nRimshot Contest was won by\nMike \"Sputz\" Krott\n, who pocketed a $24 pot. This was his second contest victory having won the first\nMoneyMaker\nRimshot Contest at DODGEBALL C30.\nThe \"Battle of the Sexes\" main event split six of the most recognized names in history into two formidable factions. Bobby Vetrano, Travis Mills, and Juan Londono fought Alison Bertsch, Lauren Stopa, and Diana DiBuccio to a surprising 3 to 3 tie. This was just the second season finale that ended in a tie score, the other being DODGEBALL CXL:\nFamily Affair\n.\nBobby Vetrano\nmade his ten event captains debut. This was his first team battle. His record is 0-2-1.\nTravis Mills\nmade his second ten event captains appearance, having headlined the Season 4 Finale, DODGEBALL XL, against Joe Kelly. This was his first team battle. His record is 0-2-1.\nJuan Londono\nmade his second ten event captains appearance, having headlined the Season 14 Finale, DODGEBALL CXL, against Justin Wolf. He is just the second player to co-captain a three-person team more than once, the other being Kevin Fitzpatrick. He is also the third player to headline two straight ten events, joining the likes of John Tronolone (20, 30) and Justin Pierce (90, 100). His record is 6-2-2.\nAlison Bertsch\nmade her second ten event captains appearance, having headlined the Season 11 Finale, DODGEBALL CX, teaming with Michael Butler against Melissa Kerr and Mike \"Sputz\" Krott. Alison is the first woman in history to headline a ten event more than once. Her record is 2-4-2.\nLauren Stopa\nmade her ten event captains debut. She had participated in several big time match-ups, including a mid-season main event and the special annual anniversary in 2007. Her record is 1-3-1.\nDiana DiBuccio\nmade her ten event captains debut. She broke her own record for number of matches ending in a draw. Her record is 4-4-4.\nExcluding DODGEBALL 150 newbies, the following competitors made their ten event debut: Eamon Fitzpatrick, Andrew Feiter, Jarid Putman, and Zachary Bergquist.\nIt Sounded All Too Sweet!\nThe 80-song, five-hour long soundtrack kicked ass thanks to the countless hours put in by Dan Spengeman and John Tronolone.\nEastCoastDodgeball\nalso appreciates Justin Wolf's participation, having provided speakers.\nI'm Likin' the Menu!\nA big-ups to everyone who provided food for the occasion, specifically Kathryn Nogueira and the Wolf Family for their time spent in the kitchen.\nBackstage Pass!\nThere is an endless list of superstars and spectators that assisted in setting up the unique decorations.\nEastCoastDodgeball\nthanks each of you for your time and effort.\nWe May Bend, But We Don't Break!\nJust when it seemed impossible to reach such a milestone, the dodgeball crew does it again. From the long-time veterans of yester-year to the diehard competitors of today,\nthank you\nso very much for your commitment and participation. There would be no weekly Saturday activity, no irreplaceable bonds, no dodgeball without all of you.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><b><i>Friends unified. Action intensified. Lives shaped forever.</i><br/></b></big><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G1.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G1.jpg\"/></a></center><br/>A \"Ball witda Ball\" alright! Six of the very best ever divided into two of the most awesome, destructive combinations ever assembled! 2008 sensation <b>Bobby Vetrano</b>, Wrestle'Maniac' <b>Travis Mills</b>, and \"Cockroach\" <b>Juan Londono</b> epically clashed with fierce females powerhouse <b>Alison Bertsch</b>, \"The unSTOPAble\" <b>Lauren Stopa</b>, and first lady of dodgeball <b>Diana DiBuccio</b>! This never-before-witnessed \"Battle of the Sexes\" could have only happened at <i>EastCoastDodgeball's</i> 150th presentation!<br/><br/>A grueling, five-hour war that seemingly showed no signs of termination.  The first moments of the feverishly-awaited collision set the stage for what would eventually become a \"West Side Story\".<br/><br/>Game 1, Team \"Testosterone\" took the early lead in this match-of-the-year contender. But before long, the ladies lashed back and captured their first point on the contest as well. It was apparent things would only get more heated as the night progressed.<br/><br/>The battle-scarring third round left the Wall High School battlegrounds drenched in a pool of sweat, specifically from a fantastic \"Last Man Standing\" performance by wily veteran Justin Pierce. His enduring effort was not enough however to overcome the male-dominating opponents and thus, Vetrano, Mills, and Londono went up one again. But the minor setback only further enraged the already-furious females, who racked up yet another point in their win column. DODGEBALL 150's predominant attraction was again all tied up at 2 apiece!<br/><br/>With the moon rearing its bright, white face in the starry summer sky, the intense 3-on-3 thriller was coming down to the wire. Games 5 and Games 6 would continue the apparent pattern with Vetrano/Mills/Londono regaining the one-point edge, only for the ladies to rebound back with a triumph of their own. <br/><br/>A limited amount of time was all that remained - the finish line oh-so near. Bertsch/Stopa/DiBuccio managed to knock out all but two of their adversaries, rivals-turned-allies Kevin Fitzpatrick and Chris Adams, in the seventh round. Once incomparable powerhouse \"Fitz\" was taken out of contention, the eldest Adams held his own for just seconds longer before the illuminating spotlights powered off. \"The Axe\" Adams's ability to avoid elimination saved the male alliance from certain defeat.<br/><br/><b>Bobby Vetrano, Travis Mills, and Juan Londono</b> fought <b>Alison Bertsch, Lauren Stopa, and Diana DiBuccio</b> to a 3 to 3 draw at the 150th presentation of <i>EastCoastDodgeball</i>. The sites, the sounds, the incredible displays of athleticism from this fantastically star-studded confrontation will never be forgotten.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G2.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G2.jpg\"/></a></center><br/>The secondary attraction at this massively hyped extravaganza was the popular <i>MoneyMaker</i> Rimshot Contest. With a $1 entry fee, players and spectators were welcome to test their aim during this brief intermission. In the end, defending champion <b>Mike \"Sputz\" Krott</b> came out with the big win once again, defeating finalists Juan Londono and former one-time contest winner John Tronolone in a three-round showdown.<br/><br/>Other participants were Eamon Fitzpatrick, former two-time winner Chris Adams, Kerrin Marchese, Mr. Cornero, former one-time winner Ray Marzarella, Bill Plantz, former one-time winner Diana DiBuccio, Grandma Tronolone, former one-time winner Dan Spengeman, Georgi Gilmartin, Kevin Fitzpatrick, Bobby Vetrano, former three-time winner Ryan Letsche, Joan Whoeler, Dan Turner, Lauren Stopa, Joey Smalls, former two-time winner Travis Mills, and Mr. Tronolone.<br/><br/>The catching machine walked away with $24 extra bucks in his wallet!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G3.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G3.jpg\"/></a></center><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150I1.jpg\" vspace=\"2\"/><big><u>Season 15</u></big><br/><li>A jam-packed season from top to bottom - <i>Wolf-Juan II</i> in a thunderous downpour, \"Championship Chase\" winner Michael Edwards's undefeated captains streak snapped, a <i>Draft</i>, a Battle Royal, a <i>Player's Choice</i> Rimshot Contest, and the returning <i>Hit the Human</i> pregame competition! What more could you ask for?!</li><li>This 15th Season produced an average attendance of 28.6 and welcomed 22 new stars.</li><li>The only <i>Wet War</i> was DODGEBALL 142, where Juan Londono defeated Justin Wolf in a stunning rematch from DODGEBALL CXL. The first of six spots in the DODGEBALL 150 main event was on the line as well.</li><li>This was the first ten-week program that did not feature a <i>CREAMation Rules</i> encounter since the concept was first introduced in March 2007.</li><li>Kevin Megill, Justin Wolf, Mike \"Sputz\" Krott, Kevin Adams, Eamon Fitzpatrick, and John Tronolone participated in every Season 15 event, spanning from DODGEBALL 141 on June 7 to DODGEBALL 150 on August 9.</li><br/><big><u>DODGEBALL 150</u></big><br/><li>Wall High School never looked so good! Draped beach towels, dangling swimming pool noodles, paper palm trees, hanging boogie boards, beach balls, balloons, and sparkling garland each added to the colorful summer atmosphere!</li><li>Endless gallons of water, all natural fruit snacks, and delicious cupcakes and cookies were drank and eaten up by night's end.</li><li>The Spengeman-Tronolone soundtrack named <b>\"DBFM\"</b>, included all genres of music. Theory of a Deadman, Janet Jackson, Moby, Airbourne, The Police, New Kids on the Block, Taproot, and Rev Theory were just some of the artists featured on the five-hour compilation.</li><li>First three picks for <i>Bertsch/Stopa/DiBuccio</i>: K. Megill, J. Tronolone, J. Pierce</li><li>First three picks for <i>Vetrano/Mills/Londono</i>: K. Fitzpatrick, R. Letsche, C. Adams</li><li>Relatives that gave it another go following the memorable DODGEBALL CXL: <i>Family Affair</i> were <b>Mr. Cornero</b>, <b>Mr. Spengeman</b>, and <b>Grace Tronolone</b>.</li><li>Non-participating relatives on hand for DODGEBALL 150 were <b>Ms. Adams, Mrs. Fulton, Dan Karen, and Zoe Adams</b> <i>(Mother, aunt, cousin, and dog of Chris, Steve, and Kevin Adams)</i>, <b>Ms. Huter</b> <i>(Mother of Sascha Basista)</i>, <b>Terra Bergquist</b> <i>(Mother of Zachary Bergquist)</i>, <b>Mr. Bertsch and Mrs. Bertsch</b> <i>(Father and mother of Alison Bertsch)</i>, <b>Mrs. Cornero</b> <i>(Mother of Bob, Grant, and Abigail Cornero, wife of Mr. Cornero)</i>, <b>Grandma and Grandpa Edwards</b> <i>(Paternal grandparents of Michael Edwards)</i>, <b>Mr. Fitzpatrick</b> <i>(Father of Kevin, Dan, and Eamon Fitzpatrick)</i>, <b>Mrs. Kerr and Jen Mullen </b> <i>(Mother and future sister-in-law of Melissa Kerr)</i>, <b>Mr. and Mrs. Letsche</b> <i>(Father and mother of Ryan Letsche, uncle and aunt of Bobby Vetrano)</i>, <b>Mrs. Londono and Catalina Londono</b> <i>(Mother and sister of Juan Londono)</i>, <b>Mrs. Marchese</b> <i>(Mother of Kerrin Marchese)</i>, <b>Mr. Megill and Mrs. Megill</b> <i>(Father and mother of Kevin Megill)</i>, <b>Mr. Mills and Mrs. Mills</b> <i>(Father and mother Travis Mills)</i>, <b>Mrs. Pellecchia</b> <i>(Mother of Rob Pellecchia)</i>, <b>Mrs. Spengeman</b> <i>(Mother of Dan Spengeman, wife of Mr. Spengeman)</i>, <b>Mr. Tronolone, Mrs. Tronolone, Megan Tronolone, and Grandma Tronolone</b> <i>(Father, stepmother, sister, and paternal grandmother of John Tronolone)</i>, and <b>Mrs. Vetrano</b> <i>(Mother of Bobby Vetrano, aunt of Ryan Letsche)</i>.</li><br/><i><big>Online Exclusive!</big></i><br/>It was a rocky road to DODGEBALL 150, as the six-person encounter seen at the event was altered numerous times en route to the big day. Superstars Grant Cornero and Tom Adams were originally scheduled participants in the 3-on-3 melee, but later declined entry due to injury and conflicting work schedule, respectively.<br/><br/>The idea behind a \"gender division\" had been talked about since the beginning of time, but never on such a grand stage like DODGEBALL 150. Once the final six were decided, \"The Writer\" took it upon himself one last time to change the match less than two weeks before showtime.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G4.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G4.jpg\"/></a></center><br/>An event of this magnitude doesn't happen once a month, or even once a year. With beloved family and friends present, DODGEBALL 150 was a once-in-a-lifetime spectacle and only those who experienced it can explain why.<br/><br/>If eight-month old <b>Zachary Bergquist</b> and six-year old <b>Grace Tronolone</b> didn't put a smile on your face, then <b>Jim Butler's</b> seemingly pointless high-jump dodges sure as hell did. If neither did the trick, you can always count on kamikaze <b>Steve Adams</b> sacrificing his body at the frontline throughout the five-hour show.<br/><br/>The modern-day \"Golden Girls\" <b>Joan Whoeler</b>, <b>Georgi Gilmartin</b>, and <b>Grandma Nancy Tronolone</b> giving it a whirl in the highly-anticipated Rimshot Contest received a nice ovation from the onlookers as did the masterful game-ending catch by first overall choice <b>Kevin Megill</b> stopping a <b>Grant Cornero</b>-launched bulletball dead in its tracks.<br/><br/>The admirable, Game 3 performance from icon <b>Justin Pierce</b>, the \"Ohs!\" and \"Ahs!\" in reaction to the vicious nutshot delivered to <b>Bob Cornero</b>, and the comical catching mishap from <b>Derek Carty</b> and <b>Chris Adams</b> will all be talked about years from now. <br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G6.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G6.jpg\"/></a></center><br/>DODGEBALL 150 hit a jackpot attendance, reaching the <u>second highest</u> position for any event with an incredible <b>51</b> participants. This is just <i>one</i> person shy of last year's DODGEBALL 100. The turnout was comprised of 40 men and 11 women. <br/><br/><u>Four new players</u> - Bethany Schonberg, Karen Shih, Ryan Kerr <i>(brother of Melissa Kerr)</i>, and Abigail Cornero <i>(sister of Bob and Grant Cornero, daughter of Mr. Cornero)</i> - made their presence felt at this milestone extravaganza.<br/><br/><u>Familiar faces</u> returning to the dance were Kerrin Marchese whose over year and half-long dodgeball hiatus came to an end. Jim Martin and Dave Curtis also reemerged after lengthy absences.<br/><br/>The official theme song was \"Bawitdaba\" by Kid Rock.<br/><br/>DODGEBALL 150 was the eighth season finale held on the back courts of Wall High School.<br/><br/>August ties the month of March for the most number of season finales with three. DODGEBALL 30 in 2006, DODGEBALL 80 in 2007, and DODGEBALL C30 in 2008 took place in March while DODGEBALL 50 in 2006, DODGEBALL 100 in 2007, and now DODGEBALL 150 were each held in August.<br/><br/>The second <i>MoneyMaker</i> Rimshot Contest was won by <b>Mike \"Sputz\" Krott</b>, who pocketed a $24 pot. This was his second contest victory having won the first <i>MoneyMaker</i> Rimshot Contest at DODGEBALL C30.<br/><br/>The \"Battle of the Sexes\" main event split six of the most recognized names in history into two formidable factions. Bobby Vetrano, Travis Mills, and Juan Londono fought Alison Bertsch, Lauren Stopa, and Diana DiBuccio to a surprising 3 to 3 tie. This was just the second season finale that ended in a tie score, the other being DODGEBALL CXL: <i>Family Affair</i>.<br/><ul><li><b>Bobby Vetrano</b> made his ten event captains debut. This was his first team battle. His record is 0-2-1.</li><li><b>Travis Mills</b> made his second ten event captains appearance, having headlined the Season 4 Finale, DODGEBALL XL, against Joe Kelly. This was his first team battle. His record is 0-2-1.</li><li><b>Juan Londono</b> made his second ten event captains appearance, having headlined the Season 14 Finale, DODGEBALL CXL, against Justin Wolf. He is just the second player to co-captain a three-person team more than once, the other being Kevin Fitzpatrick. He is also the third player to headline two straight ten events, joining the likes of John Tronolone (20, 30) and Justin Pierce (90, 100). His record is 6-2-2.</li><li><b>Alison Bertsch</b> made her second ten event captains appearance, having headlined the Season 11 Finale, DODGEBALL CX, teaming with Michael Butler against Melissa Kerr and Mike \"Sputz\" Krott. Alison is the first woman in history to headline a ten event more than once. Her record is 2-4-2.</li><li><b>Lauren Stopa</b> made her ten event captains debut. She had participated in several big time match-ups, including a mid-season main event and the special annual anniversary in 2007. Her record is 1-3-1.</li><li><b>Diana DiBuccio</b> made her ten event captains debut. She broke her own record for number of matches ending in a draw. Her record is 4-4-4.</li></ul>Excluding DODGEBALL 150 newbies, the following competitors made their ten event debut: Eamon Fitzpatrick, Andrew Feiter, Jarid Putman, and Zachary Bergquist.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150I2.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150I2.jpg\"/></a><br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball150G5.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G5.jpg\"/></a></center><br/><u>It Sounded All Too Sweet!</u><br/>The 80-song, five-hour long soundtrack kicked ass thanks to the countless hours put in by Dan Spengeman and John Tronolone. <i>EastCoastDodgeball</i> also appreciates Justin Wolf's participation, having provided speakers.<br/><br/><u>I'm Likin' the Menu!</u><br/>A big-ups to everyone who provided food for the occasion, specifically Kathryn Nogueira and the Wolf Family for their time spent in the kitchen.<br/><br/><u>Backstage Pass!</u><br/>There is an endless list of superstars and spectators that assisted in setting up the unique decorations. <i>EastCoastDodgeball</i> thanks each of you for your time and effort.<br/><br/><u>We May Bend, But We Don't Break!</u><br/>Just when it seemed impossible to reach such a milestone, the dodgeball crew does it again. From the long-time veterans of yester-year to the diehard competitors of today, <i>thank you</i> so very much for your commitment and participation. There would be no weekly Saturday activity, no irreplaceable bonds, no dodgeball without all of you. </div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G2.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G3.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150I1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G4.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G6.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150I2.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball150G5.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}