{
  "id": 93841,
  "url": "https://dodgeball.livejournal.com/93841.html",
  "title": "EXIT, Stage West",
  "date": "",
  "body_text": "Letsche, Cornero: The Final Encounter!\n2008's Most Intense Rivals One Last Time!\nFrom the\nAdams-Fitzpatrick\nclashes way back when to the modern-day wars between a \"Punter\" and a \"Cockroach\", there may be one rivalry, one heated confrontation, that outshines them all.\nBirthed in late-2007, the seemingly never-ceasing\nLetsche-Cornero\ndebate had to come to a halt at some point. And with tension rapidly escalating and \"Grant-Man's\" forthcoming\nEastCoastDodgeball\ndeparture, DODGEBALL 151 was the right time to put the nail in somebody's coffin.\nFlash Results by Game\nCornero: 1, 2, 3, 5\nLetsche: 4, 6\nNot even the setting sun could have produced as much heat as this eagerly-awaited collision gave off. Puddles of sweat, uncontrollable tempers flaring, innocent balloons popped (poor things), and weapons remorselessly rocketed at every moving target caused more harm to the ozone layer than air pollution.\nThe 2007 rookie-turned-legend Cornero, his ever-loving family by his side, captured three straight points leaving his greatest adversary in the dust.  \"Rimshot King\" Letsche refused to accept defeat however and temporarily forced a resurgence in himself and his allies to take Game 4. But a limited time remained and in the end, the departing superstar \"Grant-Man\" had the everlasting man-power and burning will to win to come out on top.\nGrant Cornero 4, Ryan Letsche 2.\nAfter 9 arduous months of bodily harm and mental anguish, it's safe to say that these arch rivals gained a new found respect for one another.\nEastCoastDodgeball\ncan only wonder what other dodgeball greats will step into the forefront and take it to the next level.\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Grant Cornero defeated Ryan Letsche, 4 - 2, in a feud-ending\nGodMode Rules\ncontest.\nCaptains Statistics\n: Cornero 2-3-0 / Letsche 4-6-0. This was the third and likely final meeting between the two adversaries.\nMoments & Stars\n: numbing faceshots on Rob Pellecchia, Diana DiBuccio, and Ryan McCrorey; Bill Plantz earning the final kills in Game 1 on Chris Adams and Sascha Basista; Mr. Cornero ending Game 5 by catching a Letsche-thrown bulletball; Juan Londono hitting an already-eliminated Mr. Cornero twice in the same game; an injury-free Mike \"Sputz\" Krott playing with crutches\nAttendance\n: 38, comprised of 29 men and 9 women. This was the 10th highest turnout ever recorded and the second straight event to feature more than 30 participants.\nNew Players\n: Mike Tomasuolo, Katie Grand, Scott Cascone, Colin Megill, Bob Miskiewicz, Sophia Miskiewicz, Byrant Jones.\nFamiliar Faces\n: It had been quite sometime since Ryan McCrorey and Chris Grasso participated at an\nEastCoastDodgeball\nevent.\nOther Notes\n: Prior to DODGEBALL 151, the\nGodMode Rules\nconcept had only been used at\nDODGEBALL 85\nand\nDODGEBALL 122\n. DODGEBALL 151 was also the kick-off event to the unprecedented 16th Season. Cap. Letsche provided the music via his own iPod.\nLetsche vs. Cornero History\nRound 1:\nDODGEBALL CXX\n-- Round 2:\nDODGEBALL 125\nClass of 2012 .. or Whenever You Graduate!\nEastCoastDodgeball\nwishes the best to some of its newest college students. Long-time veteran Kevin Adams is headed to The College of New Jersey and will [hopefully] make occasional appearances throughout his first semester. Semi-new faces to the game Bethany Schonberg and Andrew Feiter will be attending Concordia University Wisconsin and Villanova University, respectively. As for Cap. Grant, the 19 year-old is off to Pepperdine University in Malibu, California.",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball151B.jpg\" vspace=\"2\"> <big><big><b>Letsche, Cornero: The Final Encounter!</b></big><br/><i>2008's Most Intense Rivals One Last Time!</i></big><br/>From the <i>Adams-Fitzpatrick</i> clashes way back when to the modern-day wars between a \"Punter\" and a \"Cockroach\", there may be one rivalry, one heated confrontation, that outshines them all.<br/><br/>Birthed in late-2007, the seemingly never-ceasing <i>Letsche-Cornero</i> debate had to come to a halt at some point. And with tension rapidly escalating and \"Grant-Man's\" forthcoming <i>EastCoastDodgeball</i> departure, DODGEBALL 151 was the right time to put the nail in somebody's coffin.<br/><br/><u>Flash Results by Game</u><br/>Cornero: 1, 2, 3, 5<br/>Letsche: 4, 6<br/><br/>Not even the setting sun could have produced as much heat as this eagerly-awaited collision gave off. Puddles of sweat, uncontrollable tempers flaring, innocent balloons popped (poor things), and weapons remorselessly rocketed at every moving target caused more harm to the ozone layer than air pollution. <br/><br/>The 2007 rookie-turned-legend Cornero, his ever-loving family by his side, captured three straight points leaving his greatest adversary in the dust.  \"Rimshot King\" Letsche refused to accept defeat however and temporarily forced a resurgence in himself and his allies to take Game 4. But a limited time remained and in the end, the departing superstar \"Grant-Man\" had the everlasting man-power and burning will to win to come out on top.<br/><br/><i>Grant Cornero 4, Ryan Letsche 2.</i><br/><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball151D.jpg\" vspace=\"2\"/> After 9 arduous months of bodily harm and mental anguish, it's safe to say that these arch rivals gained a new found respect for one another. <i>EastCoastDodgeball</i> can only wonder what other dodgeball greats will step into the forefront and take it to the next level.<br/><br/><b>The Rules</b>: Classic two-team match-up.<br/><b>The Match</b>: Grant Cornero defeated Ryan Letsche, 4 - 2, in a feud-ending <i>GodMode Rules</i> contest.<br/><b>Captains Statistics</b>: Cornero 2-3-0 / Letsche 4-6-0. This was the third and likely final meeting between the two adversaries.<br/><b>Moments &amp; Stars</b>: numbing faceshots on Rob Pellecchia, Diana DiBuccio, and Ryan McCrorey; Bill Plantz earning the final kills in Game 1 on Chris Adams and Sascha Basista; Mr. Cornero ending Game 5 by catching a Letsche-thrown bulletball; Juan Londono hitting an already-eliminated Mr. Cornero twice in the same game; an injury-free Mike \"Sputz\" Krott playing with crutches<br/><b>Attendance</b>: 38, comprised of 29 men and 9 women. This was the 10th highest turnout ever recorded and the second straight event to feature more than 30 participants.<br/><b>New Players</b>: Mike Tomasuolo, Katie Grand, Scott Cascone, Colin Megill, Bob Miskiewicz, Sophia Miskiewicz, Byrant Jones. <br/><b>Familiar Faces</b>: It had been quite sometime since Ryan McCrorey and Chris Grasso participated at an <i>EastCoastDodgeball</i> event.<br/><b>Other Notes</b>: Prior to DODGEBALL 151, the <i>GodMode Rules</i> concept had only been used at <a href=\"http://dodgeball.livejournal.com/2007/04/29/\" target=\"_blank\">DODGEBALL 85</a> and <a href=\"http://dodgeball.livejournal.com/2008/01/21/\" target=\"_blank\">DODGEBALL 122</a>. DODGEBALL 151 was also the kick-off event to the unprecedented 16th Season. Cap. Letsche provided the music via his own iPod.<br/><br/><u>Letsche vs. Cornero History</u><br/>Round 1: <a href=\"http://dodgeball.livejournal.com/2008/01/07/\" target=\"_blank\">DODGEBALL CXX</a> -- Round 2: <a href=\"http://dodgeball.livejournal.com/2008/02/10/\" target=\"_blank\">DODGEBALL 125</a><br/><br/><b><i>Class of 2012 .. or Whenever You Graduate!</i></b><br/><i>EastCoastDodgeball</i> wishes the best to some of its newest college students. Long-time veteran Kevin Adams is headed to The College of New Jersey and will [hopefully] make occasional appearances throughout his first semester. Semi-new faces to the game Bethany Schonberg and Andrew Feiter will be attending Concordia University Wisconsin and Villanova University, respectively. As for Cap. Grant, the 19 year-old is off to Pepperdine University in Malibu, California. </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball151B.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball151D.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}