{
  "id": 95344,
  "url": "https://dodgeball.livejournal.com/95344.html",
  "title": "That's \"Mr.\" To You",
  "date": "",
  "body_text": "How much more could possibly happen in this already-memorable 16th Season!? The\nfinal fight\nbetween long-time adversaries Ryan Letsche and Grant Cornero, a brutal\n\"Brother vs. Brother\"\nconfrontation featuring the Fitzpatricks, the hotly-contested eighth\nWall/All\nmeeting, and the wet, wild\n3YA\ncelebration. Phew, that's one awesome start and we're only half way through the season!\nDODGEBALL 155 Main Event!\nDODGEBALL CXL:\nFamily Affair\nin late-May unshered in these so-called \"family fun\" days and since, beloved relatives and close personal friends have taken time out of their schedules just to get a glimpse of the now three-year \"local phenomenon\". Because of the overwhelming turnouts, support, and overall success,\nEastCoastDodgeball's\nbackstage crew just had to come up with this most-fitting attraction.\nAll diehard dodgeballers are urged to attend ECD's inaugural\nFather/Son\nteam contest! Wily veteran and multi-time award winner\nDan Spengeman\nand his cunning father\nMr. Spengeman\ntake on the combination of the fearless\nBob Cornero\nand his athletically-blessed pops\nMr. Cornero\n! Quite possibly the biggest, most exciting midseason showdown ever and it all goes down September 13 beginning at 7:15PM only at Wall High School!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <big>How much more could possibly happen in this already-memorable 16th Season!? The <a href=\"http://dodgeball.livejournal.com/2008/08/17/\" target=\"_blank\">final fight</a> between long-time adversaries Ryan Letsche and Grant Cornero, a brutal <a href=\"http://dodgeball.livejournal.com/2008/08/27/\" target=\"_blank\">\"Brother vs. Brother\"</a> confrontation featuring the Fitzpatricks, the hotly-contested eighth <a href=\"http://dodgeball.livejournal.com/2008/09/02/\" target=\"_blank\"><i>Wall/All</i></a> meeting, and the wet, wild <a href=\"http://dodgeball.livejournal.com/2008/09/09/\" target=\"_blank\">3YA</a> celebration. Phew, that's one awesome start and we're only half way through the season!<br/><br/><b>DODGEBALL 155 Main Event!</b><br/><a href=\"http://dodgeball.livejournal.com/2008/06/01/\" target=\"_blank\">DODGEBALL CXL: <i>Family Affair</i></a> in late-May unshered in these so-called \"family fun\" days and since, beloved relatives and close personal friends have taken time out of their schedules just to get a glimpse of the now three-year \"local phenomenon\". Because of the overwhelming turnouts, support, and overall success, <i>EastCoastDodgeball's</i> backstage crew just had to come up with this most-fitting attraction.<br/><br/>All diehard dodgeballers are urged to attend ECD's inaugural <i>Father/Son</i> team contest! Wily veteran and multi-time award winner <b>Dan Spengeman</b> and his cunning father <b>Mr. Spengeman</b> take on the combination of the fearless <b>Bob Cornero</b> and his athletically-blessed pops <b>Mr. Cornero</b>! Quite possibly the biggest, most exciting midseason showdown ever and it all goes down September 13 beginning at 7:15PM only at Wall High School!</big> </div>",
  "comment_count_text": "",
  "images": [],
  "tags": [],
  "source": "requests_bs4"
}