{
  "id": 95558,
  "url": "https://dodgeball.livejournal.com/95558.html",
  "title": "Our FATHER Who Art in HEAVEN",
  "date": "",
  "body_text": "FATHER-SON Team Combinations:\nThe Spengemans take on the Corneros in an ECD First!\nIt was just one of the nights where anything and everything happened. The  headliners themselves - two beloved Father/Son pairs - were already enough to provide a kick-ass, high-intensity main event and nothing or no one would prove otherwise, or so it was thought.\nIn the early-goings, each of the family duos swapped victories to open things up. A fine start to this magnificently star-studded contest until ...\nIn the midst of a heated Game 3, Wall Township Police Officers unexpectedly entered the worshipped battlegrounds, figuratively holding a giant stop sign on the action.\nEastCoastDodgeball's\nmodern day warriors were shocked and angered and yet had no alternative but to obey such orders.\nBut the turmoil surrounding the situation folded under and after impatiently awaiting Officer Borist's green light to continue, DODGEBALL 155 resumed without a hitch and all those present, from the sideline crowd to the soldiers in combat, enjoyed what was left of an already-spectacular and unpredictable Season 16 midway showdown.\nThe final two rounds of the night were as close as they come. Team regenerators were smacked and bodies permanently bruised all in effort to come out on top.\nFlash Results by Game\nSpengeman: 1, 3, 4\nCornero: 2\nThe end result saw the dare-devil Spengemans emerge with their arms raised in triumph.\nTeam SPENGEMAN 3. Team CORNERO 1.\nThe Rules\n: Classic two-team match-up.\nThe Match\n: Dan Spengeman and Mr. Spengeman defeated Bob Cornero and Mr. Cornero, 3 - 1, in the first-ever\nFather/Son\nteam attraction.\nCaptains Statistics\n: Dan Spengeman was the only one of the four with any prior captains experience, improving his record is 4-1-0. Mr. Spengeman set his own record becoming the oldest captain in history at the age of 63. Hats off!\nMoments & Stars\n: Steve Pham playing with a broken finger\nAttendance\n: 30, comprised of 23 men and 7 women\nNew Players\n: Christie Peace\nOther Notes\n: In the three-plus years of\nEastCoastDodgeball\n, this was the first time play was actually stopped because of a police order. Captain Dan Spengeman provided the music for the event.\nThank You!\nEastCoastDodgeball\ncouldn't be more pleased with the participation of such respected patriarchs Mr. Spengeman and Mr. Cornero. They are certainly thanked for their continued support and\nwe\nhope to see them on the dodgeball court very soon.\nOnline Exclusive!\nDODGEBALL 155's main event was planned in mid-August, right around the time of superstar Grant Cornero's ECD departure.\n________________________________________\n_______________\nUp Next ...\nHow's about we try something new.\nIn the aftermath of the colossal Father-Son outing,\nEastCoastDodgeball\ninvites you to try out this new, yet unfamiliar game type. To say the newly-coined phrase \"Non-stop Dodgeball!\" may have a slightly different meaning after DODGEBALL 156 is all said and done would surely be an understatement. Come on out September 20 to find out what's going on!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball155A.jpg\" vspace=\"2\"><big><big><b>FATHER-SON Team Combinations:</b></big><br/><i>The Spengemans take on the Corneros in an ECD First!</i></big><br/><br/>It was just one of the nights where anything and everything happened. The  headliners themselves - two beloved Father/Son pairs - were already enough to provide a kick-ass, high-intensity main event and nothing or no one would prove otherwise, or so it was thought.<br/><br/>In the early-goings, each of the family duos swapped victories to open things up. A fine start to this magnificently star-studded contest until ...<br/><br/>In the midst of a heated Game 3, Wall Township Police Officers unexpectedly entered the worshipped battlegrounds, figuratively holding a giant stop sign on the action. <i>EastCoastDodgeball's</i> modern day warriors were shocked and angered and yet had no alternative but to obey such orders.<br/><br/>But the turmoil surrounding the situation folded under and after impatiently awaiting Officer Borist's green light to continue, DODGEBALL 155 resumed without a hitch and all those present, from the sideline crowd to the soldiers in combat, enjoyed what was left of an already-spectacular and unpredictable Season 16 midway showdown.<br/><br/>The final two rounds of the night were as close as they come. Team regenerators were smacked and bodies permanently bruised all in effort to come out on top.<br/><br/><u>Flash Results by Game</u> <br/>Spengeman: 1, 3, 4<br/>Cornero: 2<br/><br/>The end result saw the dare-devil Spengemans emerge with their arms raised in triumph.<br/><i>Team SPENGEMAN 3. Team CORNERO 1.</i><br/><br/><b>The Rules</b>: Classic two-team match-up. <br/><b>The Match</b>: Dan Spengeman and Mr. Spengeman defeated Bob Cornero and Mr. Cornero, 3 - 1, in the first-ever <i>Father/Son</i> team attraction.<br/><b>Captains Statistics</b>: Dan Spengeman was the only one of the four with any prior captains experience, improving his record is 4-1-0. Mr. Spengeman set his own record becoming the oldest captain in history at the age of 63. Hats off!<br/><b>Moments &amp; Stars</b>: Steve Pham playing with a broken finger<br/><b>Attendance</b>: 30, comprised of 23 men and 7 women <br/><b>New Players</b>: Christie Peace<br/><b>Other Notes</b>: In the three-plus years of <i>EastCoastDodgeball</i>, this was the first time play was actually stopped because of a police order. Captain Dan Spengeman provided the music for the event.<br/><br/><b><i>Thank You!</i></b><br/><i>EastCoastDodgeball</i> couldn't be more pleased with the participation of such respected patriarchs Mr. Spengeman and Mr. Cornero. They are certainly thanked for their continued support and <i>we</i> hope to see them on the dodgeball court very soon.<br/><br/><b><i>Online Exclusive!</i></b><br/>DODGEBALL 155's main event was planned in mid-August, right around the time of superstar Grant Cornero's ECD departure.<br/><br/><center>________________________________________<wbr/>_______________<br/><br/><big>Up Next ...</big></center><br/>How's about we try something new. <br/><br/>In the aftermath of the colossal Father-Son outing, <i>EastCoastDodgeball</i> invites you to try out this new, yet unfamiliar game type. To say the newly-coined phrase \"Non-stop Dodgeball!\" may have a slightly different meaning after DODGEBALL 156 is all said and done would surely be an understatement. Come on out September 20 to find out what's going on! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball155A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}