{
  "id": 95971,
  "url": "https://dodgeball.livejournal.com/95971.html",
  "title": "If I Ever Needed LIFE SUPPORT",
  "date": "",
  "body_text": "EnduraDodgeball\n:\nAn\nEastCoastDodgeball\nSpecial Presentation!\nEastCoastDodgeball\nsuperstars have bared witness to a plethora of innovative gametypes and stipulations. In the past 18 months alone, everything from the comedic\nCREAMation\ncontests to the brutalization that is\nBoxBall\nand\nRisk\nhave physically, mentally, and emotionally affected each and every player one way or another.\nIn the days leading up the 156th spectacular, warriors were forewarned at the very minimum of the upcoming attraction. But did any of them take the hint seriously? Of course not and all that they had to do was read the poster's tagline!\nAnd by the end of the three \"non-stop dodgeball\" hours, participants of ECD's newest gametype,\nEnduraDodgeball\n, were gasping for air.\nThe Rules\nwere rather simple as players were equally divided into two separate entities, the WEST or the EAST, as they normally would on any given week. But the\nendura-\nis what kept everyone on their toes, literally, as the once-dreaded elimination line ceased to exist!\nThat's right, once a player was eliminated in any form or fashion, they would defect over to the other team, fighting alongside their hated adversaries and in direct combat with their allies!\nThese rules follow a similar format to that of DODGEBALL 124's\nRiskBall\nin that the idea is to \"capture\" if you will as many opponents as possible, thus turning them in to your own. With their help can a team pick up a victory.\nIn the case of DODGEBALL 156, the WEST managed to obliterate their opposition on two occasions. The WEST had a good number of enemy-turned-allies who aided them in picking off the outnumbered survivors from the EAST.\nBut Game 3 went unresolved as legends like catching icon Mike \"Sputz\" Krott and reckless kamikaze Steve Adams constantly switched armies without concern to the score while others, Melissa \"Killer\" Kerr and soon-to-be-birthday boy John Tronolone just to name two, were out for blood, viciously and remorselessly rifling weapons as if there lives were on the line.\nAnd though the score may not reflect it, make no mistake about it, DODGEBALL 156 will undoubtedly stand the test of time. A high threshold of pain was a must, especially with such unmirrored intensity and high level of unpredictability.\nHad You Been There ..\n.. you would have been a part of the quite possibly the longest single game in ECD history. The inconclusive third round lasted well over one full hour! Talk about insane!\nThe Match\n: The WEST defeated The EAST, 2 - 0, in the first-ever\nEnduraDodgeball\nrules contest.\nMoments & Stars\n: Mike \"Sputz\" Krott purposely getting eliminated just to play on the other team; Bill Plantz and John Tronolone receiving nutshots; Justin Wolf with a wicked headshot on 2008 rival Juan Londono\nAttendance\n: 28, comprised of 22 men and 6 women\nNew Players\n: Jamie Biesiada, Zach Mentzer. This was the 12th consecutive week to feature new participants.\nOther Notes\n: DODGEBALL 156 concluded it's magnificent third Summer, which began at\nDODGEBALL CXL3\n. This may have been the only event in history where teams\ndid not\nswitch courts following a game's end. *This information is not and never has been officially recorded however.\n*\nComments are highly encouraged for this entry! Send ECD your feedback on the new EnduraDodgeball by clicking on \"THROW A BALL\" on the bottom right of this post!\n__________________________________\nUP NEXT ...\nEastCoastDodgeball\nplans to kick ass yet again with\nDODGEBALL 157\n! First, the long-awaited collision between two dear friends when legendary powerhouse\nAlison Bertsch\ngoes one-on-one with female titan\nPamela D'Luhy\n. One musn't forget about the popular\nCREAMation Rules\nin effect for this match-up!\nPlus, come celebrate the life and times of the self-proclaimed \"Creation\" when John Tronolone turns 24 years-old!\nAnd lastly, \"The Writer\" is making it known that there will be an earth-shattering announcement regarding the Season 16 Finale, DODGEBALL 160!\nWhether you're a weekly participant and an occasional spectator, it doesn't matter either way! Just show up for this awesome extravaganza on September 27 beginning at 7:15!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball156C.jpg\" vspace=\"2\"><big><big><b><i>EnduraDodgeball</i>:</b></big><br/>An <i>EastCoastDodgeball</i> Special Presentation!</big><br/><br/><i>EastCoastDodgeball</i> superstars have bared witness to a plethora of innovative gametypes and stipulations. In the past 18 months alone, everything from the comedic <i>CREAMation</i> contests to the brutalization that is <i>BoxBall</i> and <i>Risk</i> have physically, mentally, and emotionally affected each and every player one way or another.<br/><br/>In the days leading up the 156th spectacular, warriors were forewarned at the very minimum of the upcoming attraction. But did any of them take the hint seriously? Of course not and all that they had to do was read the poster's tagline!<br/><br/>And by the end of the three \"non-stop dodgeball\" hours, participants of ECD's newest gametype, <i>EnduraDodgeball</i>, were gasping for air. <br/><br/><b>The Rules</b> were rather simple as players were equally divided into two separate entities, the WEST or the EAST, as they normally would on any given week. But the <i>endura-</i> is what kept everyone on their toes, literally, as the once-dreaded elimination line ceased to exist! <br/><br/>That's right, once a player was eliminated in any form or fashion, they would defect over to the other team, fighting alongside their hated adversaries and in direct combat with their allies! <br/><br/>These rules follow a similar format to that of DODGEBALL 124's <a href=\"http://dodgeball.livejournal.com/2008/01/31/\" target=\"_blank\"><i>RiskBall</i></a> in that the idea is to \"capture\" if you will as many opponents as possible, thus turning them in to your own. With their help can a team pick up a victory.<br/><br/>In the case of DODGEBALL 156, the WEST managed to obliterate their opposition on two occasions. The WEST had a good number of enemy-turned-allies who aided them in picking off the outnumbered survivors from the EAST.<br/><br/>But Game 3 went unresolved as legends like catching icon Mike \"Sputz\" Krott and reckless kamikaze Steve Adams constantly switched armies without concern to the score while others, Melissa \"Killer\" Kerr and soon-to-be-birthday boy John Tronolone just to name two, were out for blood, viciously and remorselessly rifling weapons as if there lives were on the line.<br/><br/>And though the score may not reflect it, make no mistake about it, DODGEBALL 156 will undoubtedly stand the test of time. A high threshold of pain was a must, especially with such unmirrored intensity and high level of unpredictability.<br/><br/><b>Had You Been There ..</b><br/>.. you would have been a part of the quite possibly the longest single game in ECD history. The inconclusive third round lasted well over one full hour! Talk about insane!<br/><br/><b>The Match</b>: The WEST defeated The EAST, 2 - 0, in the first-ever <i>EnduraDodgeball</i> rules contest.<br/><b>Moments &amp; Stars</b>: Mike \"Sputz\" Krott purposely getting eliminated just to play on the other team; Bill Plantz and John Tronolone receiving nutshots; Justin Wolf with a wicked headshot on 2008 rival Juan Londono<br/><b>Attendance</b>: 28, comprised of 22 men and 6 women<br/><b>New Players</b>: Jamie Biesiada, Zach Mentzer. This was the 12th consecutive week to feature new participants.<br/><b>Other Notes</b>: DODGEBALL 156 concluded it's magnificent third Summer, which began at <a href=\"http://dodgeball.livejournal.com/2008/06/24/\" target=\"_blank\">DODGEBALL CXL3</a>. This may have been the only event in history where teams <i>did not</i> switch courts following a game's end. *This information is not and never has been officially recorded however.<br/><br/>*<i>Comments are highly encouraged for this entry! Send ECD your feedback on the new EnduraDodgeball by clicking on \"THROW A BALL\" on the bottom right of this post!</i><br/><center><big><big><big>__________________________________<br/><br/>UP NEXT ...</big></big></big></center><br/><br/><i>EastCoastDodgeball</i> plans to kick ass yet again with <u>DODGEBALL 157</u>! First, the long-awaited collision between two dear friends when legendary powerhouse <b>Alison Bertsch</b> goes one-on-one with female titan <b>Pamela D'Luhy</b>. One musn't forget about the popular <i>CREAMation Rules</i> in effect for this match-up!<br/><br/>Plus, come celebrate the life and times of the self-proclaimed \"Creation\" when John Tronolone turns 24 years-old! <br/><br/>And lastly, \"The Writer\" is making it known that there will be an earth-shattering announcement regarding the Season 16 Finale, DODGEBALL 160!<br/><br/>Whether you're a weekly participant and an occasional spectator, it doesn't matter either way! Just show up for this awesome extravaganza on September 27 beginning at 7:15! </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball156C.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}