{
  "id": 97113,
  "url": "https://dodgeball.livejournal.com/97113.html",
  "title": "He Who Has The GOLD, Has The POWER",
  "date": "",
  "body_text": "DODGEBALL 159 Results!\nChampionship Chase, Rimshot Contest\nTitles Up For Grabs!\nThe Title on the Line!\nThings got kicked off the old-fashioned, good-natured way at DODGEBALL 159 with the 14th pregame Rimshot Contest. To the winner went both the opportunity to organize teams\nand\nhold the prestigious\nChampionship Chase\ncrown to start the wild game of \"cat and mouse\". WrestleManiac\nTravis Mills\nwas the only one who managed to escape defeat, beating out contestants Mike \"Sputz\" Krott, John Tronolone, Juan Londono, Bobby Vetrano, Kevin Fitzpatrick, Jason Teitelbaum, Chris Adams, Jamie Biesiada, Eamon Fitzpatrick, Kevin Adams, and Jon Yochum.\nAnd they Figured Out to Win!\nWith the formation of teams came the evening's two-team classic, pitting the Mills-named armies FIGURED IT OUT BY FIGURING IT OUT against MENTAL CASE HOSPITALITY in a wickedly-insane three-hour melee. By the end of six completed rounds, FIGURED IT OUT BY FIGURING IT OUT figured out how to pick up the victory, taking four games.\nThe Championship Hangs in the Balance!\nAt the core of the chaos was the feverishly-awaited return of the popular\nChampionship Chase\n. Just twice in over three years has this rare, individual \"title\" been up for grabs, and with a mystery prize to go with it, players were anxious to grab hold the gold.\nFrom inaugural title holder \"Maniac\" Mills and incomparable powerhouse Kevin Fitzpatrick to the extremely obsessive John Tronolone and former\nChase\nvictor Michael Edwards, the champ was a marked man, or woman, throughout this 159th.\nAfter over a dozen title switches, the legendary\nChristopher Adams\nremained unharmed in his quest to wear the \"strap\" and with it came the \"Create-An-Event\" reward!\nChase\nresults by game are as follows: Mills, K. Fitzpatrick\n(G1, G2)\n-- K. Adams, DiBuccio, Tronolone\n(G3)\n-- Edwards, Londono, Krott, K. Adams\n[2x]\n, Megill\n(G4)\n-- Tronolone\n[2x]\n(G5)\n-- Krott\n[2x]\n, Mills\n[2x]\n, C. Adams\n(G6)\n.\nThe Rules\n: Classic two-team match-up with individual\nChampionship Chase\n.\nThe Match\n: Team FIGURED IT OUT BY FIGURING IT OUT defeated Team MENTAL CASE HOSPITALITY, 4 - 2.\nMoments & Stars\n: Chris Adams missing a 20-foot bulletball lob from Travis Mills; John Tronolone failing to catch a Mike Edwards-deflection off teammate Melissa Kerr, losing the title because of it; Kevin Megill wanting Jamie Biesiada to eliminate him in order for the title to change hands\nAttendance\n: 23, comprised of 17 men and 6 women.\nOther Notes\n: The was the second week in a row without a single new player.\nPlayer's Choice\nRimshot Contest Notes\n: Travis Mills picked up his third RC victory, tying the record for most wins with Ryan Letsche. Travis has won three of the total four\nPlayer's Choice\ncontests.\nChampionship Chase\nNotes\n: DODGEBALL 159 featured just the third\nChampionship Chase\n, the first two held at\nDODGEBALL 118\nand\nDODGEBALL CXL3\n. Chris Adams came out victorious after numerous title switches and was rewarded with the \"Create-An-Event\" mystery prize which he will be able to use during Season 17\n(excluding 165 and 170)\n.\n________________________________________\n______\nWILL YOU LOOK WHAT'S LEFT ...",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><big><big><b>DODGEBALL 159 Results!</b></big><br/><i>Championship Chase, Rimshot Contest</i> Titles Up For Grabs!</big></center><br/><u>The Title on the Line!</u><br/>Things got kicked off the old-fashioned, good-natured way at DODGEBALL 159 with the 14th pregame Rimshot Contest. To the winner went both the opportunity to organize teams <i>and</i> hold the prestigious <i>Championship Chase</i> crown to start the wild game of \"cat and mouse\". WrestleManiac <b>Travis Mills</b> was the only one who managed to escape defeat, beating out contestants Mike \"Sputz\" Krott, John Tronolone, Juan Londono, Bobby Vetrano, Kevin Fitzpatrick, Jason Teitelbaum, Chris Adams, Jamie Biesiada, Eamon Fitzpatrick, Kevin Adams, and Jon Yochum.<br/><br/><img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball159A.jpg\" vspace=\"2\"> <u>And they Figured Out to Win!</u><br/>With the formation of teams came the evening's two-team classic, pitting the Mills-named armies FIGURED IT OUT BY FIGURING IT OUT against MENTAL CASE HOSPITALITY in a wickedly-insane three-hour melee. By the end of six completed rounds, FIGURED IT OUT BY FIGURING IT OUT figured out how to pick up the victory, taking four games.<br/><br/><u>The Championship Hangs in the Balance!</u><br/>At the core of the chaos was the feverishly-awaited return of the popular <i>Championship Chase</i>. Just twice in over three years has this rare, individual \"title\" been up for grabs, and with a mystery prize to go with it, players were anxious to grab hold the gold.<br/><br/>From inaugural title holder \"Maniac\" Mills and incomparable powerhouse Kevin Fitzpatrick to the extremely obsessive John Tronolone and former <i>Chase</i> victor Michael Edwards, the champ was a marked man, or woman, throughout this 159th. <br/><br/>After over a dozen title switches, the legendary <b>Christopher Adams</b> remained unharmed in his quest to wear the \"strap\" and with it came the \"Create-An-Event\" reward!<br/><br/><i>Chase</i> results by game are as follows: Mills, K. Fitzpatrick <i>(G1, G2)</i> -- K. Adams, DiBuccio, Tronolone <i>(G3)</i> -- Edwards, Londono, Krott, K. Adams <small>[2x]</small>, Megill <i>(G4)</i> -- Tronolone <small>[2x]</small> <i>(G5)</i> -- Krott <small>[2x]</small>, Mills<small>[2x]</small>, C. Adams <i>(G6)</i>.<br/><br/><b>The Rules</b>: Classic two-team match-up with individual <i>Championship Chase</i>.<br/><b>The Match</b>: Team FIGURED IT OUT BY FIGURING IT OUT defeated Team MENTAL CASE HOSPITALITY, 4 - 2.<br/><b>Moments &amp; Stars</b>: Chris Adams missing a 20-foot bulletball lob from Travis Mills; John Tronolone failing to catch a Mike Edwards-deflection off teammate Melissa Kerr, losing the title because of it; Kevin Megill wanting Jamie Biesiada to eliminate him in order for the title to change hands<br/><b>Attendance</b>: 23, comprised of 17 men and 6 women.<br/><b>Other Notes</b>: The was the second week in a row without a single new player.<br/><br/><b><i>Player's Choice</i> Rimshot Contest Notes</b>: Travis Mills picked up his third RC victory, tying the record for most wins with Ryan Letsche. Travis has won three of the total four <i>Player's Choice</i> contests.<br/><br/><b><i>Championship Chase</i> Notes</b>: DODGEBALL 159 featured just the third <i>Championship Chase</i>, the first two held at <a href=\"http://dodgeball.livejournal.com/2007/12/30/\" target=\"_blank\">DODGEBALL 118</a> and <a href=\"http://dodgeball.livejournal.com/2008/06/24/\" target=\"_blank\">DODGEBALL CXL3</a>. Chris Adams came out victorious after numerous title switches and was rewarded with the \"Create-An-Event\" mystery prize which he will be able to use during Season 17 <i>(excluding 165 and 170)</i>.<br/><br/><center>________________________________________<wbr/>______<br/><br/><big><big><big><b><i>WILL YOU LOOK WHAT'S LEFT ...</i></b></big></big></big><b><br/><br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160F.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160F.jpg\"/></a></b></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball159A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160F.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}