{
  "id": 97699,
  "url": "https://dodgeball.livejournal.com/97699.html",
  "title": "The POWER To THRILL: CLX Results",
  "date": "",
  "body_text": "A predominant main event for the ages! The most fierce, in-your-face, gifted female entities to ever grace\nEastCoastDodgeball's\nhallowed battlegrounds head-to-head in one of the most eagerly-awaited clashes ever! \"Giant Killer\"\nMELISSA KERR\n, bad-ass\nKERRIN MARCHESE\n-\nthe \"Dream Encounter\" no one thought possible!\nNot surprisingly, it got ugly and nasty real fast at the 160th spectacle as each of the respected army generals wanted to get it on. Captain Kerrin, backed by the unrelenting resources of heavy-hitter Dan Fitzpatrick, multi-time headliner Ryan Letsche, and the incomparable powerhouse and first overall choice Kevin Fitzpatrick, fired weapons left, right, and center at their helpless prey in both the opening contest and the next.\nBut \"Killer\" Kerr refused to go down without a fight as she, along with supporting players catching phenom Mike \"Sputz\" Krott, deadly southpaw Kevin Megill, and the self-proclaimed \"Creation\" and Kerr's first selection John Tronolone, would not be counted out just yet.\nThe evenly-fought confrontation would continue the same way it started. The next two contests were divided among the pair of furious females, setting the score at 3 to 2, in favor of Marchese.\nCaptain Kerr's golden chance to tie in the crucial sixth however ended up falling short and her no-nonsense, kick-ass adversary started to pull ahead. The rounds that followed would also belong to the Maryland native, running away with the match as the night progressed. After the conclusion of eight grueling contests, it was Captain Kerrin whose hand was raised in triumph.\nKerrin Marchese\ndefeated\nMelissa Kerr\n, 6 - 2, at the 160th EastCoastDodgeball extravaganza.\nThis nearly four-hour long war was as brutal and barbaric as it could possibly get. The cold October feel coupled with the explosive heat of the bulletballs produced several dozen casualties when this thing was all said and done.\nThe night's secondary attraction pitted 13 of the most recognized names of the modern era in one over-sized free-for-all! The quick and agile rookie-turned-legend\nBobby Vetrano\nmanaged to escape defeat, lastly eliminating the iconic Chris Adams to capture the hard-fought victory.\nOther combatants that took part in this season finale first were Dan Fitzpatrick, Ryan McCrorey, Michael Edwards, Travis Mills, Zach Katz, Sascha Basista, Jon Yochum, Mike \"Sputz\" Krott, former one-time winner Ryan Letsche, former four-time winner Kevin Fitzpatrick, former five-time winner John Tronolone, 2nd runner-up Michael Canzanella, and 1st runner-up Chris Adams.\nSeason 16\nTwo feud-ending\nPick Your Poison\nconfrontations, the memorable 3 Year Anniversary and Mid-Season Father/Son showdowns, and the birthday\nCREAMation\nwere just a fraction of the incredible highlights over the last ten weeks.\nThe average attendance was a remarkable 29.0, with half of the events reaching turnouts of at least 30. Throughout the ten weeks,\nECD\nwelcomed 20 new stars.\nThere were two\nWet Wars\n: DODGEBALL 154 (3 Year Anniversary) and John Tronolone's birthday event, DODGEBALL 157, which featured the\nCREAMation\nmatch-up between Alison Bertsch and Pam D'Luhy.\nDiana DiBuccio, Kevin Megill, John Tronolone, Melissa Kerr, and Ryan Letsche participated in every Season 16 event, spanning from DODGEBALL 151 on August 16 to the season-ender DODGEBALL CLX.\nDODGEBALL CLX\nDecorations consisted mainly of dark blue, light blue, and white streamers draped along the fence and tennis nets. Like DODGEBALL CXL in May, three laminated CLX signs were also hung.\nThe soundtrack was a compiled list of songs from \"The Writer\". Soundgarden, Journey, Stone Temple Pilots, John Legend, Nine Inch Nails, Saliva, and Ya Kid K were just some of the artists featured in the 55-song playlist.\nThe special\nThanksgiving Food Drive\nhosted by the Township of Ocean Human Services collected a terrific amount of canned and boxed goods, specifically from the Spengeman, Katz, and Adams families.\nFirst pick for Captain Kerrin Marchese:\nKevin Fitzpatrick\nFirst pick for Captain Melissa Kerr:\nJohn Tronolone\nNon-participating relatives on hand for DODGEBALL CLX were\nMs. Adams and Zoe Adams\n(Mother and dog of Chris, Steve, and Tom Adams)\n,\nMrs. Kerr\n(Mother of Ryan and Melissa Kerr)\n,\nJen Mullen\n(Fiance of Ryan Kerr, future sister-in-law of Melissa Kerr)\n,\nMr. and Mrs. Spengeman\n(Father and mother of Dan Spengeman)\n,\nMrs. Pontecorvo, Mr. Pontecorco, and Grandma Tronolone\n(Aunt, uncle, and paternal grandmother of John and Michael Tronolone; Sister, brother-in-law, and mother of Mr. Darrell Tronolone; extended family members of Mr. Ed Walker and Nicholas Walker)\n.\nOnline Exclusive!\nFinding a suitable, deserving opponent for Melissa Kerr put \"The Writer\" in a tough position for several months. One of the original choices was Michael \"Sputz\" Krott, who declined entry into DODGEBALL CLX multiple times.\nThe other and final selection, Kerrin Marchese, graciously accepted the challenge midway through Season 16. Captain Kerrin took time off from work and drove nearly three hours from her home state of Maryland to attend.\nTwo \"killer\" captains, grapefruit-sized welts, and family members galore! Here are some of the unforgettable moments from\nPower\nCLX!\nIt's only fitting to begin with the leading ladies\nKerr\nand\nKerrin\n. Their outfits - tie-dyed T-Shirts, high black socks, athletic sneakers - set worry in the eyes of their enemies.\nIf your eyes missed some of the action, your ears sure as hell didn't! There were some physically-scarring bodyshots that fortunately did not require hospitalization. Both\nDan Spengeman\nand\nKevin Fitzpatrick\nwere met with rocket bulletballs to the skull while\nDan Fitzpatrick\nand newbie\nMichael Canzanella\nlikely had their Adam's Apple knocked inward.\nRyan Letsche's\nmaniacal obsession with eliminating members of the\nTronolone\nclan, the \"underhand\" tactics of \"The Crazy One\"\nMichael Edwards\n, and the laugh-out-loud foot/ankle bulletball snag by\n\"Muffin Man\" Londono\nsent players and warriors home with a mind full of pictures.\nThe jackpot\nattendance of 39\nis the 6th highest ever recorded, comprised of 31 men and 8 women. Other season finales with the same overall turnout are\nDODGEBALL CX\nin November 2007 and\nDODGEBALL CXL:\nFamily Affair\nin May 2008.\nDODGEBALL CLX welcomed\nthree new players\n, all of which related to members of the current roster:\nMichael Canzanella\n(Brother of Kimmy Canzanella)\n,\nMr. Ed Walker\n(Uncle of John and Michael Tronolone, Brother-in-law of Mr. Darrell Tronolone)\n, and his son\nNicholas Walker\n(Cousin of John and Michael Tronolone, Nephew of Mr. Darrell Tronolone)\n.\nFamiliar Faces\nreturning after lengthy absences included the likes of Ben Cotta, Ryan Kerr, Kimmy Canzanella, Tom Adams, Michael Tronolone, Mr. Darrell Tronolone, and even the captain herself, Kerrin Marchese.\nThe official theme song was \"Thriller\" by Michael Jackson and the tagline was\nThe Power\nas seen on one of the many promotional posters.\nDODGEBALL CLX was the third consecutive season finale to be held on the back courts of Wall High School, the ninth overall. It was also the third finale held in the month of October, the first at 2005's\nDODGEBALL X\nand the second in 2006 at\nDODGEBALL LX\n. March, August, and October have played host to more ten events than any other months of the year.\nIn the night's secondary attraction,\nBobby Vetrano\nwon the massive 13-person Battle Royal. This was the first Battle Royal to ever take place at a ten event.\nAnd in the colossal \"dream bout\" main event, Kerrin Marchese knocked off Melissa Kerr in a stunning 8 round match-up. This was the first female-only singles match-up in season finale history. The final score was 6 to 2.\nMelissa Kerr\nmade her second season finale captains appearance, having headlined the Season 11 Finale, DODGEBALL CX, teaming with Michael \"Sputz\" Krott against Michael Butler and Alison Bertsch. This was Kerr's first-ever singles match. Her record is 0-2-0.\nKerrin Marchese\nmade her season finale captains debut. She had faced Diana DiBuccio in two separate singles match-ups in the Fall of 2006. Her record is 1-1-1.\nExcluding DODGEBALL CLX's new players, the following competitors made their ten event debut: Jon Yochum, Jamie Biesiada, and Tom Auchinleck.\nElectric Streamers and Signs!\nSpecial thanks to both Sascha Basista and John Tronolone for putting up the streamers all around the court. The posters were co-created by Mike \"Sputz\" Krott and Captain Melissa Kerr, so they too are thanked for their decorations assistance.\nPower Soundtrack!\nSpecial thanks to \"The Writer\" for providing the music for the event as well as Dan Spengeman for allowing the use of his speakers.\nThanks For Giving!\nIndeed a special thanks to the Adams, Spengeman, and Katz families for contributing towards Ocean Township's Annual Thanksgiving Food Drive.\nI Love My Dodgeball!\nEveryone who came, saw, and experienced the pageantry and the pain of DODGEBALL CLX are truly thanked for their continued efforts.\nEastCoastDodgeball\nsees no end in sight and it's because of people like you that make every attempt to attend.\nGive EastCoastDodgeball your thoughts on DODGEBALL CLX: The Power !\n10 ... Worth waiting for.\n9\n8\n7\n6\n5\n4\n3\n2\n1 ... How much does bowling cost again?",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J1.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" fetchpriority=\"high\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J1.jpg\"/></a></center><br/>A predominant main event for the ages! The most fierce, in-your-face, gifted female entities to ever grace <i>EastCoastDodgeball's</i> hallowed battlegrounds head-to-head in one of the most eagerly-awaited clashes ever! \"Giant Killer\" <b>MELISSA KERR</b>, bad-ass <b>KERRIN MARCHESE</b> - <img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160I.jpg\" vspace=\"2\">the \"Dream Encounter\" no one thought possible! <br/><br/>Not surprisingly, it got ugly and nasty real fast at the 160th spectacle as each of the respected army generals wanted to get it on. Captain Kerrin, backed by the unrelenting resources of heavy-hitter Dan Fitzpatrick, multi-time headliner Ryan Letsche, and the incomparable powerhouse and first overall choice Kevin Fitzpatrick, fired weapons left, right, and center at their helpless prey in both the opening contest and the next.<br/><br/>But \"Killer\" Kerr refused to go down without a fight as she, along with supporting players catching phenom Mike \"Sputz\" Krott, deadly southpaw Kevin Megill, and the self-proclaimed \"Creation\" and Kerr's first selection John Tronolone, would not be counted out just yet. <br/><br/>The evenly-fought confrontation would continue the same way it started. The next two contests were divided among the pair of furious females, setting the score at 3 to 2, in favor of Marchese. <br/><br/>Captain Kerr's golden chance to tie in the crucial sixth however ended up falling short and her no-nonsense, kick-ass adversary started to pull ahead. The rounds that followed would also belong to the Maryland native, running away with the match as the night progressed. After the conclusion of eight grueling contests, it was Captain Kerrin whose hand was raised in triumph.<br/><br/><i><b>Kerrin Marchese</b> defeated <b>Melissa Kerr</b>, 6 - 2, at the 160th EastCoastDodgeball extravaganza.</i><br/><br/>This nearly four-hour long war was as brutal and barbaric as it could possibly get. The cold October feel coupled with the explosive heat of the bulletballs produced several dozen casualties when this thing was all said and done.<br/><br/><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J2.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J2.jpg\"/></a><br/><br/>The night's secondary attraction pitted 13 of the most recognized names of the modern era in one over-sized free-for-all! The quick and agile rookie-turned-legend <b>Bobby Vetrano</b> managed to escape defeat, lastly eliminating the iconic Chris Adams to capture the hard-fought victory.<br/><br/>Other combatants that took part in this season finale first were Dan Fitzpatrick, Ryan McCrorey, Michael Edwards, Travis Mills, Zach Katz, Sascha Basista, Jon Yochum, Mike \"Sputz\" Krott, former one-time winner Ryan Letsche, former four-time winner Kevin Fitzpatrick, former five-time winner John Tronolone, 2nd runner-up Michael Canzanella, and 1st runner-up Chris Adams.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J3.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J3.jpg\"/></a></center><br/><u><big>Season 16</big></u><br/><li>Two feud-ending <i>Pick Your Poison</i> confrontations, the memorable 3 Year Anniversary and Mid-Season Father/Son showdowns, and the birthday <i>CREAMation</i> were just a fraction of the incredible highlights over the last ten weeks.<br/><li>The average attendance was a remarkable 29.0, with half of the events reaching turnouts of at least 30. Throughout the ten weeks, <i>ECD</i> welcomed 20 new stars.<br/><li>There were two <i>Wet Wars</i>: DODGEBALL 154 (3 Year Anniversary) and John Tronolone's birthday event, DODGEBALL 157, which featured the <i>CREAMation</i> match-up between Alison Bertsch and Pam D'Luhy.<br/><li>Diana DiBuccio, Kevin Megill, John Tronolone, Melissa Kerr, and Ryan Letsche participated in every Season 16 event, spanning from DODGEBALL 151 on August 16 to the season-ender DODGEBALL CLX.<br/><br/><big><u>DODGEBALL CLX</u></big><br/><li>Decorations consisted mainly of dark blue, light blue, and white streamers draped along the fence and tennis nets. Like DODGEBALL CXL in May, three laminated CLX signs were also hung.<br/><li>The soundtrack was a compiled list of songs from \"The Writer\". Soundgarden, Journey, Stone Temple Pilots, John Legend, Nine Inch Nails, Saliva, and Ya Kid K were just some of the artists featured in the 55-song playlist.<br/><li>The special <b>Thanksgiving Food Drive</b> hosted by the Township of Ocean Human Services collected a terrific amount of canned and boxed goods, specifically from the Spengeman, Katz, and Adams families.<br/><li>First pick for Captain Kerrin Marchese: <i>Kevin Fitzpatrick</i><br/><li>First pick for Captain Melissa Kerr: <i>John Tronolone</i><br/><li>Non-participating relatives on hand for DODGEBALL CLX were <b>Ms. Adams and Zoe Adams</b> <i>(Mother and dog of Chris, Steve, and Tom Adams)</i>, <b>Mrs. Kerr</b> <i>(Mother of Ryan and Melissa Kerr)</i>, <b>Jen Mullen</b> <i>(Fiance of Ryan Kerr, future sister-in-law of Melissa Kerr)</i>, <b>Mr. and Mrs. Spengeman</b> <i>(Father and mother of Dan Spengeman)</i>, <b>Mrs. Pontecorvo, Mr. Pontecorco, and Grandma Tronolone</b> <i>(Aunt, uncle, and paternal grandmother of John and Michael Tronolone; Sister, brother-in-law, and mother of Mr. Darrell Tronolone; extended family members of Mr. Ed Walker and Nicholas Walker)</i>.<br/><br/><i><big>Online Exclusive!</big></i><br/>Finding a suitable, deserving opponent for Melissa Kerr put \"The Writer\" in a tough position for several months. One of the original choices was Michael \"Sputz\" Krott, who declined entry into DODGEBALL CLX multiple times.<br/><br/>The other and final selection, Kerrin Marchese, graciously accepted the challenge midway through Season 16. Captain Kerrin took time off from work and drove nearly three hours from her home state of Maryland to attend.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J4.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J4.jpg\"/></a></center><br/>Two \"killer\" captains, grapefruit-sized welts, and family members galore! Here are some of the unforgettable moments from <i>Power</i> CLX!<br/><br/>It's only fitting to begin with the leading ladies <b>Kerr</b> and <b>Kerrin</b>. Their outfits - tie-dyed T-Shirts, high black socks, athletic sneakers - set worry in the eyes of their enemies.<br/><br/>If your eyes missed some of the action, your ears sure as hell didn't! There were some physically-scarring bodyshots that fortunately did not require hospitalization. Both <b>Dan Spengeman</b> and <b>Kevin Fitzpatrick</b> were met with rocket bulletballs to the skull while <b>Dan Fitzpatrick</b> and newbie <b>Michael Canzanella</b> likely had their Adam's Apple knocked inward.<br/><br/><b>Ryan Letsche's</b> maniacal obsession with eliminating members of the <b>Tronolone</b> clan, the \"underhand\" tactics of \"The Crazy One\" <b>Michael Edwards</b>, and the laugh-out-loud foot/ankle bulletball snag by <b>\"Muffin Man\" Londono</b> sent players and warriors home with a mind full of pictures.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J5.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J5.jpg\"/></a></center><br/>The jackpot <u>attendance of 39</u> is the 6th highest ever recorded, comprised of 31 men and 8 women. Other season finales with the same overall turnout are <a href=\"http://dodgeball.livejournal.com/2007/11/05/\" target=\"_blank\">DODGEBALL CX</a> in November 2007 and <a href=\"http://dodgeball.livejournal.com/2008/06/01/\" target=\"_blank\">DODGEBALL CXL: <i>Family Affair</i></a> in May 2008.<br/><br/><img align=\"right\" alt=\"\" hspace=\"2\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160H.jpg\" vspace=\"2\">DODGEBALL CLX welcomed <u>three new players</u>, all of which related to members of the current roster: <b>Michael Canzanella</b> <i>(Brother of Kimmy Canzanella)</i>, <b>Mr. Ed Walker</b> <i>(Uncle of John and Michael Tronolone, Brother-in-law of Mr. Darrell Tronolone)</i>, and his son <b>Nicholas Walker</b> <i>(Cousin of John and Michael Tronolone, Nephew of Mr. Darrell Tronolone)</i>.<br/><br/><u>Familiar Faces</u> returning after lengthy absences included the likes of Ben Cotta, Ryan Kerr, Kimmy Canzanella, Tom Adams, Michael Tronolone, Mr. Darrell Tronolone, and even the captain herself, Kerrin Marchese.<br/><br/>The official theme song was \"Thriller\" by Michael Jackson and the tagline was <i><b>The Power</b></i> as seen on one of the many promotional posters.<br/><br/>DODGEBALL CLX was the third consecutive season finale to be held on the back courts of Wall High School, the ninth overall. It was also the third finale held in the month of October, the first at 2005's <a href=\"http://dodgeball.livejournal.com/2005/10/29/\" target=\"_blank\">DODGEBALL X</a> and the second in 2006 at <a href=\"http://dodgeball.livejournal.com/2006/10/23/\" target=\"_blank\">DODGEBALL LX</a>. March, August, and October have played host to more ten events than any other months of the year.<br/><br/>In the night's secondary attraction, <b>Bobby Vetrano</b> won the massive 13-person Battle Royal. This was the first Battle Royal to ever take place at a ten event.<br/><br/>And in the colossal \"dream bout\" main event, Kerrin Marchese knocked off Melissa Kerr in a stunning 8 round match-up. This was the first female-only singles match-up in season finale history. The final score was 6 to 2.<li><b>Melissa Kerr</b> made her second season finale captains appearance, having headlined the Season 11 Finale, DODGEBALL CX, teaming with Michael \"Sputz\" Krott against Michael Butler and Alison Bertsch. This was Kerr's first-ever singles match. Her record is 0-2-0.<br/><li><b>Kerrin Marchese</b> made her season finale captains debut. She had faced Diana DiBuccio in two separate singles match-ups in the Fall of 2006. Her record is 1-1-1.<br/><br/>Excluding DODGEBALL CLX's new players, the following competitors made their ten event debut: Jon Yochum, Jamie Biesiada, and Tom Auchinleck.<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball160J6.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J6.jpg\"/></a></center><br/><u>Electric Streamers and Signs!</u><br/>Special thanks to both Sascha Basista and John Tronolone for putting up the streamers all around the court. The posters were co-created by Mike \"Sputz\" Krott and Captain Melissa Kerr, so they too are thanked for their decorations assistance.<br/><br/><u>Power Soundtrack!</u><br/>Special thanks to \"The Writer\" for providing the music for the event as well as Dan Spengeman for allowing the use of his speakers.<br/><br/><u>Thanks For Giving!</u><br/>Indeed a special thanks to the Adams, Spengeman, and Katz families for contributing towards Ocean Township's Annual Thanksgiving Food Drive. <br/><br/><u>I Love My Dodgeball!</u><br/>Everyone who came, saw, and experienced the pageantry and the pain of DODGEBALL CLX are truly thanked for their continued efforts. <i>EastCoastDodgeball</i> sees no end in sight and it's because of people like you that make every attempt to attend.<br/><br/><center><br/><form action=\"http://poll.pollhost.com/vote.cgi\" method=\"post\"><table bgcolor=\"#EEEEEE\" border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"150\"><tr><td><font color=\"#000088\" face=\"Calibri\" size=\"-1\"><b>Give EastCoastDodgeball your thoughts on DODGEBALL CLX: The Power !</b></font></td></tr><tr><td><center><select name=\"answer\"><option value=\"1\">10 ... Worth waiting for.</option><option value=\"2\">9</option><option value=\"3\">8</option><option value=\"4\">7</option><option value=\"5\">6</option><option value=\"6\">5</option><option value=\"7\">4</option><option value=\"8\">3</option><option value=\"9\">2</option><option value=\"10\">1 ... How much does bowling cost again?</option></select></center><tr><td colspan=\"2\"><input name=\"config\" type=\"hidden\" value=\"V1dFQ29vd25lcgkxMjI0NDYwMDA5CUVFRUVFRQkwMDAwODgJQ29taWMgU2FucyBNUwlHcmF5\"/><center><input type=\"submit\" value=\"Vote\"/>  <input name=\"view\" type=\"submit\" value=\"View\"/></center></td></tr><tr><td align=\"right\" bgcolor=\"#FFFFFF\" colspan=\"2\"><font color=\"#000000\" face=\"Comic Sans MS\" size=\"-2\"><a href=\"http://www.pollhost.com/\" rel=\"nofollow\" target=\"_blank\"><font color=\"#000099\"></font></a></font></td></tr></td></tr></table></form><br/><br/></center> </li></li></img></li></li></li></li></li></li></li></li></li></li></img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J1.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160I.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J2.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J3.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J4.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J5.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160H.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball160J6.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}