{
  "id": 99258,
  "url": "https://dodgeball.livejournal.com/99258.html",
  "title": "In a SUPER MARIO WORLD",
  "date": "",
  "body_text": "\"The Axe\" Adams Takes Charge!\nA Land Full of Mushrooms and Stars!\nChampionship Chase\nvictor\nChristopher Adams\noversaw this 164th presentation. What did the iconic,\nBoxBall\nfounder come up with? What tricks did he have up his sleeve?\nThe Rules\n- and decorations - were simple yet creatively done. Teams were formulated via Adams's handpicked leading generals, Alysha Kelly and Ashley Hoppe. Then, the classic two-team war got under way, with use of 4, yes\n4\n, very special MarioBrothers-related rims!\nFirst, the \"extra life\"\ngreen mushroom\nallowed for a full-team regeneration, with an endless number of uses. Two poisonous\npurple mushrooms\nhowever were hung nearby, and if hit, eliminated the person who made contact. And finally, the bright and shiny yellow\nstar\n- certainly a Megill favorite, who went on to hit this three times - gave \"GodMode-like\" powers for a substantial 3-minute time frame!\nThese new additions coupled with the fury of Mother Nature made this 164th spectacle just that - a spectacle. It just goes to show that anything than can happen in\nECD's\nmost unpredictacle month!\nFlash Results by Game\n:\nKelly: 2, 5\nHoppe: 1, 3, 4\nThe Match\n: Ashley Hoppe defeated Alysha Kelly, 3 - 2. Each of the ladies participated in their debut captains match.\nMoments & Stars\n: Justin Wolf's painful nutshot on Chris Adams, even though Adams caught the ball; Kevin Fitzpatrick accidently pelted in the ear by John Tronolone; Juan Londono's fancy 360 spin-elimination on Ryan Letsche; Jon Yochum falling victim to numerous shots even though he was already out; John Tronolone and Kevin Megill unfairly blocking with their umbrellas\nAttendance\n: 18, comprised of 14 men and 4 women\nNew Players\n: Bill Houke\nOther Notes\n: DODGEBALL 164:\nBeware the Axe\nwas the 32nd\nWet War\n, that last being\nDODGEBALL 157\nin late-September. Like last week, the tennis lights went off at 9pm and play did not switch to the front courts.\n________________________________________\n________\nMid-Season Main Event Up Next!\nSeven years of wrestling events, clinking beers, and uncontrollable laughter are angrily shoved aside for the Season 17 mid-war. Legendary figures of the game take out their frustrations on their friend-turned-foe  when\nJohn Tronolone\nbattles\nRyan Letsche\nin an match with double the stipulation - the first-ever\nWhite Flag - CREAMation\nencounter!",
  "body_html": "<div class=\"aentry-post__text aentry-post__text--view\"> <img align=\"right\" alt=\"\" fetchpriority=\"high\" hspace=\"2\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball164A.jpg\" vspace=\"2\"><big><big><b>\"The Axe\" Adams Takes Charge!</b></big><br/><i>A Land Full of Mushrooms and Stars!</i></big><br/><br/><a href=\"http://dodgeball.livejournal.com/2008/10/13/\" target=\"_blank\"><i>Championship Chase</i></a> victor <b>Christopher Adams</b> oversaw this 164th presentation. What did the iconic, <i>BoxBall</i> founder come up with? What tricks did he have up his sleeve?<br/><br/><b>The Rules</b> - and decorations - were simple yet creatively done. Teams were formulated via Adams's handpicked leading generals, Alysha Kelly and Ashley Hoppe. Then, the classic two-team war got under way, with use of 4, yes <i>4</i>, very special MarioBrothers-related rims! <br/><br/>First, the \"extra life\" <b>green mushroom</b> allowed for a full-team regeneration, with an endless number of uses. Two poisonous <b>purple mushrooms</b> however were hung nearby, and if hit, eliminated the person who made contact. And finally, the bright and shiny yellow <b>star</b> - certainly a Megill favorite, who went on to hit this three times - gave \"GodMode-like\" powers for a substantial 3-minute time frame!<br/><br/>These new additions coupled with the fury of Mother Nature made this 164th spectacle just that - a spectacle. It just goes to show that anything than can happen in <i>ECD's</i> most unpredictacle month!<br/><br/><u>Flash Results by Game</u>:<br/>Kelly: 2, 5<br/>Hoppe: 1, 3, 4<br/><br/><b>The Match</b>: Ashley Hoppe defeated Alysha Kelly, 3 - 2. Each of the ladies participated in their debut captains match.<br/><b>Moments &amp; Stars</b>: Justin Wolf's painful nutshot on Chris Adams, even though Adams caught the ball; Kevin Fitzpatrick accidently pelted in the ear by John Tronolone; Juan Londono's fancy 360 spin-elimination on Ryan Letsche; Jon Yochum falling victim to numerous shots even though he was already out; John Tronolone and Kevin Megill unfairly blocking with their umbrellas<br/><b>Attendance</b>: 18, comprised of 14 men and 4 women<br/><b>New Players</b>: Bill Houke<br/><b>Other Notes</b>: DODGEBALL 164: <i>Beware the Axe</i> was the 32nd <i>Wet War</i>, that last being <a href=\"http://dodgeball.livejournal.com/2008/09/30/\" target=\"_blank\">DODGEBALL 157</a> in late-September. Like last week, the tennis lights went off at 9pm and play did not switch to the front courts.<br/><br/><center>________________________________________<wbr/>________<br/><br/><big><b>Mid-Season Main Event Up Next!</b></big></center><br/>Seven years of wrestling events, clinking beers, and uncontrollable laughter are angrily shoved aside for the Season 17 mid-war. Legendary figures of the game take out their frustrations on their friend-turned-foe  when <b>John Tronolone</b> battles <b>Ryan Letsche</b> in an match with double the stipulation - the first-ever <i>White Flag - CREAMation</i> encounter!<br/><br/><center><a href=\"http://s140.photobucket.com/albums/r30/Dodgeball2007/?action=view&amp;current=Dodgeball165A.jpg\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Photobucket\" border=\"0\" loading=\"lazy\" src=\"https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball165A.jpg\"/></a></center> </img></div>",
  "comment_count_text": "",
  "images": [
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball164A.jpg",
    "https://i140.photobucket.com/albums/r30/Dodgeball2007/Dodgeball165A.jpg"
  ],
  "tags": [],
  "source": "requests_bs4"
}