[
  {
    "id": 157,
    "category": "narrative",
    "title": "John's life is a redemption narrative",
    "value": "7 redemptive vs 5 contaminated turning points",
    "detail": "Every contamination (car accident, family estrangement, surgery, breakup) is followed by growth. The ratio isn't just positive — it's structural. John's identity is built on transforming suffering into story.",
    "sort_order": 1
  },
  {
    "id": 158,
    "category": "narrative",
    "title": "The hidden trauma layer: 2004-2005",
    "value": "Car accident → panic attacks. Near-anorexia. Family estrangement. None appear in Timelines.",
    "detail": "These events only surface in non-timeline posts (Yeah I Said It, Kia Sorento). The Timelines are the public narrative; the non-timeline posts are the private one. The gap between them IS the story.",
    "sort_order": 2
  },
  {
    "id": 159,
    "category": "narrative",
    "title": "Hero's Journey fit is almost perfect",
    "value": "9 classical stages map cleanly to 2004-2026",
    "detail": "Ordinary World (HS/college), Threshold (2008 coming out), Ordeal (2014 peak achievement / 2017 surgery), Return (engagement, executive role). The Undertaker handshake is literally the Ordeal's treasure.",
    "sort_order": 3
  },
  {
    "id": 160,
    "category": "origin",
    "title": "'The power of an internal desire liberated!' predates coming out",
    "value": "First written March 2008 in Yeah I Said It — before anyone knew",
    "detail": "This wasn't a retroactive motto. It was a declaration made while still in the process of becoming. The liberation was internal before it was external.",
    "sort_order": 4
  },
  {
    "id": 161,
    "category": "origin",
    "title": "Five people's origin stories are told through songs",
    "value": "La Bouche → Stopa, Mariah → Jake, Britney → Corcione, Jimmy Eat World → Valerie, Everlast → Edwards, John Mayer → KMJ",
    "detail": "Merrie Melodies maps friendships to music. The KMJ/John Mayer connection is the most loaded: 'Say' played on the radio right after John came out to him. 'I said exactly what I needed to say.'",
    "sort_order": 5
  },
  {
    "id": 162,
    "category": "relationships",
    "title": "The Lifers: 9 people span 10+ years",
    "value": "Tim Moore, The Pops, Dan Farnkopf, Dan Spengeman, Lauren Stopa, Lauren Winston, John Tronolone, Rob",
    "detail": "These aren't just recurring names — they're the load-bearing walls of John's social architecture. Everyone else is seasonal.",
    "sort_order": 6
  },
  {
    "id": 163,
    "category": "relationships",
    "title": "Social network peak vs valley",
    "value": "Peak: 9 people (2014) vs Minimum: 1 (2012)",
    "detail": "The size of John's active social world fluctuates dramatically. This isn't random — it tracks major life transitions.",
    "sort_order": 7
  },
  {
    "id": 164,
    "category": "relationships",
    "title": "ECD was a social supernova: 171 events created 500+ connections",
    "value": "But most ECD-era people don't appear after 2009",
    "detail": "The dodgeball era generated massive social volume but low social durability. The Lifers mostly predate or postdate ECD. Community creation and deep friendship operate on different timescales.",
    "sort_order": 8
  },
  {
    "id": 165,
    "category": "health",
    "title": "Every medical event is followed by adventure within months",
    "value": "2011 labrum → recovery. 2017 spine → Mediterranean cruise 2018. Pattern holds 100%.",
    "detail": "This isn't coincidence — it's a coping architecture. Travel-as-recovery is a core mechanism. The comeback isn't despite the setback; it's because of it.",
    "sort_order": 9
  },
  {
    "id": 166,
    "category": "writing",
    "title": "Writing grade level: 14.2 (2004) → 35.0 (2025)",
    "value": "Flesch-Kincaid reading level tracked across 22 years of writing",
    "detail": "John's prose complexity has a measurable trajectory. The allegorical posts (Kia Sorento, Nut Cracker) score highest — they're deliberately literary.",
    "sort_order": 10
  },
  {
    "id": 167,
    "category": "writing",
    "title": "The esoteric signature: John writes allegory, everyone notices",
    "value": "Jim Butler: 'Way too esoteric.' Pam D: 'When Jim Butler calls you esoteric... pot, meet kettle.'",
    "detail": "Non-timeline posts use extended metaphor: cars (Kia Sorento), cooking (Ring Ring!), newspapers (On Newsstands Now), nutcrackers. The Timelines are documentary; the non-timeline posts are literary. Together they form a complete voice.",
    "sort_order": 11
  },
  {
    "id": 168,
    "category": "writing",
    "title": "Merrie Melodies Part II was promised but never published",
    "value": "'That\\'s All Folks! Part II Coming Soon!' — the great unfinished work",
    "detail": "Who were the remaining people? What songs? The absence of Part II is itself a data point — some stories resist completion.",
    "sort_order": 12
  },
  {
    "id": 169,
    "category": "themes",
    "title": "8 life themes discovered by NMF topic modeling",
    "value": "T1: sep, 27, turned; T2: year, comedian, anniversary; T3: trip, ski, 000; T4: cruise, croatia, years; T5: dec, 15, 18; T6: wwe, event, oct; T7: aug, 16, dodgeball; T8: jul, 29, birthday",
    "detail": "These topics are discovered, not assigned. The algorithm found them in the raw text. Some map to obvious life domains (wrestling, career); others reveal unexpected clusters.",
    "sort_order": 13
  },
  {
    "id": 170,
    "category": "deep_dive",
    "title": "The Undertaker ticket story: friendship as infrastructure",
    "value": "5 friends coordinated to buy meet-and-greet tickets while John sat in a Kmart parking lot",
    "detail": "{\"ticket_heroes\": [\"Ryan Letsche\", \"Diana DiBuccio\", \"DeCuir\", \"D'Luhy (Pam)\", \"Lauren Stopa\"], \"location\": \"Wall Township Kmart / Dollar Tree parking lot\", \"handshake\": \"4:10:18 PM CT, Saturday April 5, 2014\", \"subtitle\": \"10 Years After The First .. 20 Years To Meet The Man.\", \"key_quote\": \"Well you guys just made his dream come true. \\u2014 DiBuccio\"}",
    "sort_order": 14
  },
  {
    "id": 171,
    "category": "deep_dive",
    "title": "The 723-day relationship: the catalyst that changed everything",
    "value": "Nov 21, 2006 – Jun 10, 2008. Led directly to coming out.",
    "detail": "From Kia Sorento: 'precious was more than a two-syllable adjective.' The breakup didn't destroy — it liberated. 'I celebrate my liberation and Valerie's birthday in the same 24-hour span!'",
    "sort_order": 15
  },
  {
    "id": 172,
    "category": "deep_dive",
    "title": "ECD retirement: the first great letting-go",
    "value": "171 events. 500+ participants. 3+ years. Retired Jan 3, 2009.",
    "detail": "'I got tired of kissin' ass.' Written as newspaper headlines in On Newsstands Now. 30+ people thanked by name. The retirement was John's first act of choosing authenticity over community approval.",
    "sort_order": 16
  },
  {
    "id": 173,
    "category": "deep_dive",
    "title": "2005-2007: the hidden reconciliation arc",
    "value": "Family estrangement → aunt/uncle refuge → July 2007 reunion",
    "detail": "From Kia Sorento: 'Rebuilding relationships with the potty-mouthed madre and the funny-as-all-hell father were a much-needed blessing.' This 2-year arc is almost invisible in the Timelines — it only fully surfaces in the allegorical posts.",
    "sort_order": 17
  },
  {
    "id": 174,
    "category": "counter_narrative",
    "title": "'0 Regrets' vs. 'regret ever regretting'",
    "value": "Both phrases are John's. The tension is the insight.",
    "detail": "Kevin Megill coined 'regret ever regretting' (2008). John's '0 Regrets' branding came later. He didn't arrive at zero regrets by having none — he arrived by regretting the regretting. The philosophy is earned, not inherited.",
    "sort_order": 18
  },
  {
    "id": 175,
    "category": "counter_narrative",
    "title": "The public narrative vs. the private one",
    "value": "Timelines = celebration. Non-timeline posts = vulnerability.",
    "detail": "The Timelines never mention the 2004 car accident, panic attacks, near-anorexia, or deep emotional crises. These only appear in Nut Cracker, Kia Sorento, Yeah I Said It. John curates his public story — and the curation itself reveals what he protects.",
    "sort_order": 19
  },
  {
    "id": 176,
    "category": "by_the_numbers",
    "title": "The life in numbers",
    "value": "{\"years_documented\": 22, \"total_milestones\": 227, \"total_people\": 129, \"total_quotes\": 79, \"wrestlemanias\": 8, \"career_span\": \"Cashier (2001) \\u2192 Executive Director (2025)\", \"countries\": \"20+\", \"lj_posts\": 30}",
    "detail": "22 years of continuous self-documentation. One of the most comprehensive personal archives written in real time by a single person on the early social web.",
    "sort_order": 20
  },
  {
    "id": 177,
    "category": "by_the_numbers",
    "title": "Comeback ratio: every setback gets an answer",
    "value": "9 documented comebacks across 22 years",
    "detail": "Torn labrum → full recovery. Spinal surgery → Mediterranean cruise. Relationship ends → liberation. The pattern isn't luck — it's character architecture.",
    "sort_order": 21
  },
  {
    "id": 178,
    "category": "culture",
    "title": "6 people have official theme songs (Merrie Melodies)",
    "value": "Each song captures a specific moment of connection, not just a preference",
    "detail": "La Bouche → Stopa (dodgeball court, glowing smile). Mariah → Jake (computer replay obsession). Britney → Corcione (karaoke king). Jimmy Eat World → Valerie (graduation drive). Everlast → Edwards (MySpace page). John Mayer → KMJ (post-coming-out car radio). The song isn't about music — it's about the moment the person became permanent.",
    "sort_order": 22
  },
  {
    "id": 179,
    "category": "looking_forward",
    "title": "What does John at 50 look like?",
    "value": "Based on 22 years of pattern data",
    "detail": "The trajectory suggests: continued career growth (Executive Director is not the ceiling). More international travel (post-COVID trend accelerating). Network consolidation (fewer but deeper connections). The comeback architecture means any future setback will generate its own response. The writing will continue — 22 years is a commitment, not a habit.",
    "sort_order": 23
  },
  {
    "id": 180,
    "category": "looking_forward",
    "title": "Victoria Grace Tronolone?",
    "value": "Appears with a question mark in 2008's Yeah I Said It",
    "detail": "Either a speculative baby name, a family member, or a literary device. Victoria = victory. Grace = grace. The question mark is the point — some futures are held as possibilities, not plans.",
    "sort_order": 24
  },
  {
    "id": 181,
    "category": "health",
    "title": "Average comeback time: 7 months after medical event",
    "value": "8 documented medical events, 8 comebacks. 100% rate.",
    "detail": "{\"fastest\": \"COVID quarantine \\u2192 biking (1 month)\", \"slowest\": \"Near-anorexia \\u2192 gym + family reconciliation (18 months)\", \"most_dramatic\": \"Spinal surgery Dec 2017 \\u2192 Mediterranean cruise Jun 2018 (6 months)\", \"pattern\": \"Travel is the dominant comeback mechanism (4 of 8). Fitness is second (2 of 8).\", \"100_percent_rate\": true}",
    "sort_order": 26
  },
  {
    "id": 182,
    "category": "methodology",
    "title": "VADER still needs human override on 5 milestones",
    "value": "Rob dinner, Kia purchase, Kia mileage, 10-year anniversary, nostalgic reflection",
    "detail": "Algorithmic sentiment works for ~97% of milestones but struggles with: partner milestones (VADER doesn't know Rob is important), car purchases (neutral text but positive life event), and nostalgic reflection (past tense confuses polarity). Manual overrides applied.",
    "sort_order": 27
  },
  {
    "id": 183,
    "category": "relationships",
    "title": "The 'Kevin' constellation: 5 different Kevins in John's life",
    "value": "Kevin Megill (KMJ), Kevin Abrams, Kevin Adams, Kevin Grand, Kevin & Leah",
    "detail": "A statistical anomaly or a gravitational pull? KMJ is the deepest connection (coming-out confidant, song map entry), but all 5 appear in meaningful contexts. John's social universe has a Kevin frequency bias.",
    "sort_order": 28
  },
  {
    "id": 184,
    "category": "patterns",
    "title": "6 active streaks still running",
    "value": "WWE: Consecutive Survivor Series calendar years (25); Travel: Consecutive years with major trip (19); ECD: East Coast Dodgeball continuous operation (20); Timeline: Consecutive January publications (22); Relationship: Rob & John anniversary streak (15); Career: Years at Sunrise Senior Living (14)",
    "detail": "Longest active: Timeline consecutive January publications (22 years, 2005-2026). Second: ECD continuous operation (20 years). John doesn't just do things — he builds unbroken chains.",
    "sort_order": 29
  }
]